{"243":{"id":243,"name":"22 Avenue Foch","entity_type":"facility","description":"Jeffrey Epstein's Paris apartment, located on one of the most expensive streets in the world in the 16th arrondissement. Purchased by Epstein in 2001 through a French company named SCI JEP.\n\nThe property comprised approximately 685 square meters (7,373 sq ft): three units on the second floor with views of the Arc de Triomphe, two units on the fifth floor, two cellars in the basement. Eight bedrooms, a gym, two service studios, and a purpose-built massage room. Decorated by designer Alberto Pinto. Epstein's Franco-Brazilian butler told Franceinfo that 'numerous photographs of young girls' were displayed on walls 'like family photos.'\n\nRaided by French police in September 2019 alongside Brunel's Paris offices. Sky News Data and Forensics Unit forensically verified that photographs showing Peter Mandelson in his underwear were taken at this specific address (matched metal balcony railing). Prince Andrew referenced in reporting as having been hosted at the property.\n\nSold in June 2022 to Bulgarian plastics magnate Georgi Tuchev for approximately €10 million. Some proceeds directed to Epstein victims' claims.","aliases":"","metadata":{}},"156":{"id":156,"name":"9 East 71st Street","entity_type":"facility","description":"9 East 71st Street. The Herbert N. Straus House, a seven-story neo-French Renaissance mansion on Manhattan's Upper East Side. One of the largest private residences in New York City, valued at approximately $77 million.\n\nOWNERSHIP HISTORY: Originally built in 1932. Occupied by the Birch Wathen School from 1962 to 1989. Purchased by Les Wexner for $13.2 million in 1989. Wexner renovated the property extensively. Jeffrey Epstein moved in by 1996. The property was ultimately transferred to Epstein through a series of transactions with nominal or zero consideration — deeds show $0 or '$10 and other valuable consideration.' The transfer of one of Manhattan's most valuable private homes for effectively nothing remains one of the most significant unexplained financial transactions in the Epstein-Wexner relationship.\n\nAS EPSTEIN'S HEADQUARTERS: The mansion served as Epstein's primary residence and operational base. Visitors described surveillance cameras throughout, including in bathrooms and bedrooms. Multiple victims described being abused in the mansion. The property was listed for sale by Epstein's estate after his death.","aliases":"Epstein Manhattan Mansion, Straus House","metadata":{}},"27":{"id":27,"name":"Adnan Khashoggi","entity_type":"person","description":"Saudi arms dealer. Iran-Contra middleman. BCCI Monte Carlo client. Connected to Epstein network.","aliases":"","metadata":{"photo_url":"photos/khashoggi.jpg","birth_date":"1935-07-25","death_date":"2017-06-06","nationality":"Saudi","status":"deceased"}},"20":{"id":20,"name":"Agha Hasan Abedi","entity_type":"person","description":"BCCI founder. Secret meetings with Casey alleged. Built the criminal banking empire used by CIA.","aliases":"","metadata":{"photo_url":"photos/agha_hasan_abedi.jpg"}},"181":{"id":181,"name":"Al-Waleed bin Talal","entity_type":"person","description":"Prince Al-Waleed bin Talal Al Saud (born 1955). Saudi billionaire investor, grandson of the founder of Saudi Arabia (King Abdulaziz) and of Riad El-Solh (Lebanon's first Prime Minister). Known as 'the Warren Buffett of the Middle East.' Forbes estimated net worth peaked at $20+ billion.\n\nKINGDOM HOLDING: Founder and chairman of Kingdom Holding Company, a diversified investment conglomerate with stakes in Citigroup (was largest individual shareholder at one point), Twitter (pre-Musk), Four Seasons Hotels, Lyft, and numerous other major Western companies.\n\nTRUMP CONNECTION: Al-Waleed had a documented antagonistic relationship with Donald Trump. He purchased Trump's yacht (the Trump Princess) in 1991 and the Plaza Hotel stake in 1995 — both from Trump during financial distress. The two publicly feuded on Twitter in 2015 when Al-Waleed called Trump 'a disgrace to America' and Trump called him 'dopey prince.'\n\nRITZ-CARLTON PURGE: In November 2017, Al-Waleed was detained by MBS in the Ritz-Carlton Riyadh anti-corruption purge. Held for 83 days. Released after reportedly reaching a financial settlement with the crown, estimated at over $6 billion. He has not publicly discussed the terms.\n\nNETWORK SIGNIFICANCE: Al-Waleed's investments placed Saudi royal money directly into the Western financial system at the highest levels. His Citigroup stake connected Saudi capital to the same banking institutions serving the broader Epstein network.","aliases":"Prince Al-Waleed, Alwaleed bin Talal, Prince Alwaleed","metadata":{"birth_date":"1955-03-07","nationality":"Saudi","status":"alive","photo_url":"photos/alwaleed_bin_talal.jpg"}},"38":{"id":38,"name":"Alan Dershowitz","entity_type":"person","description":"Alan Morton Dershowitz (b. 1938). Harvard Law School professor emeritus. Constitutional lawyer. Defense attorney for Jeffrey Epstein during the 2007 NPA negotiations.\n\nServed as Epstein's defense counsel during negotiations that produced the unprecedented Non-Prosecution Agreement. Named by Virginia Roberts Giuffre as a participant in Epstein's sex trafficking operation. Dershowitz and Giuffre filed competing defamation claims; Giuffre's suit was settled in 2022 (terms undisclosed). Dershowitz initially denied ever meeting Giuffre, later acknowledged meeting her but denied any sexual contact.\n\nDocumented as a frequent guest at Epstein properties, appearing in flight logs and witness testimony. Published academic arguments advocating for lowering the statutory age of consent. Connected to both Trump and Epstein legal circles — served on Trump's first impeachment defense team in 2020.\n\nFlight logs and witness depositions place Dershowitz at Epstein's residences in Manhattan, Palm Beach, New Mexico, and the US Virgin Islands on multiple occasions.","aliases":"","metadata":{"photo_url":"photos/dershowitz.jpg","birth_date":"1938-09-01","nationality":"American","status":"alive"}},"220":{"id":220,"name":"Alan Greenspan","entity_type":"person","description":"Chairman of the Federal Reserve (1987-2006), appointed by Reagan. Received the Social Security Reform Proposals memo from Edwin Harper referencing 'the paper we discussed at the Bohemian Grove' (1981 Reagan Library document). Chaired the Greenspan Commission that recommended the cuts Reagan signed into law in 1983.","aliases":"","metadata":{"photo_url":"photos/alan_greenspan.jpg"}},"7":{"id":7,"name":"Alex Karp","entity_type":"person","description":"Palantir CEO. PhD from Frankfurt School lineage. Runs Palantir's intelligence community relationships.","aliases":"","metadata":{"photo_url":"photos/karp.jpg","birth_date":"1967-10-02","nationality":"American","status":"alive"}},"37":{"id":37,"name":"Alexander Acosta","entity_type":"person","description":"Robert Alexander Acosta (b. 1969). US Attorney for the Southern District of Florida (2005-2009). US Secretary of Labor (2017-2019).\n\nAs US Attorney, Acosta negotiated the 2007 Non-Prosecution Agreement with Jeffrey Epstein — an unprecedented deal that allowed Epstein to plead guilty to state solicitation charges, serve 13 months in county jail with work release privileges, and register as a sex offender, while shielding unnamed co-conspirators from federal prosecution. Victims were not notified as required by the Crime Victims' Rights Act (later ruled a violation by Judge Kenneth Marra in 2019).\n\nAccording to the Daily Beast (2019), Acosta told the Trump transition team during his vetting for Labor Secretary that he had been told to back off the Epstein case because Epstein 'belonged to intelligence.' Despite this disclosure, Trump appointed Acosta as Secretary of Labor in 2017.\n\nResigned from the Labor Secretary position in July 2019, days after renewed scrutiny of the NPA following Epstein's re-arrest by SDNY.","aliases":"","metadata":{"photo_url":"photos/acosta.jpg","birth_date":"1969-01-16","nationality":"American","status":"alive"}},"259":{"id":259,"name":"Andres Pastrana","entity_type":"person","description":"President of Colombia 1998-2002. Born August 17, 1954, Bogota.\n\nAppears on Jeffrey Epstein flight logs: March 20, 2003 flight from Teterboro to Palm Beach, and March 21 from Palm Beach to Nassau. Ghislaine Maxwell and Jean-Luc Brunel were on both flights. Pastrana admitted traveling from Nassau to Havana, Cuba at invitation of Fidel Castro, using Epstein's transport — this leg does NOT appear in FAA records.\n\nReferenced in at least 37 files in the January 2026 DOJ release, including email exchanges with Maxwell from 2003-2004. Released files include photos of Pastrana and Maxwell wearing Colombian Air Force pilot uniforms. Maxwell claimed Pastrana organized 'the party' in Colombia where she flew a Black Hawk helicopter over the Amazon. April 2003 FedEx shipment from Epstein to Pastrana documented.\n\nFebruary 9, 2026: Colombian ruling-party candidate filed criminal complaint against Pastrana over the Epstein files.","aliases":"","metadata":{"photo_url":"photos/andres-pastrana.jpg"}},"40":{"id":40,"name":"Angelo Bruno","entity_type":"person","description":"Angelo Bruno (1910-1980). 'The Docile Don' and 'The Gentle Don.' Boss of the Philadelphia crime family from 1959 until his assassination in 1980. Commission member and Meyer Lansky partner.\n\nTERRITORY: Controlled organized crime operations throughout the greater Philadelphia metropolitan area and South Jersey from his rowhouse at 934 Snyder Avenue in South Philadelphia's Lower Moyamensing neighborhood. His influence extended through the Italian Market on 9th Street, Passyunk Avenue, and the entire South Philadelphia Italian-American community.\n\nPHILOSOPHY: Bruno treated violence as a business decision with a cost-benefit analysis. He preferred bribery over bullets, paying off politicians, police, and judges. He banned family involvement in narcotics, fearing the long sentences and law enforcement attention. Over 21 years, he successfully avoided the scrutiny that plagued other families. This philosophy ultimately killed him — subordinates wanting drug money conspired against him.\n\nLANSKY PARTNERSHIP: Partnered with Meyer Lansky on casino operations including the Colony Sports Club in London. The Bruno-Lansky relationship was a gambling partnership connecting Philadelphia's territorial control to Lansky's global financial network.\n\nCOMMISSION SEAT: First Philadelphia boss to hold an influential seat on the Commission, secured through his close friendship with Carlo Gambino. This gave Philadelphia unprecedented standing in the national syndicate.\n\nASSASSINATION: On March 21, 1980, a shotgun blast killed Bruno as he sat in his car outside 934 Snyder Avenue. His own consigliere, Antonio 'Tony Bananas' Caponigro, ordered the hit. Caponigro had been lied to by Genovese boss Frank 'Funzi' Tieri, who said the Commission approved — it had not. Caponigro was found tortured and dead in a Bronx car trunk weeks later. Bruno's murder triggered a succession war that claimed 20+ lives.","aliases":"The Docile Don, The Gentle Don","metadata":{"birth_date":"1910-05-21","death_date":"1980-03-21","nationality":"American","status":"deceased","photo_url":"photos/angelo_bruno.jpg"}},"69":{"id":69,"name":"Apollo Global Management","entity_type":"organization","description":"Private equity firm co-founded by Leon Black. Paid Epstein $158M in advisory fees.","aliases":"Apollo","metadata":{}},"203":{"id":203,"name":"Ari Ben-Menashe","entity_type":"person","description":"Ari Ben-Menashe (born 1951, Tehran, Iran). Former Israeli military intelligence (Aman) officer who served from 1977 to 1987. Author of 'Profits of War: Inside the Secret U.S.-Israeli Arms Network' (1992), a detailed account of Israeli intelligence operations including arms deals with Iran.\n\nKEY TESTIMONY — MAXWELL AS MOSSAD AGENT: Ben-Menashe is the most significant on-record source identifying Robert Maxwell as an Israeli intelligence operative. He testified that Maxwell was recruited by Israeli intelligence and served as a key asset for decades — facilitating arms deals, distributing backdoored PROMIS software to foreign governments, and operating as a conduit between Israeli intelligence and political/business networks worldwide. His account was corroborated by subsequent investigations (Gordon Thomas, Seymour Hersh).\n\nIRAN-CONTRA TESTIMONY: Ben-Menashe provided detailed testimony about Israel's central role in the Iran-Contra affair — specifically that Israel initiated and facilitated arms sales to Iran before the U.S. became directly involved. He described a three-way pipeline: Israeli arms to Iran, with proceeds funding Contra operations in Nicaragua. His credibility was attacked by both Israeli and U.S. governments, but key elements of his testimony were later confirmed by declassified documents and the Tower Commission.\n\nEPSTEIN CONNECTION: Ben-Menashe stated in multiple interviews that Ghislaine Maxwell introduced Jeffrey Epstein to Israeli intelligence, continuing Robert Maxwell's operational relationship. He identified Epstein's operation as a sexual blackmail scheme run for Israeli intelligence — the same operational pattern documented in MKULTRA/Midnight Climax but attributed to Mossad rather than CIA. While Ben-Menashe's specific claims about Epstein-Mossad are not independently confirmed at the 'documented' tier, his track record on Maxwell and Iran-Contra lends credibility.\n\nPOST-INTELLIGENCE CAREER: Became a political lobbyist and consultant. Arrested in 1989 by U.S. authorities for allegedly brokering illegal arms sales; acquitted in 1990 after presenting evidence of Israeli government authorization. Now based in Montreal.","aliases":"Ben-Menashe","metadata":{"birth_year":1951,"nationality":"Israeli-Iranian","status":"alive","photo_url":"photos/ari_ben_menashe.jpg"}},"139":{"id":139,"name":"Ari Emanuel","entity_type":"person","description":"Ariel Zev Emanuel (b. 1961). CEO of Endeavor (parent of WME talent agency), CEO and executive chairman of TKO Group Holdings (UFC/WWE). One of the most powerful figures in Hollywood whose position at the apex of the entertainment industry intersects with the broader power network through family and business connections.\n\nFAMILY: Son of Benjamin Emanuel, a pediatrician who was active in the Irgun in Mandatory Palestine. Brother of Rahm Emanuel (White House Chief of Staff under Obama, Mayor of Chicago, US Ambassador to Japan) and Ezekiel Emanuel (oncologist and bioethicist). The Emanuel family bridges entertainment, politics, and healthcare policy at the highest levels.\n\nCAREER: Founded Endeavor Talent Agency and orchestrated its 2009 merger with the William Morris Agency to create WME — the most powerful talent agency in Hollywood. Took Endeavor public in 2021. Represents over 1,000 A-list clients. Described by the New York Times as 'the pre-eminent power player in Hollywood.' Net worth estimated at over $1 billion.\n\nNETWORK SIGNIFICANCE: Emanuel's position makes him a gatekeeper of the entertainment industry. He was reportedly involved in efforts to manage the fallout from the Weinstein scandal through talent agency channels. His rival Casey Wasserman — the LA 2028 Olympics chief — appeared in the Epstein files with flight logs and suggestive emails with Ghislaine Maxwell, and has accused Emanuel of fueling outrage over those revelations. Emanuel is interested in acquiring parts of Wasserman's agency as it is forced to sell. The Weinstein-era Hollywood power dynamics reveal how talent agency executives function as nodes connecting entertainment, politics, and media control.","aliases":"Ariel Emanuel","metadata":{"birth_year":1961,"nationality":"American","status":"alive","photo_url":"photos/ari_emanuel.jpg"}},"257":{"id":257,"name":"Augusto Pinochet","entity_type":"person","description":"Military general who seized power September 11, 1973 in CIA-backed coup overthrowing democratically elected President Salvador Allende of Chile. Born November 25, 1915. Died December 10, 2006.\n\nCIA spent $8 million between 1970-1973 on Chilean intervention — over $3 million in 1972 alone. Church Commission (1975) found U.S. covert involvement 'extensive and continuous' from 1963-1973. Declassified 2023 documents show Nixon and Kissinger knew of military plans to overthrow Allende days before the coup. CIA briefed Nixon on the morning of the coup that Chilean military were 'determined to restore political and economic order.'\n\nChile was a founding member and key coordinator of Operation Condor — the transnational repression network across Southern Cone dictatorships. At least 654 documented victims of transnational kidnapping, torture, and disappearance.","aliases":"","metadata":{"photo_url":"photos/augusto-pinochet.jpg"}},"185":{"id":185,"name":"BAE Al-Yamamah Deal","entity_type":"event","description":"BAE Systems Al-Yamamah Deal. The largest arms deal in British history, signed in 1985 between the UK and Saudi Arabia, with ongoing phases through 2005+. Total value estimated at over 43 billion GBP ($80+ billion).\n\nTHE DEAL: Saudi Arabia purchased Tornado and Typhoon fighter jets, other military aircraft, munitions, and training from BAE Systems (then British Aerospace). Payments were made in crude oil shipments, creating a complex financial structure that made commission tracking extremely difficult.\n\nSLUSH FUND: The UK Serious Fraud Office (SFO) investigation revealed commission payments to Saudi officials estimated at over 1 billion GBP. Wafic Said, a Syrian-born Saudi-based businessman, brokered the deal and received estimated commissions of $200+ million. Prince Bandar bin Sultan received payments of at least $1 billion into accounts at Riggs Bank in Washington, documented by the Guardian's investigation.\n\nCOVER-UP: The SFO investigation was shut down in December 2006 under direct pressure from Prime Minister Tony Blair's government, citing 'national security.' The DOJ subsequently fined BAE Systems $400 million in 2010 for false statements related to overseas payments. The Al-Yamamah slush fund represents one of the largest documented corruption pipelines between Western arms manufacturers and Saudi royals.","aliases":"Al-Yamamah, BAE Systems Al-Yamamah, Al Yamamah","metadata":{}},"54":{"id":54,"name":"BCCI","entity_type":"organization","description":"Bank of Credit and Commerce International. CIA's criminal banking arm. Secretly owned First American Bank. Shut down 1991.","aliases":"Bank of Credit and Commerce International","metadata":{}},"99":{"id":99,"name":"BCCI Shutdown (1991)","entity_type":"event","description":"Bank of England shut down BCCI July 5, 1991. Largest bank fraud in history at the time.","aliases":"","metadata":{}},"251":{"id":251,"name":"BND","entity_type":"agency","description":"Bundesnachrichtendienst — Germany's foreign intelligence service. Literally created by the CIA.\n\nHistory: The Gehlen Organization was established June 1946 by U.S. occupation authorities, headed by Reinhard Gehlen — former Wehrmacht Major General and head of Nazi military intelligence on the Eastern Front (Fremde Heere Ost). CIA assumed formal responsibility in July 1949, supplying funding, cars, and airplanes. On April 1, 1956, the Gehlen Organization was formally transferred to the Federal Republic of Germany under Chancellor Adenauer, becoming the BND.\n\n1998: U.S. Congress passed the Nazi War Crimes Disclosure Act, declassifying thousands of CIA documents about the Gehlen/BND relationship. The CIA's own two-volume history 'Forging an Intelligence Partnership: CIA and the Origins of the BND, 1945-49' was released.\n\nBND-Mossad cooperation documented from 1957, beginning after the Suez War. Mossad used BND cooperation during Operation Wrath of God (post-Munich 1972). Germany has been a key mediator in Israel-Hezbollah prisoner exchanges since the 1990s. Recent 'Cyber Dome' initiative expands BND-Mossad cooperation.","aliases":"Bundesnachrichtendienst, Gehlen Organization","metadata":{}},"24":{"id":24,"name":"Barry Seal","entity_type":"person","description":"CIA drug pilot operating out of Mena Airport. Used Southern Air Transport aircraft. Assassinated 1986.","aliases":"Adler Berriman Seal","metadata":{"photo_url":"photos/barry_seal.jpg","birth_date":"1939-07-16","death_date":"1986-02-19","nationality":"American","status":"deceased"}},"73":{"id":73,"name":"Bayrock Group","entity_type":"organization","description":"Bayrock Group LLC. Real estate development company headquartered in Trump Tower. Founded by Tevfik Arif, a former Soviet-era government official from Kazakhstan. Felix Sater served as managing director. Partnered with the Trump Organization on Trump SoHo and multiple other projects. Connected to Russian and Central Asian capital flows documented in litigation (Kriss v. Bayrock) and investigative reporting. Financing sources and business relationships have been the subject of congressional inquiry and multiple lawsuits alleging money laundering.","aliases":"","metadata":{}},"58":{"id":58,"name":"Bear Stearns","entity_type":"organization","description":"Epstein's former employer. Served as broker to BCCI — hidden until 2011 UK Sandstorm Report.","aliases":"","metadata":{}},"232":{"id":232,"name":"Bechtel Corporation","entity_type":"organization","description":"One of the largest private corporations in the world — massive government construction contracts. Bechtel family has been involved in Bohemian Club for generations. Textbook revolving door: executives Caspar Weinberger (VP/GC → SecDef) and George Shultz (President → SecState) moved directly into Reagan cabinet. Won hundreds of millions in Iraq reconstruction contracts from Bush admin. Currently positioned for billions in Trump-era deals.","aliases":"","metadata":{}},"118":{"id":118,"name":"Berger Archives Theft (2003)","entity_type":"event","description":"In October 2003, while preparing to testify before the 9/11 Commission on behalf of the Clinton administration, National Security Advisor Sandy Berger was caught removing classified documents from the National Archives. He physically stuffed papers into his pants and socks. The stolen materials were five copies of a report by Richard Clarke on the Clinton administration's handling of the 2000 millennium bomb plots. Berger destroyed three copies by cutting them with scissors. He pled guilty in 2005 to a misdemeanor, was fined $50,000, sentenced to probation, and stripped of his security clearance. The event is significant because it suggests the Clinton administration had something in its counter-terrorism record worth destroying prior to the 9/11 Commission's review.","aliases":"Sandy Berger Archives Scandal","metadata":{"date":"2003-10-01"}},"168":{"id":168,"name":"Bernard Schwartz","entity_type":"person","description":"Bernard L. Schwartz (1925-2024). Chairman and CEO of Loral Space & Communications (1972-2006). During the 1996 election cycle, Schwartz was the single largest individual donor to the Democratic Party — he and his wife contributed $1,122,000, of which $1,089,750 went to Democratic candidates and committees.\n\nTECHNOLOGY TRANSFER: Loral and Hughes Electronics were found by the Cox Committee (1999) to have 'illegally' provided China with technical assistance that improved the reliability of Chinese ballistic missiles used to launch satellites — and potentially nuclear warheads. In 1996, Loral helped Chinese engineers diagnose a Long March 3B rocket failure, sharing information on guidance and fairing design without the legally required State Department export license, in violation of the International Traffic in Arms Regulations (ITAR).\n\nCLINTON CONNECTION: Between October 1995 and March 1996 — while Clinton was deciding whether to grant Loral waivers to export satellite technology to China — Schwartz injected more than $150,000 into DNC coffers. In 1996, Clinton transferred satellite export licensing from State Department to Commerce Department (less restrictive). Schwartz celebrated his 71st birthday at the White House with the Clintons.\n\nLEGAL OUTCOME: Exonerated by DOJ in campaign finance matter. Loral settled the missile technology transfer case in 2002, paying a $14 million fine. Hughes Electronics fined $32 million in 2003 for the same technology transfer.","aliases":"Bernie Schwartz, Bernard L. Schwartz","metadata":{"photo_url":"photos/bernard_schwartz.jpg"}},"32":{"id":32,"name":"Bill Clinton","entity_type":"person","description":"Arkansas Governor, later President. Sent AR National Guard to Honduras. Pardoned Marc Rich. Epstein flight logs document 26+ flights on Epstein's aircraft.","aliases":"William Clinton","metadata":{"photo_url":"photos/clinton.jpg","birth_date":"1946-08-19","nationality":"American","status":"alive"}},"25":{"id":25,"name":"Bill Hamilton","entity_type":"person","description":"INSLAW founder. Developed PROMIS software, which DOJ stole and distributed to intelligence agencies worldwide.","aliases":"William Hamilton","metadata":{"photo_url":"photos/bill_hamilton.jpg"}},"109":{"id":109,"name":"Bill Richardson","entity_type":"person","description":"William Blaine Richardson III (1947-2023). Democratic politician who served as U.S. Representative from New Mexico (1983-1997), U.S. Ambassador to the United Nations (1997-1998), Secretary of Energy (1998-2001), and Governor of New Mexico (2003-2011). Ran unsuccessfully for the 2008 Democratic presidential nomination. After leaving government, he became known as a freelance diplomat who helped negotiate the release of Americans detained abroad.\n\nEPSTEIN CONNECTION: Epstein owned Zorro Ranch, a 7,500-acre property near Stanley, New Mexico. Virginia Giuffre testified in her 2016 deposition that Ghislaine Maxwell directed her to give Richardson a 'massage' at the ranch — testimony Giuffre has clarified meant providing sexual services. Richardson denied ever meeting Giuffre. Epstein contributed $50,000 to Richardson's 2002 gubernatorial campaign and again to his 2006 reelection; Richardson pledged to return or donate the money to charity after allegations surfaced.\n\nPOST-CONVICTION CONTACT: DOJ files released in 2025 revealed Richardson arranged to meet with Epstein at least nine times between 2010 and 2018 — years after Epstein's 2008 sex crime conviction in Florida. This included visits to Epstein's private island. The continued contact post-conviction is significant because it demonstrates awareness of Epstein's criminal history while maintaining the relationship.\n\nKISSINGER ASSOCIATES: After leaving the governorship, Richardson served as Senior Managing Director at Kissinger McLarty Associates beginning in 2001, connecting him to the broader establishment power network. Richardson died in his sleep on September 1, 2023, at age 75.","aliases":"William Blaine Richardson III","metadata":{"birth_date":"1947-11-15","death_date":"2023-09-01","nationality":"American","status":"deceased","photo_url":"photos/bill_richardson.jpg"}},"132":{"id":132,"name":"Birthright Israel","entity_type":"organization","description":"Birthright Israel (Taglit). Free 10-day trip program for Jewish young adults aged 18-26 to visit Israel. Co-founded in 1994 by Mega Group members Charles Bronfman and Michael Steinhardt, with the first trip in 1999. Motivated by the 1990 National Jewish Population Survey showing 52% intermarriage rates. Bronfman and Steinhardt each contributed $8 million initially. Funded 67% by individual donors, 27% by the Israeli government, 3% by Jewish federations, and 3% by the Jewish Agency. Over 800,000 participants by 2024. Birthright represents the Mega Group's signature public initiative — connecting American Jewish identity to the Israeli state through the same network of billionaire donors whose members intersect with the Epstein operation.","aliases":"Taglit, Taglit-Birthright Israel","metadata":{}},"142":{"id":142,"name":"Black Cube","entity_type":"organization","description":"Black Cube (BC Strategy Ltd). Private intelligence firm founded in 2010 by former Israeli intelligence officers Dan Zorella and Avi Yanus. Based in London, Tel Aviv, and Madrid. Staffed by former members of Mossad and Aman (Israeli military intelligence). Board included former Mossad director Meir Dagan (honorary president, deceased) and former Mossad director Efraim Halevy. Clients include wealthy individuals, oligarchs, and global corporations. Most notoriously hired by Harvey Weinstein — on referral from former Israeli PM Ehud Barak — to surveil, infiltrate, and discredit sexual assault accusers and investigative journalists. Operatives used fabricated identities to approach targets at The New Yorker, New York Times, and New York magazine, compiling psychological profiles focusing on personal and sexual histories. The Barak-Weinstein-Black Cube triangle connects directly to the Epstein network: Barak co-founded Carbyne with Epstein investment, received Wexner Foundation money, and was photographed entering Epstein's Manhattan residence. Black Cube represents the privatization of Israeli intelligence capabilities for the protection of predators within the same network.","aliases":"BC Strategy Ltd","metadata":{}},"49":{"id":49,"name":"Blinky Palermo","entity_type":"person","description":"Frank 'Blinky' Palermo (1905-1996). Philadelphia mob figure and boxing racket operator. Partner of Frankie Carbo in controlling professional boxing. Managed heavyweight champion Sonny Liston and numerous other fighters. Their joint control of boxing demonstrates the Philadelphia-New York organized crime partnership. Connected to the Philadelphia crime family. Convicted alongside Carbo for conspiracy and extortion in boxing.","aliases":"Frank Palermo","metadata":{"birth_date":"1905-03-19","death_date":"1996-02-09","nationality":"American","status":"deceased","photo_url":"photos/blinky_palermo.jpg"}},"230":{"id":230,"name":"Bohemian Club","entity_type":"organization","description":"Invite-only, men-only social club in San Francisco, founded 1872. Hosts annual summer encampments at Bohemian Grove — 2,700-acre campground in Monte Rio, CA. Members include presidents, CEOs, bankers, Supreme Court justices, CIA directors. Leaked 2023 membership/attendance lists obtained by Daniel Boguslaw reveal ongoing elite policy coordination despite motto 'Weaving spiders come not here.' Social Security cuts, capital gains cuts, Project 2025 all traced to Grove discussions.","aliases":"","metadata":{}},"228":{"id":228,"name":"Brendan Bechtel","entity_type":"person","description":"Current CEO of Bechtel Corporation, latest heir to the Bechtel fortune. On 2023 Bohemian Grove attendance list. Appeared with Trump and David McCormick for PA AI data center deal. Bechtel positioned for billions in Trump-era construction: foreign deals brokered by Trump, Venezuelan pipeline interests, floated as beneficiary of Kushner/Trump Gaza rebuild plan.","aliases":"","metadata":{"photo_url":"photos/brendan_bechtel.jpg"}},"46":{"id":46,"name":"Bugsy Siegel","entity_type":"person","description":"Benjamin 'Bugsy' Siegel (1906-1947). Murder Incorporated co-founder and the man who built Las Vegas. Childhood friend and lifelong partner of Meyer Lansky. Sent west by the syndicate to establish operations in California and Las Vegas. Built the Flamingo Hotel (1946), transforming Las Vegas from a desert outpost into the mob's legitimate front. Cost overruns and skimming led the Commission to approve his murder. Shot through the window of his Beverly Hills home on June 20, 1947. Frankie Carbo was one of several suspected triggermen. Within 20 minutes of the shooting, Lansky associates walked into the Flamingo and took control.","aliases":"Benjamin Siegel","metadata":{"photo_url":"photos/siegel.jpg","birth_date":"1906-02-28","death_date":"1947-06-20","nationality":"American","status":"deceased"}},"70":{"id":70,"name":"CAPCOM","entity_type":"organization","description":"BCCI commodities affiliate. Billions in anonymous trading with ties to telecom executives and intelligence figures.","aliases":"","metadata":{}},"85":{"id":85,"name":"CIA","entity_type":"agency","description":"Central Intelligence Agency. Created by National Security Act 1947. MKULTRA, BCCI banking, Iran-Contra, sexual blackmail operations documented.","aliases":"Central Intelligence Agency","metadata":{}},"173":{"id":173,"name":"CITIC Group","entity_type":"organization","description":"China International Trust and Investment Corporation (CITIC Group). State-owned investment conglomerate established in 1979 at the direction of Deng Xiaoping. One of China's largest and most influential financial and industrial conglomerates.\n\nMILITARY-INTELLIGENCE CONNECTIONS: The Rand Corporation identified CITIC as a front for the PLA in 1997. CITIC's vice chair Xiong Xianghui was drawn from the Intelligence Bureau of the Joint Staff Department. Poly Group — the PLA's global munitions arm — started in 1983 as a CITIC subsidiary before spinning off. Wang Jun simultaneously chaired both CITIC and Poly Technologies.\n\nEPSTEIN CONNECTION: DOJ-released emails (2025) document that Desmond Shum introduced CITIC senior leadership directly to Jeffrey Epstein, facilitated by Lord Peter Mandelson. Shum discussed creating an 'offshore banking' business in China with Epstein, involving the CITIC chairman and senior Chinese government financial officials.\n\nRepresents the institutional fusion of Chinese state capital, military interests, and intelligence operations — a state-level parallel to the Western intelligence-finance nexus already mapped in this network.","aliases":"CITIC, China International Trust and Investment Corporation","metadata":{}},"95":{"id":95,"name":"COINTELPRO","entity_type":"program","description":"FBI domestic counterintelligence program. 2,370 approved actions (1956-71). Sexual disruption as explicit technique.","aliases":"Counter Intelligence Program","metadata":{}},"67":{"id":67,"name":"Carbyne","entity_type":"organization","description":"Israeli emergency call-handling tech company. Co-founded by Ehud Barak. Epstein invested. Potential mass surveillance vector.","aliases":"Carbyne911","metadata":{}},"184":{"id":184,"name":"Carlyle Group","entity_type":"organization","description":"The Carlyle Group. Washington, D.C.-based global private equity firm founded in 1987 by David Rubenstein, William Conway Jr., and Daniel D'Aniello. One of the world's largest alternative asset managers, with over $300 billion in assets under management.\n\nSAUDI-BUSH NEXUS: The Carlyle Group became the most visible institutional bridge between Saudi money and American political power. George H.W. Bush served as senior advisor to Carlyle's Asia fund (1998-2003). James Baker III (Bush's Secretary of State) was senior counselor. Frank Carlucci (Reagan's Secretary of Defense, former CIA deputy director) was chairman (1989-2005).\n\nSAUDI INVESTORS: The Saudi Binladin Group invested in Carlyle. Prince Al-Waleed bin Talal invested through Kingdom Holding. Multiple other Saudi and Gulf investors used Carlyle as a vehicle. The bin Laden family was meeting with Carlyle Group representatives in Washington on the morning of September 11, 2001 (documented by Washington Post, Unger).\n\nDEFENSE CONTRACTS: Carlyle's portfolio included major defense contractors (United Defense Industries, which IPO'd in December 2001 after the invasion of Afghanistan). The firm profited directly from the post-9/11 military buildup — while its Saudi investors included the family of the man blamed for the attacks.","aliases":"The Carlyle Group","metadata":{}},"217":{"id":217,"name":"Caspar Weinberger","entity_type":"person","description":"Secretary of Defense under Reagan (1981-87). Bohemian Club member. Former Vice President and General Counsel of Bechtel Corporation — the textbook case of the Bechtel-to-government revolving door. Indicted in Iran-Contra, pardoned by George H.W. Bush.","aliases":"","metadata":{"photo_url":"photos/caspar_weinberger.jpg"}},"107":{"id":107,"name":"Castellano Assassination (1985)","entity_type":"event","description":"Assassination of Gambino boss Paul Castellano. On December 16, 1985, Castellano and underboss Thomas Bilotti were shot by gunmen in trench coats outside Sparks Steak House in midtown Manhattan. John Gotti orchestrated the hit and watched from a car across the street. Gotti became boss without Commission approval — violating the Mafia's fundamental governance structure. The most brazen mob hit in modern history.","aliases":"Sparks Steak House Hit","metadata":{}},"153":{"id":153,"name":"Celina Midelfart","entity_type":"person","description":"Celina Midelfart (b. February 1973, Oslo, Norway). Norwegian cosmetics heiress and businesswoman. Granddaughter of the founder of the Midelfart cosmetics company. Connected to both Epstein and Trump through the 1990s New York social scene.\n\nEPSTEIN CONNECTION: Multiple sources and Epstein's own emails describe Midelfart as one of Epstein's girlfriends in the mid-1990s. Flight logs document approximately 13 flights on Epstein's private aircraft. In a released email, Epstein linked to an article about Midelfart and described her as 'my 20-year-old girlfriend in 93, that after two years I gave to Donald' — claiming credit for introducing her to Trump.\n\nTRUMP CONNECTION: Midelfart was photographed with Trump at social events in the late 1990s. According to widely reported accounts, Trump was on a date with Midelfart at the Kit Kat Club in New York when he first noticed Melania Knauss and obtained her phone number — the meeting that led to his eventual marriage.\n\nDENIALS: Through her attorney, Midelfart has stated she had a business connection with Epstein, not a personal one. She said she rented an apartment in Trump Tower during her studies in New York (1996-1998), knew Trump as a friend, and accompanied him to work-related events, but they were never in a romantic relationship.\n\nSIGNIFICANCE: Whether or not Epstein's claim to have 'given' Midelfart to Trump is accurate, the claim itself — made in Epstein's own communications — demonstrates the transactional way Epstein viewed relationships with young women and his desire to create social obligations with powerful men.","aliases":"","metadata":{"birth_year":1973,"nationality":"Norwegian","status":"alive","photo_url":"photos/celina_midelfart.jpg"}},"119":{"id":119,"name":"Charles Bronfman","entity_type":"person","description":"Charles Rosner Bronfman (b. 1931). Canadian-American billionaire businessman, philanthropist, and co-founder of the Mega Group with Les Wexner.\n\nSEAGRAM EMPIRE: Son of Samuel Bronfman, who built the Seagram spirits empire during and after American Prohibition. Samuel Bronfman's Distillers Corporation acquired Joseph E. Seagram & Sons in 1928 and grew it into one of the world's largest beverage companies. The Bronfman family fortune traces to the Prohibition era, when the family legally exported spirits from Canada to American bootleggers — a business that intersected with organized crime networks controlled by figures like Meyer Lansky and Lucky Luciano. Charles and his brother Edgar Sr. inherited the Seagram empire upon their father's death in 1971, with Charles holding various positions from 1951 to 2000.\n\nMEGA GROUP: In 1991, Charles Bronfman co-founded the Mega Group with Les Wexner — a secretive annual gathering of approximately 20 of the wealthiest pro-Israel donors in North America. The group's activities and full membership remain deliberately opaque. Jeffrey Epstein attended Mega Group meetings despite not qualifying for membership by wealth. The Mega Group has been described as the philanthropic and political coordination mechanism for an interconnected network of billionaire donors with deep ties to Israel.\n\nBIRTHRIGHT ISRAEL: Co-founded the Birthright Israel program in 1994 with fellow Mega Group member Michael Steinhardt. The program provides free 10-day trips to Israel for Jewish young adults aged 18-26. By 2024, over 800,000 participants had taken the trip. Bronfman and Steinhardt each contributed $8 million initially, alongside 15 other partners pledging $5 million apiece.\n\nROBERT MAXWELL CONNECTION: Robert Maxwell — Ghislaine Maxwell's father and documented Mossad asset — was a business partner of Charles Bronfman, linking the Bronfman network to the Maxwell intelligence pipeline that later connected to Epstein.\n\nPHILANTHROPY: Chairman of the Andrea and Charles Bronfman Philanthropies Inc., operating in Israel, the US, and Canada. Major donor to the Tel Aviv Performing Arts Center, Israel Museum, and Jewish educational initiatives. Also formerly owned the Montreal Expos baseball team (1968-1991).","aliases":"Charles Rosner Bronfman","metadata":{"birth_date":"1931-06-27","nationality":"Canadian-American","status":"alive","photo_url":"photos/charles_bronfman.jpg"}},"223":{"id":223,"name":"Charles Koch","entity_type":"person","description":"CEO of Koch Industries, synonymous with anti-worker political spending and dark money networks. Bohemian Club member/attendee. Funder of Heritage Foundation and vast network of pro-corporate advocacy organizations.","aliases":"","metadata":{"photo_url":"photos/charles_koch.jpg"}},"167":{"id":167,"name":"Charlie Trie","entity_type":"person","description":"Yah Lin 'Charlie' Trie (born c. 1950). Little Rock restaurateur and longtime friend of Bill Clinton from Arkansas. Became a key intermediary between Chinese government-connected entities and the Clinton White House.\n\nWHITE HOUSE ACCESS: Trie arranged the February 6, 1996 White House 'coffee' meeting at which Wang Jun — chairman of both CITIC and Poly Technologies (PLA arms trading company) — met President Clinton. This occurred while federal agents were building the 'Dragon Fire' case against Poly Technologies for smuggling 2,000 AK-47s into the United States.\n\nCAMPAIGN FINANCE: Delivered $460,000 in questionable contributions to the DNC and Clinton's legal defense fund. When congressional investigations focused on him in late 1996, Trie fled to China.\n\nLEGAL OUTCOME: Returned to the U.S. in 1998. Convicted of violating federal campaign finance laws — making political contributions in someone else's name and causing a false statement to be made to the FEC. Sentenced to three years' probation and four months' home detention.","aliases":"Yah Lin Trie","metadata":{"photo_url":"photos/charlie_trie.jpg"}},"225":{"id":225,"name":"Clarence Thomas","entity_type":"person","description":"Supreme Court Justice (1991-present), appointed by George H.W. Bush. Attended Bohemian Grove as guest of Harlan Crow — among undisclosed luxury gifts exposed by ProPublica. Failed to disclose trips per judicial ethics requirements.","aliases":"","metadata":{"photo_url":"photos/clarence_thomas.jpg"}},"21":{"id":21,"name":"Clark Clifford","entity_type":"person","description":"Washington power broker. Front-man for BCCI's acquisition of First American Bank. Indicted 1992.","aliases":"","metadata":{"photo_url":"photos/clifford.jpg","birth_date":"1906-12-25","death_date":"1998-10-10","nationality":"American","status":"deceased"}},"238":{"id":238,"name":"Claude Haddad","entity_type":"person","description":"French modeling agent based in Paris, connected to the Ford Agency. Co-accused alongside Jean-Luc Brunel in the 1988 CBS 60 Minutes investigation 'American Girls in Paris.' Approximately two dozen models told the program that Brunel or Haddad had drugged and raped them.\n\nHaddad denied the allegations. He died in 2009. Like Brunel, he faced no criminal consequences from the 1988 exposé.","aliases":"","metadata":{}},"216":{"id":216,"name":"Colin Powell","entity_type":"person","description":"Secretary of State under George W. Bush (2001-05), Chairman of Joint Chiefs under George H.W. Bush (1989-93). Bohemian Club member — former Grove workers report he starred as the lead in the camp's production of Macbeth.","aliases":"","metadata":{"photo_url":"photos/colin_powell.jpg"}},"133":{"id":133,"name":"Colony Capital","entity_type":"organization","description":"Colony Capital LLC (now DigitalBridge). Private equity real estate firm founded by Tom Barrack in 1991, with initial investments from Robert M. Bass and GE Capital. Grew into one of the world's largest PE real estate firms with operations in 19 countries. During Trump's presidency, Colony raised over $7 billion, with 24% coming from UAE and Saudi sovereign wealth funds — $374 million from UAE entities alone, per the DOJ indictment. Barrack was indicted in 2021 for acting as an unregistered agent of the UAE while simultaneously chairing Trump's inaugural committee — though acquitted in 2022. Rebranded as DigitalBridge in June 2021, pivoting to digital infrastructure. The firm represents the financial pipeline between Gulf state sovereign wealth and Trump-aligned political influence.","aliases":"DigitalBridge, Colony Capital LLC","metadata":{}},"106":{"id":106,"name":"Commission Trial (1986)","entity_type":"event","description":"US v. Salerno et al. The Mafia Commission Trial (1985-1986). Federal RICO prosecution of the bosses of three of the Five Families: Fat Tony Salerno (Genovese), Tony Ducks Corallo (Lucchese), and Carmine Persico (Colombo). All convicted. Salerno received 100 years. The trial broke the Commission's power as a governing body and demonstrated that RICO could dismantle organized crime leadership.","aliases":"US v. Salerno","metadata":{}},"147":{"id":147,"name":"Courtney Wild","entity_type":"person","description":"Courtney Wild. Epstein victim and legal advocate who led the most significant challenge to the 2007 Non-Prosecution Agreement through the federal courts.\n\nRECRUITMENT: Wild was 14 years old when she was first recruited to Epstein's Palm Beach mansion in 2001. A friend told her about 'a really cool guy on Palm Beach Island' from whom they could earn $200 for a massage. Wild had been a straight-A student, cheerleading captain, and first chair trumpet, but her parents' struggles with addiction and homelessness had destabilized her life.\n\nGROOMING AND EXPLOITATION: Wild described being sexually abused by Epstein and then groomed into his recruitment pyramid — she was offered $200 'finder's fees' for bringing new girls to his mansion. She sometimes brought two or three girls in a single day. Epstein groomed her to be, in her words, his 'personal sex slave that brought him underage girls.'\n\nCRIME VICTIMS' RIGHTS ACT CHALLENGE: In 2014, Wild (as Jane Doe 1) filed a federal civil suit against the United States for violations of the Crime Victims' Rights Act, arguing that federal prosecutors violated victims' rights when they secretly negotiated the 2007 NPA with Epstein's attorneys without notifying or consulting victims as required by law.\n\nLEGAL OUTCOME: A federal district court ruled that victims' rights were violated. However, in April 2020, the 11th Circuit narrowly reversed, ruling that because the government never formally filed charges, the CVRA was technically never triggered. In 2022, the US Supreme Court declined to hear Wild's appeal. The case inspired the proposed 'Courtney Wild Reinforcing Crime Victims' Rights Act' introduced in Congress.\n\nSIGNIFICANCE: Wild fought for over 10 years through federal courts to hold the government accountable for the NPA. Her case exposed the legal mechanisms by which Acosta's office shielded Epstein and his co-conspirators from meaningful prosecution.","aliases":"Jane Doe 1","metadata":{"nationality":"American","status":"alive","photo_url":"photos/courtney_wild.jpg"}},"175":{"id":175,"name":"Cox Report (1999)","entity_type":"event","description":"Cox Report (formally: Report of the Select Committee on U.S. National Security and Military/Commercial Concerns with the People's Republic of China). Classified January 3, 1999; declassified version released May 25, 1999. 3-volume, 871-page investigation commissioned by a 409-10 vote of the U.S. House of Representatives on June 18, 1998.\n\nKEY FINDINGS: (1) China stole design information on the seven most advanced U.S. thermonuclear weapons, including the W-88 miniaturized warhead for the Trident II submarine-launched missile. (2) Hughes and Loral 'illegally' transferred missile technology to China — improving fairing design (1993, 1995) and rocket guidance (1996) — violating ITAR without required State Department licenses. (3) The stolen secrets enabled the PLA to accelerate development of its own nuclear weapons.\n\nRECOMMENDATIONS: 38 recommendations including strengthening Energy Department counterintelligence, tightening export controls on dual-use technologies, and giving State and Defense more oversight of satellite exports.\n\nThe Cox Report represents the most comprehensive official investigation of Chinese technology acquisition from the United States, documenting both espionage and legal technology transfer facilitated by corporate lobbying and campaign finance connections.","aliases":"Cox Committee Report","metadata":{}},"13":{"id":13,"name":"Craig Spence","entity_type":"person","description":"DC lobbyist who ran bugged apartments. Entered Bush White House with minors. Predicted CIA would kill him. Found dead, ruled suicide.","aliases":"","metadata":{"photo_url":"photos/craig_spence.jpg"}},"197":{"id":197,"name":"Crown Prosecution Service","entity_type":"agency","description":"Crown Prosecution Service (CPS). The principal prosecuting authority for criminal cases investigated by the police in England and Wales. Established 1986.\n\nEPSTEIN-RELATED DECISIONS: The CPS reviewed evidence related to Virginia Giuffre's allegations of being trafficked to London for sexual encounters with Prince Andrew. The CPS declined to prosecute, citing jurisdictional issues and insufficient evidence meeting the threshold for prosecution under English law. This decision was made despite the existence of Giuffre's detailed sworn testimony in US proceedings.\n\nSAVILE-RELATED FAILURES: The CPS reviewed evidence against Savile on at least three occasions during his lifetime (2007, 2008, 2009) but declined to prosecute each time. Post-mortem investigations revealed these decisions were based on flawed processes and insufficient investigation by police.\n\nRepresents the UK legal system's institutional failure to prosecute elite abusers — the British counterpart to the DOJ's handling of the Epstein case (the 2007 NPA, the Acosta deal, the delayed 2019 arrest).","aliases":"CPS","metadata":{}},"90":{"id":90,"name":"DARPA","entity_type":"agency","description":"Defense Advanced Research Projects Agency. Ran Total Information Awareness program. LifeLog program.","aliases":"Defense Advanced Research Projects Agency","metadata":{}},"252":{"id":252,"name":"DFS Deutsche Bank Consent Order (2020)","entity_type":"event","description":"New York Department of Financial Services consent order against Deutsche Bank, issued July 7, 2020. Penalty: $150 million. First regulatory enforcement action against a financial institution for its Epstein dealings.\n\nKey findings from the consent order:\n- Deutsche Bank onboarded Epstein in August 2013 (after JPMorgan dropped him), maintaining over 40 accounts until December 2018.\n- Before onboarding, a junior relationship coordinator prepared a memo detailing Epstein's '17 out-of-court civil sex abuse settlements,' his plea deal, and prison sentence. Superiors decided to proceed anyway.\n- Paul Morris (relationship manager from JPMorgan) pitched Epstein as a $2-4M/year revenue client. Charles Packard (head of wealth management) approved.\n- Epstein's attorney withdrew more than $800,000 in cash, repeatedly asking how to avoid triggering reporting requirements, then structuring withdrawals below $10,000 across multiple days.\n- At least 18 wires of $10,000+ to named co-conspirators.\n- Payments to young women, Russian models, women with Eastern European surnames, hotel/rent expenses, school tuition.\n- Settlement payments exceeding $7 million and legal expenses over $6 million.\n- Reputational Risk Committee conditions were 'not transmitted' to the account team.\n\nIn May 2023, Deutsche Bank separately agreed to pay $75 million to settle a civil lawsuit by Epstein victims (victims to receive $75K-$5M per claim). DB did not admit wrongdoing. Total Epstein-related penalties: $225 million.","aliases":"","metadata":{}},"242":{"id":242,"name":"DGSE","entity_type":"agency","description":"Direction Générale de la Sécurité Extérieure — France's foreign intelligence service, responsible for military intelligence and counterintelligence outside French borders. Established April 2, 1982, when President Mitterrand reformed and renamed the SDECE.\n\nDGSE's predecessor, the SDECE (Service de Documentation Extérieure et de Contre-Espionnage), was a founding member of the Safari Club. SDECE Director Alexandre de Marenches initiated the Safari Club on September 1, 1976 — making France not merely a member but the originator of the covert intelligence alliance. The Safari Club's five charter signatories: de Marenches (SDECE/France), Kamal Adham (Saudi intelligence), Kamal Hassan Ali (Egypt), Ahmed Dlimi (Morocco), and Nematollah Nassiri (Iran, pre-revolution). Saudi Arabia provided money, France provided technology, Egypt and Morocco supplied weapons and troops — all to bypass post-Church Committee Congressional restrictions on the CIA.","aliases":"Direction Générale de la Sécurité Extérieure, SDECE","metadata":{}},"89":{"id":89,"name":"DOJ","entity_type":"agency","description":"Department of Justice. Stole PROMIS from INSLAW. Epstein NPA. BCCI non-notification from CIA.","aliases":"Department of Justice","metadata":{}},"154":{"id":154,"name":"Dalton School","entity_type":"organization","description":"The Dalton School. Elite private school on Manhattan's Upper East Side. Founded in 1919. Significant in the Epstein network because headmaster Donald Barr — an OSS veteran and father of future Attorney General William Barr — hired 20-year-old Jeffrey Epstein to teach calculus and physics there in 1973-1974, despite Epstein lacking a college degree or teaching credentials. Barr resigned as headmaster in February 1974, shortly after hiring Epstein. Epstein taught at Dalton for approximately two years before leaving for Bear Stearns. The hiring decision — an OSS-connected headmaster giving an unqualified 20-year-old access to elite prep school students — has been the subject of significant scrutiny in the context of Epstein's later pattern of targeting young people.","aliases":"","metadata":{}},"26":{"id":26,"name":"Danny Casolaro","entity_type":"person","description":"Journalist investigating INSLAW/PROMIS and 'The Octopus.' Found dead in hotel bathtub 1991, ruled suicide. Arms slashed 10+ times.","aliases":"","metadata":{"photo_url":"photos/casolaro.jpg","birth_date":"1947-06-16","death_date":"1991-08-10","nationality":"American","status":"deceased"}},"103":{"id":103,"name":"Danny Casolaro Death (1991)","entity_type":"event","description":"Journalist found dead in Martinsburg WV hotel, Aug 10, 1991. Ruled suicide. Arms slashed 10+ times. Notes missing.","aliases":"","metadata":{}},"226":{"id":226,"name":"David McCormick","entity_type":"person","description":"Hedge fund billionaire (Bridgewater Associates CEO), elected U.S. Senator from Pennsylvania (2024). On the 2023 Bohemian Grove attendance list — Mandalay camp alongside Michael Bloomberg and Henry Kissinger. 11 men from Mandalay camp donated to his Senate campaign. Appeared with Trump and Brendan Bechtel at PA AI data center announcement.","aliases":"","metadata":{"photo_url":"photos/david_mccormick.jpg"}},"171":{"id":171,"name":"Desmond Shum","entity_type":"person","description":"Desmond Shum (born 1968, Shanghai). Chinese-Canadian businessman, real estate developer, and author of 'Red Roulette: An Insider's Story of Wealth, Power, Corruption, and Vengeance in Today's China' (2021). Former husband of Whitney Duan (Duan Weihong), a well-connected Chinese businesswoman with close ties to the CCP Politburo.\n\nEPSTEIN CONNECTION: Lord Peter Mandelson introduced Desmond Shum to Jeffrey Epstein in New York in February 2010. Documented in DOJ-released Epstein files (3+ million pages). In September 2010, Mandelson asked Epstein to 'nurture' his relationship with Shum.\n\nCITIC BRIDGE: In April 2011, Shum and Epstein discussed creating an 'offshore banking' business in China. Shum told Epstein he had discussed the idea with the chairman of CITIC, the vice mayor of Shanghai, and a 'top decision maker' at the State Administration of Foreign Exchange (SAFE). Email evidence shows Shum introduced CITIC senior leadership directly to Epstein — connecting Epstein to a conglomerate identified by the Rand Corporation as a PLA front.\n\nShum later published 'Red Roulette' exposing corruption at the highest levels of the CCP. His ex-wife Whitney Duan disappeared in China in 2017.","aliases":"","metadata":{"photo_url":"photos/desmond_shum.jpg"}},"57":{"id":57,"name":"Deutsche Bank","entity_type":"organization","description":"Maintained Epstein accounts via Butterfly Trust structure. Settled $75M with NYDFS in 2020. Provided $340M+ in loans to Trump after all other US banks refused. Fined for Russian mirror trading/money laundering scheme.","aliases":"","metadata":{}},"253":{"id":253,"name":"Deutsche Bank Russian Mirror Trading","entity_type":"event","description":"Deutsche Bank fined approximately $630 million for a 'mirror trading' scheme that laundered an estimated $10 billion out of Russia through DB's Moscow, London, and New York offices between 2011 and 2015.\n\nThe scheme: clients bought stocks in Moscow in rubles; related parties then sold identical stocks through Deutsche Bank's London branch in dollars. DFS fined DB $425 million (January 30, 2017); UK FCA added £163 million (~$204 million).\n\nThe DFS consent order found DB's AML/compliance units were 'ineffective and understaffed.' The Moscow branch's head of compliance was an attorney with no compliance background who simultaneously served as head of legal and AML officer.\n\nThis occurred during the same era that Deutsche Bank onboarded Epstein (2013), continued lending to Trump (~$2.5 billion cumulative), and manipulated LIBOR ($2.5 billion in fines, 2015). The same institution with the same compliance failures across multiple dimensions.","aliases":"","metadata":{}},"214":{"id":214,"name":"Dick Cheney","entity_type":"person","description":"Vice President under George W. Bush (2001-09), Secretary of Defense under George H.W. Bush (1989-93). Bohemian Club member. Former CEO of Halliburton. Key architect of Iraq War alongside fellow Grove members.","aliases":"","metadata":{"photo_url":"photos/dick_cheney.jpg"}},"164":{"id":164,"name":"Dmitry Rybolovlev","entity_type":"person","description":"Dmitry Evgenievich Rybolovlev (born 1966). Russian oligarch, potash fertilizer magnate, former owner of AS Monaco football club. Forbes-estimated net worth ~$6.8B.\n\nTRUMP CONNECTION: In 2008, purchased Donald Trump's Palm Beach estate (Maison de l'Amitié) for $95 million — more than double what Trump paid ($41.35M in 2004) — during the financial crisis when real estate values were collapsing. The transaction raised questions about whether the premium represented a legitimate investment or something else. Rybolovlev never lived in the property and demolished the mansion.\n\nPROXIMITY PATTERN: McClatchy and other outlets documented that Rybolovlev's private plane appeared at the same airports as Trump's during the 2016 campaign on multiple occasions — Charlotte, Las Vegas, and Concord, NH. Rybolovlev's spokesman called the overlaps coincidental.\n\nISLAND PROXIMITY: ABC News reported FBI obtained high-resolution photos of visitors to Epstein's island; Rybolovlev's yacht was spotted in the vicinity of Little Saint James, though direct visitation is not confirmed.","aliases":"Rybolovlev","metadata":{"photo_url":"photos/dmitry_rybolovlev.jpg"}},"9":{"id":9,"name":"Donald Barr","entity_type":"person","description":"Headmaster at Dalton School who hired Epstein to teach (1974). OSS veteran. Father of William Barr. Authored 'Space Relations' (1973), a sci-fi novel depicting oligarchs practicing sexual slavery in space.","aliases":"","metadata":{"photo_url":"photos/donald_barr.jpg","birth_date":"1921-08-08","death_date":"2004-02-05","nationality":"American","status":"deceased"}},"215":{"id":215,"name":"Donald Rumsfeld","entity_type":"person","description":"Secretary of Defense under George W. Bush (2001-06). Bohemian Club member. Co-architect of Iraq invasion with fellow Club members Bush, Cheney, and Powell.","aliases":"","metadata":{"photo_url":"photos/donald_rumsfeld.jpg"}},"33":{"id":33,"name":"Donald Trump","entity_type":"person","description":"Donald John Trump (b. 1946). 45th and 47th President of the United States. Real estate developer and media figure whose career intersects organized crime, intelligence operations, and the Epstein network through decades of documented connections.\n\nROY COHN MENTORSHIP (1973-1986): Retained attorney Roy Cohn in 1973 to fight federal housing discrimination charges. For 13 years, Cohn served as Trump's fixer, connecting him to organized crime figures, intelligence operatives, and political power brokers. Through Cohn, Trump gained access to Fat Tony Salerno (Genovese family boss) and Paul Castellano (Gambino family boss), whose S&A Concrete supplied Trump Tower construction. NJ Casino Control Commission records document these organized crime associations.\n\nRESORTS INTERNATIONAL (1987): Purchased Resorts International, a casino company with documented intelligence community connections. Resorts operated through Intertel (International Intelligence Inc.), a private intelligence firm staffed by former FBI and CIA personnel. The company had historical ties to Meyer Lansky's gambling operations. Later reorganized as Trump Taj Mahal.\n\nEPSTEIN RELATIONSHIP (~1987-2004): Social relationship documented through quotes, photographs, party footage, and flight logs. In a 2002 New York Magazine profile, Trump stated: 'I've known Jeff for 15 years. Terrific guy. He's a lot of fun to be with. It is even said that he likes beautiful women as much as I do, and many of them are on the younger side.' Trump claims to have banned Epstein from Mar-a-Lago, though the timing is disputed. Epstein's Palm Beach residence was approximately one mile from Mar-a-Lago.\n\nKEY APPOINTMENTS: Appointed Alexander Acosta — the US Attorney who gave Epstein the 2007 NPA — as Secretary of Labor (2017-2019). Appointed William Barr — whose father hired Epstein at Dalton — as Attorney General (2019-2020). Barr was AG when Epstein died in federal custody.\n\nDEUTSCHE BANK: After every major US bank refused to lend to Trump following multiple bankruptcies, Deutsche Bank provided over $340M in loans. Deutsche Bank was later fined for Russian mirror trading (money laundering) and for maintaining Epstein's Butterfly Trust accounts.\n\nFELIX SATER AND BAYROCK GROUP: Partnered with Felix Sater through Bayrock Group on Trump SoHo and other projects. Sater, a convicted felon with documented ties to Russian organized crime, was also an FBI informant. His business card read 'Senior Advisor to Donald Trump.' Bayrock connected Trump to Russian and Central Asian money flows documented in multiple lawsuits.","aliases":"","metadata":{"photo_url":"photos/trump.jpg","birth_date":"1946-06-14","nationality":"American","status":"alive"}},"120":{"id":120,"name":"Edgar Bronfman Sr.","entity_type":"person","description":"Edgar Miles Bronfman Sr. (1929-2013). CEO of Seagram, president of the World Jewish Congress, and patriarch of a family whose influence spans liquor, media, intelligence-adjacent philanthropy, and a connection to the NXIVM sex cult.\n\nSEAGRAM LEADERSHIP: Succeeded his father Samuel Bronfman as president, treasurer, and director of Seagram in 1971. Under his leadership, Seagram became one of the world's largest beverage companies. Son Edgar Jr. took over as CEO in 1994 and controversially sold the family's $8.8 billion DuPont stake to purchase MCA/Universal Studios, then merged Seagram with Vivendi in 2000 for $42 billion — a deal that ultimately destroyed the Seagram empire and cost the Bronfman family billions.\n\nWORLD JEWISH CONGRESS: Elected president in 1981, serving until 2007. Led major campaigns including exposing Austrian president Kurt Waldheim's Nazi past, advocating for Soviet Jewry, and securing Holocaust compensation from Swiss banks. His successor as WJC president was Ronald Lauder, another Mega Group-adjacent figure.\n\nNXIVM CONNECTION: Daughters Clare and Sara Bronfman became deep financial backers of NXIVM, the organization led by convicted sex trafficker Keith Raniere. Clare Bronfman invested over $100 million in NXIVM and was convicted in 2020 of racketeering conspiracy and sentenced to 81 months in federal prison. Edgar Sr. tried to intervene, calling NXIVM 'a cult' after learning Clare had given Raniere a $2 million loan, but was unable to extricate his daughters before his death in 2013.\n\nORGANIZED CRIME LINEAGE: The Bronfman fortune originated during Prohibition, when father Samuel Bronfman's liquor operations intersected with the same organized crime networks — Lansky, Luciano — that form the foundation layer of this database. The family's transition from bootlegging to legitimate empire mirrors the broader pattern of organized crime capital being laundered into respectable institutions.\n\nNETWORK POSITION: Through Seagram, the WJC, and the Mega Group (co-founded by brother Charles), Edgar Sr. sat at the center of the same philanthropic-intelligence nexus that connected Wexner to Epstein. The pattern of a billionaire dynasty with organized crime origins, pro-Israel intelligence connections, and family members entangled in sex trafficking operations is structurally significant.","aliases":"Edgar Miles Bronfman","metadata":{"birth_date":"1929-06-20","death_date":"2013-12-21","nationality":"Canadian-American","status":"deceased","photo_url":"photos/edgar_bronfman.jpg"}},"221":{"id":221,"name":"Edwin Fuelner","entity_type":"person","description":"Co-founder and longtime president of the Heritage Foundation. On the 2023 Bohemian Grove attendance list (age 82). Launched Project 2025 / Mandate for Leadership 7 at a Heritage event, explicitly referencing 'the first time it all happened' under Reagan. Heritage board member until his death in late 2025.","aliases":"","metadata":{"photo_url":"photos/edwin_fuelner.jpg"}},"219":{"id":219,"name":"Edwin Meese","entity_type":"person","description":"Attorney General under Reagan (1985-88). Bohemian Club member. Close Reagan advisor — part of the 'troika' with James Baker and Michael Deaver. Connected to Bechtel network through Grove membership.","aliases":"","metadata":{"photo_url":"photos/edwin_meese.jpg"}},"14":{"id":14,"name":"Edwin Wilson","entity_type":"person","description":"CIA/Naval Intelligence officer. Ran sexual blackmail operations targeting Congress in 1970s with Terpil.","aliases":"","metadata":{"photo_url":"photos/edwin_wilson.jpg"}},"210":{"id":210,"name":"Efraim Halevy","entity_type":"person","description":"Efraim Halevy (born 1934, London, United Kingdom). Director of the Mossad from 1998 to 2002, and head of Israel's National Security Council from 2002 to 2003.\n\nCAREER: Emigrated to Israel in 1948. Joined the Mossad in 1961 and served for over 40 years. Specialized in diplomatic and liaison intelligence — managing relationships between Mossad and foreign intelligence services. Played a key role in back-channel negotiations that led to the Israel-Jordan peace treaty (1994).\n\nMOSSAD DIRECTOR (1998-2002): Halevy's tenure as Mossad director overlapped with the period when Jeffrey Epstein's operation was most active (late 1990s-2000s). His directorship bridged the gap between Shabtai Shavit (1989-1996) and Meir Dagan (2002-2011).\n\nMAXWELL OPERATIONS: Gordon Thomas, in 'Robert Maxwell, Israel's Superspy,' documents Halevy as a key figure in managing Mossad's relationship with Robert Maxwell during the 1980s. As a senior Mossad official specializing in liaison operations, Halevy was involved in the institutional framework that Maxwell operated within.\n\nBLACK CUBE CONNECTION: Like Meir Dagan, Halevy served on the board of Black Cube after his retirement from government service. The presence of two former Mossad directors on Black Cube's board — the same firm hired by Weinstein on Barak's referral — illustrates the continuity between state intelligence operations and the privatized intelligence firms orbiting the Epstein network.\n\nPOST-SERVICE: Has written and lectured extensively on intelligence and Middle Eastern affairs. Served as head of the National Security Council and as a diplomatic envoy. Author of 'Man in the Shadows' (2006).","aliases":"Halevy","metadata":{"birth_year":1934,"nationality":"Israeli-British","status":"alive","photo_url":"photos/efraim_halevy.jpg"}},"5":{"id":5,"name":"Ehud Barak","entity_type":"person","description":"Former Israeli PM and IDF Chief of Staff. Visited Epstein's residences. Wexner Foundation paid $2M for vague 'research.' Carbyne co-founder.","aliases":"","metadata":{"photo_url":"photos/barak.jpg","birth_date":"1942-02-12","nationality":"Israeli","status":"alive"}},"237":{"id":237,"name":"Eileen Ford","entity_type":"person","description":"Co-founder of Ford Models (1946), one of the most powerful modeling agencies in the world. Died 2014.\n\nCritical role in the Brunel pipeline: Ford Models sent young American models to Jean-Luc Brunel at Karin Models in Paris for assignments. CBS 60 Minutes 'American Girls in Paris' (1988) documented that approximately two dozen models accused Brunel of drugging and raping them — models who had been referred through the Ford pipeline.\n\nFord claimed on 60 Minutes that she had not known about the abuse. She severed ties with Brunel only after the broadcast. Despite the CBS exposé, no authorities took action against Brunel at the time, and he continued working in the modeling industry — eventually launching MC2 with Epstein financing in 2005.","aliases":"","metadata":{"photo_url":"photos/eileen-ford.jpg"}},"240":{"id":240,"name":"Elite Model Management","entity_type":"organization","description":"Major international modeling agency founded in Paris by John Casablancas (1972). Became one of the world's most powerful agencies, representing supermodels including Linda Evangelista, Naomi Campbell, and Cindy Crawford.\n\nThe Paris office, run by Gérald Marie, was the epicenter of systematic abuse in the modeling industry. At least 15 women accused Marie of rape and sexual assault during his tenure. BBC MacIntyre Undercover (1999) caught Marie on hidden camera soliciting a minor. Marie resigned following the broadcast.\n\nElite operated in the same Paris modeling ecosystem as Brunel's Karin Models. The agencies shared the same pool of young models and operated parallel abuse patterns that went unaddressed by French authorities for decades.","aliases":"","metadata":{}},"101":{"id":101,"name":"Epstein Arrest (2019)","entity_type":"event","description":"SDNY arrested Epstein July 6, 2019 on sex trafficking charges.","aliases":"","metadata":{}},"102":{"id":102,"name":"Epstein Death (2019)","entity_type":"event","description":"Epstein found dead in MCC cell Aug 10, 2019. Ruled suicide. Cameras malfunctioned. Guards sleeping.","aliases":"","metadata":{}},"100":{"id":100,"name":"Epstein NPA (2007)","entity_type":"event","description":"Non-Prosecution Agreement. Acosta reportedly told Epstein 'belonged to intelligence.' Victims not notified.","aliases":"","metadata":{}},"158":{"id":158,"name":"Epstein Palm Beach Investigation (2005)","entity_type":"event","description":"Palm Beach police investigation into Jeffrey Epstein, initiated in March 2005 when a mother reported that her 14-year-old daughter was being sexually abused by an adult male at a Palm Beach mansion.\n\nLed by Police Chief Michael Reiter, detectives conducted interviews with more than 20 alleged victims and 17 witnesses over approximately one year. Victims led detectives to other victims in a cascading pattern, all telling 'basically the same story.' Reiter requested charges of at least four counts of unlawful sexual activity with a minor.\n\nThe case was referred to the FBI and US Attorney's office. An AUSA submitted a draft 60-count indictment. However, prosecutors told Reiter the witnesses were 'not credible' and became dismissive and uncooperative. The case was eventually resolved through the 2007 Non-Prosecution Agreement negotiated by US Attorney Alexander Acosta.\n\nReiter described the handling of the case as 'the worst failure of the criminal justice system' in modern times. The investigation also revealed that Epstein was likely tipped off during the probe, suggesting law enforcement leaks.","aliases":"Palm Beach Epstein Case","metadata":{}},"152":{"id":152,"name":"Eva Andersson-Dubin","entity_type":"person","description":"Eva Birgitta Andersson-Dubin (b. 1961, Uddevalla, Sweden). Physician, former model, Miss Sweden 1980, and longtime Epstein social circle member whose continued relationship with Epstein after his conviction raises significant questions.\n\nBACKGROUND: Won the Miss Sweden pageant in 1980 and placed fourth runner-up in Miss Universe 1980. Studied medicine at the Karolinska Institutet in Stockholm, then transferred to UCLA School of Medicine, earning her MD in 1989. Completed residency in internal medicine at Lenox Hill Hospital in New York. Founded the Dubin Breast Center at the Tisch Cancer Institute at Mount Sinai Hospital.\n\nEPSTEIN RELATIONSHIP: Dated Jeffrey Epstein from approximately 1981 to 1990 — one of his earliest known girlfriends. Despite ending the romantic relationship, the two remained close for decades. Epstein served as godfather to her children with Glenn Dubin.\n\nMARRIAGE TO GLENN DUBIN: Married hedge fund billionaire Glenn Dubin in 1994. Glenn Dubin co-founded Highbridge Capital Management. Bloomberg reporting in 2026 revealed that Eva Dubin's social introduction of Epstein to her husband and the hedge fund world was a critical pathway for Epstein's financial career.\n\nPOST-CONVICTION CONTACT: Among the earliest in Epstein's social circle to resume contact after his 2008 release from jail. In 2009, Andersson-Dubin wrote to Epstein's probation officer stating she was '100% comfortable with Jeffrey Epstein around my children.' Released Epstein files revealed that in 2010, she invited Epstein to visit when her 15-year-old daughter would have five friends over — an invitation that, given Epstein's documented predatory behavior toward teenage girls, raised alarming questions.\n\nMAXWELL TRIAL TESTIMONY: Testified at Ghislaine Maxwell's 2021 trial regarding her longstanding relationship with Epstein and the Epstein-Dubin social dynamic.","aliases":"Eva Dubin, Eva Andersson","metadata":{"birth_year":1961,"nationality":"Swedish-American","status":"alive","photo_url":"photos/eva_andersson_dubin.jpg"}},"200":{"id":200,"name":"Evgeny Lebedev","entity_type":"person","description":"Evgeny Alexandrovich Lebedev, Baron Lebedev of Hampton and of Siberia (born 1980). Russian-British newspaper proprietor, owner of the Evening Standard and The Independent. Son of Alexander Lebedev, former KGB officer and Russian oligarch.\n\nINTELLIGENCE CONTEXT: Lebedev's father Alexander was a KGB officer stationed at the Soviet Embassy in London (1988-1992). Evgeny was raised partly in London during this period. Alexander Lebedev subsequently became a billionaire banker in post-Soviet Russia. The UK Parliament's Intelligence and Security Committee (Russia Report, 2020) examined Russian influence operations in the UK, including the use of media ownership.\n\nPEERAGE CONTROVERSY: Boris Johnson nominated Lebedev for a life peerage in 2020 despite reported objections from MI5/MI6 on security grounds. The Intelligence and Security Committee investigated. Johnson reportedly overrode security service concerns. Lebedev took his seat in the House of Lords as Baron Lebedev.\n\nMAXWELL PARALLEL: Lebedev represents the continuation of the Robert Maxwell model — foreign-born media proprietors with intelligence connections owning major British publications. Maxwell (Czech-born, MI6/Mossad) owned the Mirror Group; Lebedev (Russian-born, KGB-connected father) owns the Evening Standard and Independent. Both used media ownership to gain political access and social influence in the UK establishment.","aliases":"Baron Lebedev, Lord Lebedev","metadata":{"photo_url":"photos/evgeny_lebedev.jpg"}},"87":{"id":87,"name":"FBI","entity_type":"agency","description":"Federal Bureau of Investigation. COINTELPRO. Hoover compromised by Lansky. CHS memo on Epstein.","aliases":"Federal Bureau of Investigation","metadata":{}},"161":{"id":161,"name":"FSB","entity_type":"agency","description":"Federal Security Service of the Russian Federation (Federalnaya Sluzhba Bezopasnosti). Domestic intelligence and security agency, primary successor to the KGB's Second Chief Directorate (counterintelligence) and Fifth Directorate (dissidents). Established 1995.\n\nPutin served as FSB Director from July 1998 to August 1999, using the position as launchpad to the presidency. The Litvinenko Inquiry (2016, UK) documented FSB involvement in the 2006 polonium poisoning of Alexander Litvinenko, 'probably approved by Putin.' The 1999 Russian apartment bombings that precipitated the Second Chechen War and Putin's rise were attributed to Chechen terrorists by the government; Litvinenko and others alleged FSB involvement before being killed.\n\nInstitutional successor to the KGB in domestic operations. Maintains documented relationships with organized crime networks, particularly through the 'krysha' (protection) system documented by Dawisha and Belton.","aliases":"Federal Security Service, Federalnaya Sluzhba Bezopasnosti","metadata":{}},"34":{"id":34,"name":"Fat Tony Salerno","entity_type":"person","description":"Anthony 'Fat Tony' Salerno (1911-1992). Boss of the Genovese crime family, one of the most powerful organized crime figures in New York. Roy Cohn served as Salerno's attorney, connecting him to Donald Trump and the political establishment. Salerno and Paul Castellano (Gambino family) jointly controlled S&A Concrete, which held a monopoly on concrete deliveries for large construction projects in Manhattan. S&A Concrete provided concrete for Trump Tower's construction. Convicted in the 1986 Mafia Commission Trial and sentenced to 100 years. Died in federal prison in 1992.","aliases":"Anthony Salerno","metadata":{"photo_url":"photos/salerno.jpg","birth_date":"1911-08-15","death_date":"1992-07-27","nationality":"American","status":"deceased"}},"256":{"id":256,"name":"Felix Rodriguez","entity_type":"person","description":"Cuban-American CIA paramilitary operations officer. Born 1941 in Havana. Career spanning three decades of CIA operations across four continents.\n\nBay of Pigs (1961): entered Cuba clandestinely before the invasion for intelligence gathering. Bolivia (1967): CIA recruited Rodriguez to head the team hunting Che Guevara; interrogated Guevara, present at his execution. Vietnam (1971): flew over 300 helicopter sorties for Operation Phoenix, shot down 5 times.\n\nIran-Contra: ran the Contra supply depot at Ilopango Air Base in El Salvador from September 1985, using alias 'Maximo (Max) Gomez.' Established relationship with Salvadoran General Juan Rafael Bustillo. Met regularly with Oliver North. Met Reagan and Bush at the White House during height of operations.\n\nAutobiography: 'Shadow Warrior: The CIA Hero of a Hundred Unknown Battles' (1989).","aliases":"","metadata":{"photo_url":"photos/felix-rodriguez.jpg"}},"36":{"id":36,"name":"Felix Sater","entity_type":"person","description":"Felix Henry Sater (b. 1966). Russian-American businessman, convicted felon, and FBI informant. Managing director of Bayrock Group, which partnered with Trump on Trump SoHo and other projects. Born in Moscow, emigrated to the US as a child. Convicted in 1998 in connection with a $40 million stock fraud scheme tied to the Russian mafia, later became a cooperating witness for the FBI and CIA on national security matters. His business card at Bayrock read 'Senior Advisor to Donald Trump.' Despite his criminal record and organized crime ties, Sater maintained access to Trump Organization offices in Trump Tower. Documented in multiple lawsuits, congressional testimony, and investigative journalism as a key conduit between Trump business operations and Russian-connected money flows.","aliases":"Felix Satter","metadata":{"birth_date":"1966-03-02","nationality":"American","status":"alive","photo_url":"photos/felix_sater.jpg"}},"55":{"id":55,"name":"First American Bank","entity_type":"organization","description":"Largest DC bank holding company. Secretly owned by BCCI via CIA asset front-men. Fed never told despite CIA knowledge.","aliases":"First American Bankshares","metadata":{}},"15":{"id":15,"name":"Frank Terpil","entity_type":"person","description":"CIA officer, Wilson's partner. Described Wilson's congressional blackmail operation in detail to journalist Hougan.","aliases":"","metadata":{"photo_url":"photos/frank_terpil.jpg"}},"48":{"id":48,"name":"Frankie Carbo","entity_type":"person","description":"Paolo Giovanni 'Frankie' Carbo (1904-1976). Murder Incorporated triggerman turned boxing czar. Connected to the Lucchese crime family. Suspected in the killing of Bugsy Siegel (1947). With partner Blinky Palermo, controlled professional boxing in America for decades — fixing fights, managing champions, and extorting promoters. Their control of boxing represents the Philadelphia-New York organized crime partnership in action. Convicted of conspiracy and extortion in 1961. Died in federal prison.","aliases":"Paolo Giovanni Carbo, Mr. Gray","metadata":{"birth_date":"1904-08-10","death_date":"1976-11-09","nationality":"American","status":"deceased","photo_url":"photos/frankie_carbo.jpg"}},"244":{"id":244,"name":"French Epstein Investigation","entity_type":"event","description":"French criminal investigation into the Epstein trafficking network, opened by the Paris prosecutor on August 23, 2019, after attorney Yael Mellul wrote to prosecutors reporting an alleged international pedophile network involving Epstein. Charges investigated: rape and sexual assault of minors, criminal association.\n\nTimeline:\n- September 2019: French police raid 22 Avenue Foch and Brunel's offices.\n- December 16, 2020: Jean-Luc Brunel arrested at Charles de Gaulle Airport while attempting to board a flight to Dakar, Senegal. Held at La Santé Prison.\n- June 2021: Brunel formally charged with drugging and raping a 17-year-old, plus sexual assault, criminal conspiracy, and human trafficking of minors. Virginia Giuffre testifies in Paris court for a full day.\n- February 19, 2022: Brunel found dead in his cell at La Santé Prison. Reported suicide by hanging, age 76.\n\n2026 reopening: Following the US DOJ's release of 3.5 million Epstein files, French prosecutors reopened and expanded the investigation. February 16, 2026: police raid the Arab World Institute in probe of former Culture Minister Jack Lang. February 18, 2026: Paris Public Prosecutor Laure Beccuau opens two new probes (human trafficking and financial wrongdoing), refers three individual cases (diplomat Fabrice Aidan, model recruiter Daniel Siad, conductor Frederic Chaslin), and makes public appeal for victims in France to come forward.","aliases":"","metadata":{}},"78":{"id":78,"name":"Gambino Crime Family","entity_type":"organization","description":"One of the Five Families of New York. Led by Paul Castellano (until 1985 assassination), then John Gotti (1985-1992). Co-controlled S&A Concrete with the Genovese family, providing concrete for major Manhattan construction including Trump Tower. Roy Cohn represented both Castellano and Gotti. Extended influence into Philadelphia through John Stanfa.","aliases":"Gambino Family","metadata":{}},"258":{"id":258,"name":"Gary Webb","entity_type":"person","description":"Investigative journalist. Born August 31, 1955, Corona, California.\n\n'Dark Alliance': published August 18-20, 1996 in the San Jose Mercury News. Three-part series documenting that Nicaraguan Contra-linked drug dealers funneled cocaine profits to CIA-backed Contras, and this cocaine fueled the Los Angeles crack epidemic. Expanded into book (1998).\n\nMedia backlash: Washington Post, NYT, and LA Times attacked the series. Mercury News editor Jerry Ceppos published a partial retraction. Webb was reassigned and resigned. FOIA documents obtained by The Intercept (2014) revealed CIA actively tracked and facilitated the media destruction — internal CIA memo titled 'Managing a Nightmare.'\n\nPartial vindication: 1998 CIA Inspector General Frederick Hitz released two reports confirming CIA 'failed to fully investigate or act upon allegations that the anti-Sandinista forces it supported were engaged in drug trafficking.'\n\nDied December 10, 2004, Sacramento. Found with two gunshot wounds to the head. Sacramento County coroner ruled suicide.","aliases":"","metadata":{"photo_url":"photos/gary-webb.jpg"}},"79":{"id":79,"name":"Genovese Crime Family","entity_type":"organization","description":"One of the Five Families of New York. Led by Fat Tony Salerno (front boss, convicted 1986). Co-controlled S&A Concrete with the Gambino family. The most powerful family in the Mafia — managed to keep its true leadership structure hidden for decades. Roy Cohn represented boss Salerno.","aliases":"Genovese Family","metadata":{}},"212":{"id":212,"name":"George H.W. Bush","entity_type":"person","description":"41st President (1989-93), former CIA Director (1976-77). Bohemian Club member. Appointed William Barr as Attorney General (1991). Father of George W. Bush. Key node connecting intelligence community to the Grove's political elite.","aliases":"","metadata":{"photo_url":"photos/george_hw_bush.jpg"}},"110":{"id":110,"name":"George Mitchell","entity_type":"person","description":"George John Mitchell Jr. (born 1933). Democratic politician from Maine who served as U.S. Senator (1980-1995) and Senate Majority Leader (1989-1995). Appointed to the Senate in 1980 when Edmund Muskie resigned to become Secretary of State. As Majority Leader, he led passage of the Clean Air Act reauthorization and the Americans with Disabilities Act. After retiring from the Senate, he served as U.S. Special Envoy for Northern Ireland (1995-2000), helping broker the Good Friday Agreement, and as Special Envoy for Middle East Peace under Obama (2009-2011). Chairman of The Walt Disney Company (2004-2007).\n\nEPSTEIN ALLEGATIONS: In her 2016 deposition in the Maxwell civil case, Virginia Giuffre listed Mitchell among names of people Epstein and Maxwell allegedly directed her to have sexual contact with, stating: 'They instructed me to go to George Mitchell, Jean-Luc Brunel, Bill Richardson...' However, Giuffre did not provide specific details of encounters with Mitchell comparable to her descriptions of interactions with Prince Andrew or Richardson.\n\nMITCHELL'S DENIALS: Mitchell has categorically denied the allegations, stating in 2019 that he 'never met, spoke with, or had any contact of any kind with Ms. Giuffre or with any underage women.' In 2026, he said he 'declined or deflected' the 'small number of invitations' from Epstein. Despite this, the US-Ireland Alliance removed his name from the Mitchell Scholarship program, and the University of Maine considered renaming programs bearing his name.\n\nEVIDENCE ASSESSMENT: Mitchell appears in Epstein's contacts and is named in the Giuffre deposition, but the evidence of direct personal misconduct is less specific than for other named individuals. The Epstein files released in 2025-2026 revealed continued contact between Epstein and Mitchell after Epstein's conviction, which Mitchell has disputed.","aliases":"George John Mitchell Jr.","metadata":{"birth_date":"1933-08-20","nationality":"American","status":"alive","photo_url":"photos/george_mitchell.jpg"}},"218":{"id":218,"name":"George Shultz","entity_type":"person","description":"Secretary of State under Reagan (1982-89). Bohemian Club member. Former President of Bechtel Corporation — went from running America's largest private construction firm to running American foreign policy. Also served as Nixon's Treasury Secretary and Labor Secretary.","aliases":"","metadata":{"photo_url":"photos/george_shultz.jpg"}},"72":{"id":72,"name":"George Town Club","entity_type":"facility","description":"Washington DC private club. Korean intelligence front per WaPo. Robert Keith Gray was president. Blackmail venue.","aliases":"","metadata":{}},"213":{"id":213,"name":"George W. Bush","entity_type":"person","description":"43rd President (2001-09). Bohemian Club member. Drove Iraq invasion alongside fellow Club members Cheney, Rumsfeld, and Powell — Bechtel Corporation (led by fellow members) received hundreds of millions in reconstruction contracts.","aliases":"","metadata":{"photo_url":"photos/george_w_bush.jpg"}},"2":{"id":2,"name":"Ghislaine Maxwell","entity_type":"person","description":"Ghislaine Noelle Marion Maxwell (b. 1961). Convicted sex trafficker, socialite, and intelligence network connector. Daughter of Robert Maxwell, documented Mossad asset.\n\nFAMILY BACKGROUND: Father Robert Maxwell (born Jan Ludvik Hoch) was a British media mogul and documented Israeli intelligence asset who distributed backdoored PROMIS software to governments worldwide on behalf of Mossad. Robert Maxwell died under mysterious circumstances on November 5, 1991, found floating near his yacht, the Lady Ghislaine (named after his daughter). He received an Israeli state funeral attended by six serving and former heads of Israeli intelligence. His death occurred months after the BCCI shutdown and Danny Casolaro's death — three Octopus-connected events within five months.\n\nEPSTEIN OPERATION: Moved to New York after her father's death and became Jeffrey Epstein's primary companion and accomplice. Federal prosecutors established that Maxwell recruited, groomed, and trafficked underage girls for Epstein from at least 1994 to 2004. She used her social connections and aristocratic credibility to normalize access to victims and provide cover for the operation.\n\nTERRAMAR PROJECT: Founded the TerraMar Project, an ocean conservation nonprofit, in 2012. The organization closed the day after Epstein's July 2019 arrest, raising questions about its true purpose. TerraMar had applied for diplomatic status at the United Nations.\n\nARREST AND CONVICTION: After Epstein's death, Maxwell became the FBI's most wanted target in the case. Arrested July 2, 2020 at a New Hampshire property. Convicted in December 2021 on five of six counts including sex trafficking of a minor. Sentenced to 20 years in federal prison in June 2022. Currently incarcerated.\n\nINTELLIGENCE NEXUS: Maxwell served as the bridge between her father's Mossad intelligence network and Epstein's operation. Through Robert Maxwell, the family had deep connections to Israeli intelligence leadership. Multiple researchers have documented this as a continuation of the Maxwell family's intelligence role.","aliases":"","metadata":{"photo_url":"photos/maxwell.jpg","birth_date":"1961-12-25","nationality":"British-American","status":"incarcerated"}},"71":{"id":71,"name":"Glencore","entity_type":"organization","description":"Commodities giant founded by Marc Rich. Partially owned by Nathaniel Rothschild.","aliases":"","metadata":{}},"123":{"id":123,"name":"Glenn Dubin","entity_type":"person","description":"Glenn Russell Dubin (b. 1957). Hedge fund billionaire whose family maintained an intimate relationship with Jeffrey Epstein before, during, and after his conviction — including allowing Epstein to serve as godfather to their children.\n\nHEDGE FUND CAREER: Born to a middle-class Jewish family in Washington Heights, Manhattan. Father was a taxi driver. After Stony Brook University, began at E.F. Hutton as a retail stockbroker. Co-founded Dubin & Swieca Capital Management in 1984 and Highbridge Capital Management in 1992 with childhood friend Henry Swieca. JPMorgan purchased a majority stake in Highbridge for $1.3 billion in 2004. Under Dubin, Highbridge grew to over $35 billion AUM. Founded Engineers Gate (quantitative trading) in 2013.\n\nEPSTEIN RELATIONSHIP — THE EVA ANDERSSON CONNECTION: Wife Eva Andersson-Dubin dated Jeffrey Epstein from 1981 to 1990. Epstein financially supported Andersson through medical school in Sweden and California. Glenn and Eva married in 1994. Despite this history — and despite Epstein's 2008 conviction — Jeffrey Epstein was named godfather to the Dubin children.\n\nPOST-CONVICTION CONTACT: After Epstein's release from jail in 2009, Andersson-Dubin wrote to Epstein's probation officer stating she was '100% comfortable with Jeffrey Epstein around her children' — all of whom were under 18 at the time. Released DOJ documents (Feb 2026) show Andersson-Dubin emailed Epstein inviting him to visit when her daughter would 'have 5 friends over.' The family continued socializing with Epstein after his conviction.\n\nGIUFFRE ALLEGATIONS: In her 2016 deposition, Virginia Roberts Giuffre named Glenn Dubin among businessmen she was directed to have sex with by Epstein and Maxwell. She specifically alleged being trafficked to Dubin's home while his pregnant wife was 'asleep in the next room.' Dubin denied the allegations through a spokesperson. The US Virgin Islands subpoenaed Dubin for Epstein-related documents in 2020.","aliases":"Glenn Russell Dubin","metadata":{"birth_date":"1957-04-13","nationality":"American","status":"alive","photo_url":"photos/glenn_dubin.jpg"}},"235":{"id":235,"name":"Gérald Marie","entity_type":"person","description":"Head of Elite Model Management's European operations in Paris. One of the most powerful figures in the fashion industry during the 1980s and 1990s. Married to supermodel Linda Evangelista (1987-1993).\n\nAccused of rape and sexual assault by at least 15 women who cooperated with French investigators, including supermodel Carré Otis (alleges rape 'countless' times starting around 1986 when she was 17), Karen Mulder (raped multiple times, spent five months in psychiatric care), and BBC journalist Lisa Brinkworth (assaulted while working undercover on a documentary about the modeling industry in 1998).\n\nBBC MacIntyre Undercover (1999) caught Marie on hidden camera offering a 15-year-old model £300 for sex and bragging about Elite Model Look competitors he planned to sleep with. Marie resigned from Elite following the broadcast.\n\nFrench prosecutors opened an investigation in 2020. The criminal investigation was closed in February 2023 on statute-of-limitations grounds — the alleged offenses (1980s-1990s) occurred too long ago under French law.","aliases":"Gerald Marie, Gerald Marie de Castellac","metadata":{}},"224":{"id":224,"name":"Harlan Crow","entity_type":"person","description":"Dallas real estate billionaire. Bohemian Club member (on 2023 list). Took Supreme Court Justice Clarence Thomas on undisclosed luxury trips including to Bohemian Grove — exposed by ProPublica in 2023. Connected to Club for Growth. Nephew of Paul Pelosi works for Crow.","aliases":"","metadata":{}},"134":{"id":134,"name":"Harvey Weinstein","entity_type":"person","description":"Harvey Weinstein (b. 1952). Co-founder of Miramax Films and The Weinstein Company. Convicted sex offender whose decades-long pattern of sexual assault, coercion, and surveillance-based intimidation parallels the Epstein operation's blackmail methodology.\n\nCAREER: Co-founded Miramax Films with brother Bob Weinstein in 1979, named after their parents Miriam and Max. Built it into a dominant force in independent film, producing Pulp Fiction, Shakespeare in Love, and The English Patient. Left Miramax in 2005 to found The Weinstein Company.\n\nSEXUAL PREDATION: Over 80 women accused Weinstein of sexual misconduct ranging from harassment to rape, spanning decades of his career. He exploited his position as Hollywood's most powerful producer — the promise of career advancement and the threat of career destruction were his primary coercion tools. Convicted in February 2020 in Manhattan on criminal sexual assault and third-degree rape (sentenced to 23 years). Convicted again in December 2022 in Los Angeles on rape and forced oral copulation (sentenced to 16 years). The New York conviction was overturned in April 2024 on procedural grounds; a 2025 retrial resulted in a partial guilty verdict.\n\nBLACK CUBE / INTELLIGENCE METHODS: Hired Black Cube — a private intelligence firm staffed by former Mossad and Aman (Israeli military intelligence) operatives — to surveil, infiltrate, and discredit his accusers and journalists investigating him. Black Cube operatives used fabricated identities to approach accusers and reporters at The New Yorker, The New York Times, and New York magazine, compiling psychological profiles focusing on personal and sexual histories. Former Israeli PM Ehud Barak personally referred Weinstein to Black Cube — the same Barak who co-founded Carbyne with Epstein investment and received $2M from the Wexner Foundation.\n\nEPSTEIN OVERLAP: Weinstein and Epstein socialized in the same New York circles. They shared a regular table at a Hamptons restaurant. Both were part of a group of investors who attempted to buy New York Magazine in 2003. Ghislaine Maxwell attended Weinstein film premieres and parties. Epstein introduced women to Weinstein for auditions. In October 2017, Epstein emailed attorney Brad Karp asking 'how bad does the Harvey Weinstein story get?' — monitoring the fallout that would eventually reach his own network. The Weinstein-Epstein connection demonstrates how entertainment industry power structures and intelligence-linked blackmail operations operated in parallel within the same social ecosystem.","aliases":"","metadata":{"birth_year":1952,"nationality":"American","status":"incarcerated","photo_url":"photos/harvey_weinstein.jpg"}},"111":{"id":111,"name":"Henry Kissinger","entity_type":"person","description":"Heinz Alfred 'Henry' Kissinger (1923-2023). German-born American diplomat who served as National Security Advisor (1969-1975) and Secretary of State (1973-1977) under Presidents Nixon and Ford — the only person to hold both positions simultaneously. Nobel Peace Prize laureate (1973) for Vietnam negotiations. Emigrated from Nazi Germany in 1938 as a Jewish refugee.\n\nINTELLIGENCE & COVERT OPERATIONS: As NSA, Kissinger chaired the '40 Committee' which oversaw CIA covert operations worldwide. Declassified documents show he supervised 'Track II' — the CIA operation to foment a coup in Chile that led to the assassination of General Rene Schneider and the overthrow of Salvador Allende (1973). He authorized Indonesia's invasion of East Timor (1975, ~200,000 deaths). Directed secret bombing of Cambodia. Supported Argentina's Dirty War and Pakistan during the Bangladesh genocide.\n\nKISSINGER ASSOCIATES: Founded his geopolitical consulting firm in 1982. Members included Brent Scowcroft, L. Paul Bremer, Lawrence Eagleburger, Timothy Geithner, and Bill Richardson (Senior Managing Director). The firm connected corporate clients to government power globally. Joshua Cooper Ramo, a Kissinger Associates executive, appears in Epstein's private calendar for a scheduled meeting.\n\nEPSTEIN CONNECTION: Kissinger appears in Epstein's black book (page 31, with 2 phone numbers and 2 addresses). Kissinger Associates executives appear in Epstein's private calendar. Kissinger sat on the board of Hollinger International alongside Les Wexner. Virginia Giuffre's forthcoming autobiography reportedly implicates Kissinger, with an 'intense legal fight' to keep his name out. However, there is no public evidence of Kissinger flying on Epstein's planes or visiting his properties. The connection appears institutional rather than personal — through overlapping board memberships, elite social networks, and the consulting firm. Died November 29, 2023, at age 100.","aliases":"Heinz Alfred Kissinger","metadata":{"birth_date":"1923-05-27","death_date":"2023-11-29","nationality":"American","status":"deceased","photo_url":"photos/henry_kissinger.jpg"}},"231":{"id":231,"name":"Heritage Foundation","entity_type":"organization","description":"Conservative think tank co-founded in 1973 by Joseph Coors Sr and Edwin Fuelner. Produced 'Mandate for Leadership' policy books for Reagan (1981) and Trump (Project 2025, 2023). Immensely powerful during Reagan administration — policies still affecting Americans today. Funded by Koch network. Heritage board was ~25% Bohemian Club members when Project 2025 was written.","aliases":"","metadata":{}},"61":{"id":61,"name":"Hill & Knowlton","entity_type":"organization","description":"PR firm led by Robert Keith Gray. Used as cover for CIA influence operations.","aliases":"H&K","metadata":{}},"31":{"id":31,"name":"Hillary Clinton","entity_type":"person","description":"Rose Law Firm partner. Firm represented both Systematics and assisted BCCI's US entry.","aliases":"","metadata":{"photo_url":"photos/hillary_clinton.jpg","birth_date":"1947-10-26","nationality":"American","status":"alive"}},"116":{"id":116,"name":"Hollinger International","entity_type":"organization","description":"Media holding company controlled by Conrad Black that owned the Daily Telegraph, Chicago Sun-Times, and the Jerusalem Post. Its board of directors included Henry Kissinger and Les Wexner. The International Advisory Board was chaired by Margaret Thatcher and included Richard Perle and William F. Buckley Jr. The overlap of Kissinger and Wexner on this board is significant because it places a key Epstein network figure (Wexner) in direct corporate governance alongside a central establishment power broker (Kissinger). Conrad Black was later convicted of fraud and obstruction of justice (2007). The company represents one node in the overlapping board memberships that characterized elite network connections in this era.","aliases":"Hollinger Inc.","metadata":{"status":"defunct"}},"60":{"id":60,"name":"In-Q-Tel","entity_type":"organization","description":"CIA venture capital arm. Founded 1999. Funded companies that became core surveillance infrastructure.","aliases":"IQT","metadata":{}},"96":{"id":96,"name":"Iran-Contra","entity_type":"program","description":"Covert arms-for-hostages and drug trafficking operation. Casey architect. BCCI banking. Mena Airport. SAT flights.","aliases":"","metadata":{}},"16":{"id":16,"name":"J. Edgar Hoover","entity_type":"person","description":"FBI Director 1924-1972. Compromised by Lansky photographs. Refused to investigate organized crime for decades.","aliases":"","metadata":{"photo_url":"photos/hoover.jpg","birth_date":"1895-01-01","death_date":"1972-05-02","nationality":"American","status":"deceased"}},"56":{"id":56,"name":"JPMorgan Chase","entity_type":"organization","description":"Processed 4,725 suspicious Epstein-related wires totaling $1.1B. Settled $290M in 2023.","aliases":"JPMorgan","metadata":{}},"239":{"id":239,"name":"Jack Lang","entity_type":"person","description":"French politician. Served as Minister of Culture under President Mitterrand (1981-1986, 1988-1993) and as Minister of Education (2000-2002). President of the Arab World Institute in Paris.\n\nUnder investigation as of February 2026 in connection with the Epstein files. French police raided the Arab World Institute on February 16, 2026. Lang is investigated for 'laundering of the proceeds of tax evasion' linked to a company set up jointly by Epstein and Lang's daughter in the U.S. Virgin Islands. Lang resigned as institute president following the raid.\n\nInvestigation triggered by the US DOJ's release of 3.5 million Epstein files, which prompted French prosecutors to reopen and expand multiple probes.","aliases":"","metadata":{"photo_url":"photos/jack-lang.jpg"}},"23":{"id":23,"name":"Jackson Stephens","entity_type":"person","description":"Arkansas oligarch. Bankrolled Clinton's rise. Worthen Bank provided $3.5M campaign credit. Rose Law Firm client.","aliases":"","metadata":{"photo_url":"photos/jackson_stephens.jpg"}},"180":{"id":180,"name":"Jamal Khashoggi","entity_type":"person","description":"Jamal Ahmad Khashoggi (1958-2018). Saudi journalist, author, and Washington Post columnist. Assassinated on October 2, 2018 inside the Saudi consulate in Istanbul, Turkey.\n\nFAMILY CONNECTION: Jamal Khashoggi was the nephew of Adnan Khashoggi, the Saudi billionaire arms dealer who served as a middleman in the Iran-Contra affair and banked at BCCI. This family connection placed Jamal within the orbit of Saudi Arabia's most powerful arms-dealing and intelligence-connected dynasty. His grandfather, Muhammad Khashoggi, was the personal physician to King Abdulaziz (Ibn Saud).\n\nINTELLIGENCE CONNECTIONS: Jamal Khashoggi had long-standing relationships with Saudi intelligence. He served as a media advisor to Prince Turki al-Faisal when Turki was GID chief, and traveled with Turki to Afghanistan during the anti-Soviet jihad. He interviewed Osama bin Laden multiple times during this period. After a complex career navigating Saudi power politics, he went into self-imposed exile in the US (2017) and became a prominent critic of MBS's consolidation of power.\n\nASSASSINATION: Killed by a 15-member Saudi team including forensic pathologist, intelligence officers, and members of MBS's personal security detail. Body was dismembered. Turkey released audio recordings. ODNI assessment concluded MBS approved the operation. No senior Saudi officials were held accountable internationally.","aliases":"Jamal Ahmad Khashoggi","metadata":{"birth_date":"1958-10-13","death_date":"2018-10-02","nationality":"Saudi","status":"deceased","photo_url":"photos/jamal_khashoggi.jpg"}},"17":{"id":17,"name":"James Angleton","entity_type":"person","description":"CIA counterintelligence chief. Held Hoover compromise material. Managed CIA-Mossad relationship.","aliases":"","metadata":{"photo_url":"photos/angleton.jpg","birth_date":"1917-12-09","death_date":"1987-05-12","nationality":"American","status":"deceased"}},"135":{"id":135,"name":"Jean-Luc Brunel","entity_type":"person","description":"Jean-Luc Brunel (1946-2022). French model scout, agency founder, and accused sex trafficker. Epstein's primary modeling industry pipeline who funneled young women into the trafficking network through the legitimate facade of fashion recruitment.\n\nMODELING CAREER: Born in Neuilly-sur-Seine, France. Began working as a scout for Karin Models in Paris in the late 1970s, eventually running the agency. Launched careers of Milla Jovovich, Christy Turlington, Sharon Stone, and Monica Bellucci. His industry credentials provided the perfect cover for identifying and accessing vulnerable young women.\n\nMC2 MODEL MANAGEMENT: In 2005, Brunel transformed the Karin Models US division into MC2 Model Management, with offices in New York and Miami. Epstein wired up to $1 million to fund the launch. The name 'MC2' was an inside reference — E=MC2, with 'E' standing for Epstein. The agency operated a work visa pipeline, securing employment visas for young foreign women from Eastern Europe and Latin America, creating a paper trail of legitimate modeling work while the agency functioned as an Epstein feeder.\n\nTRAFFICKING ALLEGATIONS: Virginia Giuffre alleged in a 2015 court affidavit that Epstein bragged about having 'slept with over 1,000 of Brunel's girls.' Giuffre described a system where young models recruited through legitimate-seeming agencies were funneled to Epstein. Brunel was accused of trafficking girls as young as 12.\n\nARREST AND DEATH: On December 16, 2020, Brunel was intercepted by police at Charles de Gaulle airport attempting to board a flight to Dakar, Senegal. Charged with rape of a minor, sexual assault, criminal conspiracy, and human trafficking. On February 19, 2022, Brunel was found hanged with bedsheets in his cell at La Sante Prison in Paris at approximately 1:30 AM. He was not on suicide watch. The pattern echoes Epstein's death — a key witness with knowledge of the network's clients found dead in custody before trial. In 2016, Brunel had reportedly been in discussions with federal prosecutors about potentially cooperating, requesting $3 million, before backing off the deal.","aliases":"","metadata":{"birth_year":1946,"death_year":2022,"nationality":"French","status":"deceased","photo_url":"photos/jean_luc_brunel.jpg"}},"144":{"id":144,"name":"Jean-Luc Brunel Death (2022)","entity_type":"event","description":"On February 19, 2022, Jean-Luc Brunel was found hanged with bedsheets in his cell at La Sante Prison in Paris at approximately 1:30 AM. He was being held on charges of rape of a minor, sexual assault, criminal conspiracy, and human trafficking — all involving minors. He was not on suicide watch. Prison guards conducted five overnight checks, and corridor video confirmed no checks were missed. An investigation into the cause of death was opened, 'as is systematically done in these cases.' Brunel had been arrested on December 16, 2020 at Charles de Gaulle airport while attempting to flee to Senegal. The death of a second key Epstein network figure in custody — under strikingly similar circumstances to Epstein's own death (hanging, pre-trial, key witness) — raised questions about whether individuals with knowledge of the network's clients were being silenced. In 2016, Brunel had reportedly been in discussions about cooperating with US prosecutors.","aliases":"Brunel Death","metadata":{}},"1":{"id":1,"name":"Jeffrey Epstein","entity_type":"person","description":"Jeffrey Edward Epstein (1953-2019). Financier, convicted sex offender, and intelligence asset whose network connected Wall Street, government, and intelligence services across multiple countries.\n\nEARLY CAREER: Hired in 1974 to teach calculus and physics at the Dalton School in Manhattan by headmaster Donald Barr (OSS veteran, father of future AG William Barr) despite lacking a college degree. Joined Bear Stearns in 1976, recruited by CEO Ace Greenberg, rising to limited partner before departing in 1981 under unclear circumstances.\n\nFINANCIAL ENIGMA: Established J. Epstein & Co. with Les Wexner as his only publicly confirmed client. Granted unprecedented power of attorney over Wexner's finances and a $46M Manhattan mansion (9 East 71st St, transferred for $0 in 1998). His claimed billionaire status was never independently verified — no former clients besides Wexner have been publicly identified.\n\nINTELLIGENCE CONNECTIONS: FBI Confidential Human Source memo (Oct 2020, FOIA) identifies Epstein as a 'co-opted Mossad agent.' Former Israeli PM Ehud Barak visited Epstein residences (photographed entering NYC building), received $2M from Wexner Foundation, and co-founded Carbyne (Israeli emergency tech, Epstein investor) with mass surveillance applications. Robert Maxwell (Ghislaine's father, documented Mossad asset) distributed backdoored PROMIS software — Epstein inherited this intelligence network connection through Ghislaine.\n\n2007 NON-PROSECUTION AGREEMENT: Palm Beach police investigation led to federal charges, but US Attorney Alexander Acosta granted an unprecedented NPA shielding unnamed co-conspirators. Victims were not notified as required by law. Acosta later told the Trump transition team he was told to back off because Epstein 'belonged to intelligence' (Daily Beast, 2019).\n\nFINANCIAL NETWORK: JPMorgan processed 4,725 suspicious Epstein-linked wires totaling $1.1B, filing SARs years late ($290M settlement, 2023). Deutsche Bank maintained Butterfly Trust accounts after JPMorgan dropped him ($75M NYDFS settlement, 2020). Leon Black paid $158M in Apollo advisory fees. Epstein attended Mega Group meetings (Wexner/Bronfman billionaire donor group).\n\n2019 ARREST AND DEATH: Re-arrested by SDNY July 6, 2019 on federal sex trafficking charges. Found dead in MCC cell August 10, 2019. Ruled suicide by hanging. Both surveillance cameras outside his cell simultaneously malfunctioned. Both assigned guards were sleeping and later falsified records. Dr. Michael Baden noted hyoid bone fracture pattern more consistent with homicidal strangulation than hanging. AG William Barr (whose father hired Epstein at Dalton) oversaw the investigation.\n\nPROPERTY EMPIRE: Residences in Manhattan, Palm Beach, Paris, New Mexico (Zorro Ranch), and US Virgin Islands (Little Saint James, Great Saint James). Flight logs document hundreds of prominent visitors.","aliases":"","metadata":{"photo_url":"photos/epstein.jpg","birth_date":"1953-01-20","death_date":"2019-08-10","nationality":"American","status":"deceased"}},"124":{"id":124,"name":"Jes Staley","entity_type":"person","description":"James Edward 'Jes' Staley (b. 1956). Senior JPMorgan executive whose deep personal relationship with Jeffrey Epstein was documented in over 1,200 emails, including apparent coded references to young women using Disney princess names.\n\nJPMORGAN CAREER: Joined Morgan Guaranty Trust in 1979 after graduating from Bowdoin College. Spent 34 years at JPMorgan, rising to head of the Private Banking division in 1999 — the unit responsible for managing Epstein's accounts. Under Staley's leadership, the private bank tripled its profitability.\n\nEPSTEIN RELATIONSHIP: Met Epstein through the private banking relationship in the early 2000s. Former JPMorgan CEO reportedly told Staley he should meet Epstein as one of the 'most connected' people in finance. The relationship deepened into a profound personal friendship documented in 1,200+ emails exchanged over more than a decade — continuing after Epstein's 2008 conviction.\n\nTHE 'SNOW WHITE' EMAILS: In July 2010, Staley emailed Epstein saying 'Say hi to Snow White.' Epstein responded: 'What character would you like next?' When Staley said 'Beauty and the Beast,' Epstein replied: 'Well one side is available.' Virgin Islands prosecutors alleged these Disney princess references were code words for young women. In a 2008 email, Staley referenced his yacht being anchored 'in front of St Jeff' — the nickname they used for Epstein's island, Little Saint James.\n\nBARCLAYS CEO: Left JPMorgan in 2013, became CEO of Barclays in December 2015. Forced to resign from Barclays in November 2021 after the FCA investigated his characterization of the Epstein relationship to regulators.\n\nREGULATORY BAN: The UK Financial Conduct Authority banned Staley for life from working in financial services, finding he had misled regulators about the nature and extent of his relationship with Epstein. In March 2025, during testimony in related litigation, Staley admitted to having slept with an Epstein assistant. The Upper Tribunal upheld the FCA ban.","aliases":"James Edward Staley","metadata":{"birth_date":"1956-12-27","nationality":"American","status":"alive","photo_url":"photos/jes_staley.jpg"}},"192":{"id":192,"name":"Jimmy Savile","entity_type":"person","description":"Sir James Wilson Vincent Savile OBE KCSG (1926-2011). English DJ, television presenter, and charity fundraiser. Host of BBC's 'Jim'll Fix It' (1975-1994) and 'Top of the Pops.' Knighted in 1990. Awarded Papal knighthood (KCSG) in 1990.\n\nSEXUAL ABUSE: After his death in 2011, hundreds of allegations of sexual abuse emerged. The Dame Janet Smith Review (2016) documented that Savile sexually abused at least 72 victims at BBC premises alone, spanning from 1959 to 2006. NHS investigations found he abused patients at multiple hospitals including Broadmoor, Stoke Mandeville, and Leeds General Infirmary. Total victim count across all institutions: over 450.\n\nESTABLISHMENT PROTECTION: Savile's decades of abuse were enabled by institutional protection. He had personal access to the Royal Family (particularly close to Prince Charles, visited Highgrove and Kensington Palace). Police received reports as early as 1964 but took no action. MI5 monitored him but did not intervene. The BBC received complaints spanning decades and suppressed an investigation by Newsnight in 2011.\n\nPATTERN SIGNIFICANCE: The Savile case is the documented proof-of-concept for how UK establishment institutions protect high-profile abusers — the same institutional pattern that shielded Robert Maxwell and later the Epstein network. The mechanisms are identical: intelligence services aware but inactive, police investigations dropped, media suppressed, institutional loyalty to the establishment over victims.","aliases":"Sir Jimmy Savile, Savile","metadata":{"photo_url":"photos/jimmy_savile.jpg"}},"43":{"id":43,"name":"Joey Merlino","entity_type":"person","description":"Joseph Salvatore Merlino (b. 1962). 'Skinny Joey.' Boss of the Philadelphia crime family from 1999, succeeding the Stanfa era after winning the bloody Stanfa-Merlino war. Son of Salvatore 'Chuckie' Merlino, underboss under Scarfo. Led the young faction against Stanfa with Michael Ciancaglini. Survived being shot in 1993. Convicted of racketeering in 2001, sentenced to 14 years. Acquitted of murder charges in 2018 after a second trial. Considered the last traditional boss of the Philadelphia family.","aliases":"Skinny Joey","metadata":{"photo_url":"photos/merlino.jpg","birth_date":"1962-03-16","nationality":"American","status":"alive"}},"236":{"id":236,"name":"John Casablancas","entity_type":"person","description":"Founder of Elite Model Management (1972), credited with 'inventing the supermodel.' Born December 12, 1942 in New York to a Spanish family, raised in Europe. Died July 20, 2013 in Rio de Janeiro from cancer.\n\nDocumented relationship with Stephanie Seymour, who was a finalist at the inaugural Elite Model Look of the Year contest in 1983 at age 15. Casablancas was in his early 40s when the relationship began — she was under 17 and he was her agent.\n\nBusiness relationship with Donald Trump: In 1991, Trump became a headline sponsor of Elite's Look of the Year contest, hosted it at the Plaza Hotel (which Trump owned), accommodated the young models, and served as one of 10 judges. Contestants included aspiring models as young as 14. Trump hosted the competition again in 1992. Photographic evidence of Casablancas and Trump together at these events is held by Getty Images.\n\nOperated in the same Paris modeling scene as Jean-Luc Brunel and Gérald Marie.","aliases":"","metadata":{}},"39":{"id":39,"name":"John Gotti","entity_type":"person","description":"John Joseph Gotti Jr. (1940-2002). 'The Teflon Don' and 'The Dapper Don.' Boss of the Gambino crime family from 1985 until his conviction in 1992.\n\nRISE TO POWER: On December 16, 1985, Gotti orchestrated the assassination of Gambino boss Paul Castellano outside Sparks Steak House in midtown Manhattan — one of the most brazen mob hits in history. Castellano and underboss Thomas Bilotti were shot by gunmen in trench coats while Gotti watched from a car across the street. Gotti became boss without Commission approval, violating the Mafia's fundamental governance structure.\n\nTHE TEFLON DON: Acquitted three times on federal racketeering charges between 1986 and 1990, earning the nickname 'Teflon Don' because charges seemed to slide off. His acquittals were later attributed to jury tampering and witness intimidation. He cultivated a celebrity persona — Armani suits, media appearances, lavish Fourth of July block parties in Ozone Park, Queens.\n\nROY COHN CONNECTION: Roy Cohn represented Gotti, adding him to a client list that already included Fat Tony Salerno (Genovese boss) and Castellano himself (the man Gotti would later murder). Through Cohn, the same attorney connected the bosses of two rival families AND Donald Trump.\n\nTRUMP CASINO CONNECTION: Robert LiButti, a Gambino associate caught on FBI wiretap calling Gotti 'my boss,' lost $12 million gambling at Trump casinos. Trump Plaza was fined $450,000 for funneling $1.6M in luxury cars to LiButti and $200,000 for removing Black and female dealers at LiButti's demand.\n\nPHILADELPHIA CONNECTION: John Stanfa, the Gambino-connected boss of the Philadelphia crime family, had brothers who were made Gambino members under Gotti's regime. When Stanfa was installed in Philadelphia, it was with Gambino backing.\n\nDOWNFALL: Underboss Sammy 'The Bull' Gravano turned government witness in 1991, providing devastating testimony. Gotti was convicted June 23, 1992 on 13 counts including five murders and sentenced to life without parole. He died of throat cancer in USP Marion on June 10, 2002. His conviction marked the symbolic end of the Italian-American Mafia's golden age.","aliases":"The Teflon Don, The Dapper Don","metadata":{"photo_url":"photos/gotti.jpg","birth_date":"1940-10-27","death_date":"2002-06-10","nationality":"American","status":"deceased"}},"166":{"id":166,"name":"John Huang","entity_type":"person","description":"John Huang (born c. 1945). Taiwanese-American political fundraiser and former U.S. Commerce Department official. Key figure in the 1996 campaign finance controversy.\n\nLIPPO GROUP: Before government service, Huang worked for the Lippo Group, a multi-billion-dollar Indonesian conglomerate controlled by the Riady family (Mochtar and James Riady). The 1998 Senate Governmental Affairs Committee report stated that both Riadys 'had a long-term relationship with a Chinese intelligence agency,' based on classified CIA and FBI intelligence.\n\nCOMMERCE DEPARTMENT: Appointed Deputy Assistant Secretary of Commerce for International Economic Affairs by President Clinton in December 1993, responsible for Asia-U.S. trade. This position gave Huang access to classified intelligence on China. While at Commerce, Huang met nine times with Chinese embassy officials (documented in committee records).\n\nDNC FUNDRAISING: After leaving Commerce, joined DNC as vice chairman of finance. Raised $3.4 million for the Democratic Party; more than half was returned because of foreign sourcing. Solicited approximately $1.6 million later returned by DNC as illegal foreign contributions.\n\nLEGAL OUTCOME: Pled guilty to a single felony count of campaign finance violation in 1999.","aliases":"Huang","metadata":{"photo_url":"photos/john_huang.jpg"}},"29":{"id":29,"name":"John Poindexter","entity_type":"person","description":"National Security Advisor under Reagan. Later directed DARPA's Total Information Awareness program.","aliases":"","metadata":{"photo_url":"photos/poindexter.jpg","nationality":"American","status":"alive"}},"42":{"id":42,"name":"John Stanfa","entity_type":"person","description":"Giovanni Stanfa (b. 1940). Boss of the Philadelphia crime family from 1991 to 1994, installed with Gambino family backing after the Scarfo era. Born in Caccamo, Sicily. Was the driver for Angelo Bruno on the night of his 1980 assassination — a bullet grazed Stanfa's shoulder, but he was later cleared. Led a bloody war against the young faction led by Joey Merlino and Michael Ciancaglini. Convicted of racketeering and three murders in 1995 based largely on testimony from his own enforcer, John-John Veasey. Sentenced to five consecutive life terms.","aliases":"Giovanni Stanfa","metadata":{"birth_date":"1940-09-07","nationality":"American-Italian","status":"incarcerated","photo_url":"photos/john_stanfa.jpg"}},"44":{"id":44,"name":"John-John Veasey","entity_type":"person","description":"John 'John-John' Veasey (b. 1967). Philadelphia mob enforcer turned FBI informant whose testimony brought down boss John Stanfa.\n\nBACKGROUND: Born in South Philadelphia to Walter Veasey (violent alcoholic, found dead in a hotel 1970) and Sophia Maria Cuticchia (Sicilian native, died of heart attack when John was 16). Youngest of five children. Grew up in the heart of Philadelphia crime family territory during the Bruno and Scarfo eras.\n\nMOB CAREER: Became an enforcer and triggerman for boss John Stanfa during the Stanfa-Merlino war (1992-1994). Admitted to participating in multiple murders including Michael 'Mikey Chang' Ciancaglini and Frank Baldino Sr.\n\nASSASSINATION ATTEMPT: On January 14, 1994, Stanfa associates Frank Martines and Vincent 'Al Pajamas' Pagano attempted to kill Veasey in an apartment above a meat store. He was shot four times — three times in the head with a small-caliber pistol, once in the chest — and stabbed seven times. Doctors said years of being hit with metal pipes and baseball bats had built up protective calcium deposits on his skull, which deflected the bullets. Despite his injuries, Veasey wrestled a knife from an attacker, stabbed him in the face, and escaped.\n\nFBI INFORMANT: His brother Billy recommended he cooperate with the FBI. Veasey's testimony was devastating — the judge was amused, the jury loved him. He helped convict Stanfa and seven associates, earning Stanfa five consecutive life sentences. Hours before Veasey took the stand, his brother Billy was shot and killed on the 1700 block of Oregon Avenue in South Philadelphia.\n\nAFTERMATH: Entered witness protection. His story was featured on CBS 60 Minutes and Netflix's Mob War (2025). Lives under an assumed name.","aliases":"John Veasey","metadata":{"birth_date":"1967-01-01","nationality":"American","status":"alive","photo_url":"photos/john_veasey.jpg"}},"165":{"id":165,"name":"Johnny Chung","entity_type":"person","description":"Zhongwen 'Johnny' Chung (born c. 1955). Taiwanese-American businessman from Torrance, California, who became a central figure in the 1996 campaign finance controversy ('Chinagate'). Owner of a fax broadcasting business before entering Democratic fundraising.\n\nFUNDRAISING ACTIVITIES: Between 1994 and 1996, Chung donated $366,000 to the Democratic National Committee. Made 49 separate visits to the White House between February 1994 and February 1996. Testified before the House Government Reform Committee (Burton Committee) in May 1999.\n\nPLA INTELLIGENCE CONNECTION: Chung testified under oath that he was introduced to General Ji Shengde, then head of PLA military intelligence (Second Department of the General Staff), by Liu Chaoying, a PLA Lieutenant Colonel and executive at China Aerospace International Holdings. Chung testified that Ji told him: 'I will give you 300,000 U.S. dollars. You can give it to the president and the Democrat Party.' Chung told federal investigators that $35,000 of his DNC donations came from Liu Chaoying and, in turn, China's military intelligence.\n\nLEGAL OUTCOME: Cooperated with federal investigators. Pled guilty to bank fraud, tax evasion, and two misdemeanor counts of conspiring to violate election law. Sentenced to five years' probation and 3,000 hours of community service.","aliases":"Zhongwen Chung","metadata":{"photo_url":"photos/johnny_chung.jpg"}},"204":{"id":204,"name":"Jonathan Pollard","entity_type":"person","description":"Jonathan Jay Pollard (born 1954, Galveston, Texas). Former U.S. Navy civilian intelligence analyst convicted of spying for Israel in 1987. Served 30 years in federal prison — the longest sentence ever imposed for spying for a U.S. ally.\n\nTHE OPERATION: Pollard was recruited by LAKAM (Bureau of Scientific Relations), Israel's scientific intelligence collection agency, in 1984. His handler was Colonel Aviem Sella of the Israeli Air Force, and the operation was overseen by Rafi Eitan, then head of LAKAM. Pollard had SCI (Sensitive Compartmented Information) clearance and passed an estimated 800,000+ pages of classified documents to Israel over 18 months.\n\nDAMAGE ASSESSMENT: Secretary of Defense Caspar Weinberger's classified damage assessment (partially declassified) described the Pollard case as causing 'severe and irreparable' damage to U.S. national security. The compromised material included: the NSA's RASIN (Radio Signal Notation) manual describing U.S. signals intelligence capabilities, detailed technical intelligence on Soviet weapons systems, and information about U.S. intelligence-gathering methods that, if shared with the Soviet Union (which investigators suspected occurred via Aldrich Ames or other channels), would have compromised sources and methods globally.\n\nAFTERMATH: Israel initially denied involvement, then admitted it in 1998 and granted Pollard citizenship. Released in 2015 after 30 years. Emigrated to Israel in December 2020, greeted by Prime Minister Netanyahu on the tarmac. The case caused a lasting rupture in U.S.-Israeli intelligence relations and led to the disbanding of LAKAM.","aliases":"Pollard, Jay Pollard","metadata":{"birth_year":1954,"nationality":"American-Israeli","status":"alive","photo_url":"photos/jonathan_pollard.jpg"}},"222":{"id":222,"name":"Joseph Coors Sr","entity_type":"person","description":"Co-founder of the Heritage Foundation (1973) with Edwin Fuelner. Coors Brewing Company family — son of Adolph Coors, father of Pete Coors. Bohemian Club member. Used beer fortune to build the conservative policy infrastructure that produced Project 2025.","aliases":"","metadata":{"photo_url":"photos/joseph_coors_sr.jpg"}},"19":{"id":19,"name":"Kamal Adham","entity_type":"person","description":"CIA's principal Middle East liaison (mid-1960s-1979). Secret lead front-man for BCCI takeover of First American Bank.","aliases":"","metadata":{"photo_url":"photos/adham.jpg","nationality":"Saudi","status":"deceased"}},"241":{"id":241,"name":"Karin Models","entity_type":"organization","description":"Paris modeling agency originally founded by Karin Mossberg. Jean-Luc Brunel began working there in the late 1970s and was running the company by 1978. He discovered models who became prominent, including Christy Turlington (discovered at age 14) and Sharon Stone.\n\nExposed by CBS 60 Minutes in 1988 ('American Girls in Paris'): approximately two dozen models told the program that Brunel or his associate Claude Haddad had drugged and raped them. Young American models were referred to the agency by Eileen Ford of Ford Models. Despite the broadcast, no criminal action was taken against Brunel.\n\nKarin Models was the precursor to MC2 Model Management, which Brunel co-founded in 2005 with financing from Jeffrey Epstein. The same pattern — recruiting young foreign models and subjecting them to exploitation — continued across agencies and decades.","aliases":"","metadata":{}},"50":{"id":50,"name":"Kenneth Shapiro","entity_type":"person","description":"Kenneth Shapiro. Atlantic City businessman and financial advisor to Nicky Scarfo. Served as the mob's point man for casino-area land deals in Atlantic City. Facilitated property transactions with Trump's casino operations. His role demonstrates the direct financial pipeline between the Philadelphia crime family and the Atlantic City casino industry documented by the NJ State Commission of Investigation.","aliases":"","metadata":{"nationality":"American","status":"alive"}},"264":{"id":264,"name":"Kerry Committee Investigation","entity_type":"event","description":"Senate Subcommittee on Terrorism, Narcotics, and International Operations, chaired by Senator John Kerry. Investigated 1987-1989. Produced a 1,166-page report released April 13, 1989: 'Drugs, Law Enforcement and Foreign Policy.'\n\nKey findings:\n- 'Substantial evidence of drug smuggling... on the part of individual Contras, Contra suppliers, Contra pilots, mercenaries who worked with the Contras, and Contra supporters.'\n- 'Senior U.S. policy makers were not immune to the idea that drug money was a perfect solution to the Contras' funding problems.'\n- State Department chose four companies controlled by drug traffickers to provide Contra humanitarian assistance — drug traffickers received U.S. taxpayer funds.\n- Named SETCO Aviation as the principal Contra supply airline, owned by drug trafficker Juan Matta Ballesteros.\n\nKerry also led the Senate investigation into BCCI, tracking drug traffickers to Noriega (1988) and Noriega's dirty money to BCCI and 'some of the top powerbrokers in Washington.'","aliases":"","metadata":{}},"136":{"id":136,"name":"Kevin Spacey","entity_type":"person","description":"Kevin Spacey Fowler (b. 1959). Academy Award-winning actor whose career collapsed amid sexual assault allegations, with documented connections to both Jeffrey Epstein and Bill Clinton through shared travel on Epstein's private aircraft.\n\nCAREER: Born in South Orange, New Jersey. Trained at Juilliard. Won Academy Awards for The Usual Suspects (1995, Supporting) and American Beauty (1999, Lead). Starred as Frank Underwood in Netflix's House of Cards (2013-2017). Served as artistic director of the Old Vic theatre in London (2004-2015).\n\nEPSTEIN FLIGHT LOGS: Named in Epstein's flight logs for a September 2002 trip to Africa aboard Epstein's Boeing 727 (the 'Lolita Express'). The eight-day trip included Bill Clinton, Chris Tucker, and other Clinton Foundation associates, ostensibly to visit HIV/AIDS project sites. In a 2024 interview, Spacey admitted to the flight and stated: 'I didn't want to be around this guy because I felt he put the president at risk on that trip to South Africa because there were these young girls.' This admission confirms both the flight and the presence of young women, while attempting to distance himself from Epstein.\n\nSEXUAL ASSAULT ALLEGATIONS: In October 2017, actor Anthony Rapp alleged that Spacey made a sexual advance toward him in 1986, when Rapp was 14. Spacey responded by coming out as gay while deflecting the allegation. Over 30 additional accusers came forward, including crew members from House of Cards. Charged with felony sexual assault in Massachusetts (dropped 2019). Charged with 12 counts of sexual assault in the UK — acquitted on all charges in July 2023. Found not liable in Anthony Rapp's civil suit. Multiple civil cases remain pending.\n\nNETWORK SIGNIFICANCE: Spacey's presence on the Epstein flight with Clinton illustrates how entertainment industry figures were integrated into the Epstein social network through high-profile humanitarian cover events.","aliases":"Kevin Spacey Fowler","metadata":{"birth_year":1959,"nationality":"American","status":"alive","photo_url":"photos/kevin_spacey.jpg"}},"182":{"id":182,"name":"Kingdom Holding","entity_type":"organization","description":"Kingdom Holding Company (KHC). Saudi investment conglomerate founded by Prince Al-Waleed bin Talal in 1980. Listed on the Saudi stock exchange (Tadawul). A primary vehicle for Saudi royal investment into Western economies.\n\nMAJOR HOLDINGS: Citigroup (Al-Waleed was largest individual shareholder, invested $3.5 billion during 2008 crisis), Twitter (5% pre-Musk), Four Seasons Hotels (47.5%), Lyft, Snap, and numerous other major Western companies. Also holds stakes in Rotana Group (media) and multiple Middle Eastern companies.\n\nFINANCIAL BRIDGE: Kingdom Holding represents one of the primary documented channels through which Saudi royal wealth entered the Western financial system. Its Citigroup investment alone placed billions of Saudi capital into the same banking infrastructure documented throughout the broader network.","aliases":"Kingdom Holding Company, KHC","metadata":{}},"115":{"id":115,"name":"Kissinger Associates","entity_type":"organization","description":"International geopolitical consulting firm founded by Henry Kissinger in 1982 and headquartered in New York City. The firm provided strategic advisory services to multinational corporations navigating global political risks. Key members included Brent Scowcroft (president, former NSA), Lawrence Eagleburger (former Secretary of State), L. Paul Bremer (former Iraq reconstruction director), Timothy Geithner (later Treasury Secretary), and Bill Richardson (Senior Managing Director from 2001). In 1999, expanded as Kissinger McLarty Associates with Mack McLarty (Clinton's Chief of Staff). Joshua Cooper Ramo, vice chairman and co-CEO, appears in Epstein's private calendar for a scheduled meeting. Kissinger ran the firm until his death in 2023. The firm represents a nexus of government-to-private-sector power conversion, where former officials monetize access and relationships.","aliases":"Kissinger McLarty Associates, KA","metadata":{"founded":1982,"status":"active"}},"205":{"id":205,"name":"LAKAM","entity_type":"agency","description":"LAKAM (Lishka le-Kishrei Mada — Bureau of Scientific Relations), also known as Lekem. Israeli scientific intelligence collection agency operating from 1957 to 1986 under the Israeli Ministry of Defense.\n\nMISSION: Collected scientific and technical intelligence for Israel's defense establishment, particularly related to nuclear, aerospace, and advanced weapons technology. Operated independently from Mossad and Aman (military intelligence), reporting directly to the Defense Ministry.\n\nKEY OPERATIONS: (1) PROMIS SOFTWARE — LAKAM head Rafi Eitan orchestrated the acquisition of PROMIS software from the U.S. Department of Justice through the INSLAW affair. Israeli intelligence added a backdoor (trap door) to the software and, through Robert Maxwell's distribution network, sold it to intelligence agencies and governments worldwide — including Jordan, Guatemala, and others. This gave Israel (and potentially other intelligence services with knowledge of the backdoor) access to the internal databases of foreign governments. The House Judiciary Committee's 1992 investigation documented Israeli involvement. (2) JONATHAN POLLARD — LAKAM recruited and ran Pollard (1984-1985) through Colonel Aviem Sella with Rafi Eitan directing the operation. The compromise of 800,000+ pages of classified material was the most damaging espionage case involving a U.S. ally.\n\nDISBANDING: After the Pollard arrest in 1985, Israel officially disbanded LAKAM as a concession to the United States. However, its intelligence collection functions were absorbed by other Israeli agencies. The Senate Select Committee on Intelligence noted that the organizational change did not necessarily end the collection priorities LAKAM had pursued.","aliases":"Lekem, Lishka le-Kishrei Mada, Bureau of Scientific Relations","metadata":{"founded":1957,"disbanded":1986,"country":"Israel"}},"112":{"id":112,"name":"Larry Summers","entity_type":"person","description":"Lawrence Henry Summers (born 1954). Economist who served as Secretary of the Treasury (1999-2001) under Clinton, President of Harvard University (2001-2006), and Director of the National Economic Council (2009-2010) under Obama. One of the youngest tenured professors in Harvard's history at age 28. Won the John Bates Clark Medal in 1993.\n\nEPSTEIN-HARVARD NEXUS: As Harvard President, Summers approved Epstein's $6.5 million donation in 2003 to found the Program for Evolutionary Dynamics. Epstein pledged up to $25 million during Summers' tenure. Epstein was given a personal office at Harvard and appointed as a 'visiting fellow' in 2005. Flight logs show Summers first flew on Epstein's aircraft in September 1998 (Aspen to DC), with additional flights in April 2004 and September 2005.\n\nHONEYMOON ON EPSTEIN'S ISLAND: In December 2005, days after their wedding, Summers and his wife Elisa New boarded Epstein's plane from Bedford, Massachusetts, to St. Thomas, USVI — gateway to Little Saint James — with Ghislaine Maxwell listed on the same manifest. This flight occurred after Epstein was already under investigation by Palm Beach police.\n\nCONTINUED RELATIONSHIP: Epstein's schedules show planned meetings with Summers throughout 2011-2014. House Oversight Committee documents revealed thousands of emails between Summers and Epstein from 2013 to 2019. Epstein also donated $110,000 to a nonprofit tied to Summers' wife and helped broker a $500,000 donation from Leon Black to her poetry foundation. In November 2025, Summers declared himself 'deeply ashamed,' took leave from Harvard, resigned from the OpenAI board, and stepped away from public life as Harvard launched a new investigation into Epstein ties.","aliases":"Lawrence Henry Summers","metadata":{"birth_date":"1954-11-30","nationality":"American","status":"alive","photo_url":"photos/larry_summers.jpg"}},"30":{"id":30,"name":"Leon Black","entity_type":"person","description":"Apollo Global Management co-founder. Paid Epstein $158M in fees. Resigned from Apollo chairmanship.","aliases":"","metadata":{"birth_date":"1951-07-31","nationality":"American","status":"alive","photo_url":"photos/leon_black.jpg"}},"140":{"id":140,"name":"Les Moonves","entity_type":"person","description":"Leslie Roy Moonves (b. 1949). Former Chairman and CEO of CBS Corporation whose sexual misconduct closely parallels Weinstein's and Epstein's patterns, combined with documented use of law enforcement to suppress allegations — illustrating how media gatekeepers participate in the same systems of coercion they are positioned to expose.\n\nCBS CAREER: Born in Brooklyn, New York. Rose through the entertainment industry from acting to executive positions at Lorimar Television and Warner Bros. Television (where he greenlighted Friends and ER). Joined CBS in 1995 as president of CBS Entertainment, eventually becoming Chairman and CEO of CBS Corporation in 2006.\n\nSEXUAL MISCONDUCT: Ronan Farrow's reporting in The New Yorker (2018) led to allegations from 12 women spanning decades — ranging from forced oral sex to forcible touching and career retaliation. Lawyers investigating CBS found credible evidence that Moonves received oral sex from at least four employees under 'transactional and improper' circumstances. Moonves was 'evasive and untruthful,' deleted hundreds of texts, and gave investigators his son's iPad instead of his own.\n\nLAPD CONSPIRACY: An LAPD captain met personally with Moonves and fed him confidential information about active investigations into his sexual assault allegations. CBS and Moonves were ordered to pay $30.5 million to the NY Attorney General for insider trading and concealing sexual assault allegations from investors.\n\nEPSTEIN CONNECTION: Moonves appears in Epstein's records sharing two flights on Epstein's aircraft. Epstein monitored the #MeToo fallout affecting Moonves in 2017 emails, tracking which powerful men were being accused and advising some behind the scenes. Moonves was among the names Epstein discussed in email correspondence with publicist Peggy Siegal.\n\nMEDIA SUPPRESSION: CBS's corporate culture under Moonves exemplified how media organizations could function as protective shields for powerful predators. Ronan Farrow's reporting revealed a 'culture of impunity' at the network. ABC News anchor Amy Robach was separately caught on a hot mic in 2019 stating that ABC had killed her Epstein story three years earlier under pressure from Buckingham Palace — demonstrating the broader pattern of network-level story suppression protecting the Epstein network.","aliases":"Leslie Moonves","metadata":{"birth_year":1949,"nationality":"American","status":"alive","photo_url":"photos/les_moonves.jpg"}},"4":{"id":4,"name":"Les Wexner","entity_type":"person","description":"Leslie Herbert Wexner (b. 1937). Founder of L Brands (The Limited, Victoria's Secret, Bath & Body Works, Abercrombie & Fitch). Richest man in Ohio. Mega Group co-founder. Central figure in the Epstein network through an unprecedented financial relationship.\n\nEPSTEIN RELATIONSHIP: Granted Jeffrey Epstein full power of attorney over his finances — an arrangement virtually unheard of between a billionaire and a financial advisor. Transferred the largest private residence in Manhattan (9 East 71st St, valued at $46M) to Epstein for a reported $0 in 1998. The nature of Epstein's financial services to Wexner has never been adequately explained. Wexner claimed in 2019 that Epstein had 'misappropriated vast sums of money' but no legal action was ever filed.\n\nMEGA GROUP: Co-founded with Charles Bronfman in 1991 — a secretive annual gathering of approximately 20 of the wealthiest pro-Israel donors in North America. Epstein attended Mega Group meetings despite not qualifying for membership by wealth. The group's activities and membership are deliberately opaque.\n\nVICTORIA'S SECRET PIPELINE: Multiple witnesses and victims described Epstein using Victoria's Secret modeling recruitment as a lure. Epstein carried business cards identifying himself as a VS talent scout. Wexner's knowledge of this misuse has not been conclusively established.\n\nINTELLIGENCE AND MILITARY CONNECTIONS: Southern Air Transport — a documented CIA front airline used in Iran-Contra — shipped goods for The Limited. Ohio created taxpayer incentives for SAT at Wexner's behest. The Wexner Foundation paid former Israeli PM Ehud Barak $2M for vague 'research,' channeling money to Israeli military intelligence leadership.\n\nCO-CONSPIRATOR DESIGNATION: Named as a co-conspirator on a 2019 FBI document related to the Epstein investigation. The scope and specifics remain partially sealed.\n\n2026 HOUSE OVERSIGHT DEPOSITION: Testified before the House Oversight Committee on February 18, 2026. During the deposition, attorney Michael Levy was caught on a hot microphone threatening Wexner for answering committee questions, suggesting ongoing efforts to limit testimony about the Epstein network.","aliases":"Leslie Wexner","metadata":{"photo_url":"photos/wexner.jpg","birth_date":"1937-09-08","nationality":"American","status":"alive"}},"150":{"id":150,"name":"Lesley Groff","entity_type":"person","description":"Lesley Groff. Executive assistant to Jeffrey Epstein for nearly 20 years (approximately 2001-2019). Named co-conspirator in both the 2007 NPA and 2019 FBI investigation documents. One of the most frequently mentioned names in the released DOJ Epstein files.\n\nBACKGROUND: Resided in New Canaan, Connecticut. Joined Epstein's New York office after posting her resume online and interviewing with both Epstein and Ghislaine Maxwell. Epstein once described her as 'an extension of my brain.'\n\nROLE: Managed Epstein's schedule, travel logistics, investment meetings, and correspondence for nearly two decades. Her name appears more than 130,000 times in released DOJ documents, coordinating everything from meetings with Yale University professors to investment opportunities to the daily operations of Epstein's household across multiple properties.\n\nCO-CONSPIRATOR DESIGNATIONS: Named as a co-conspirator in the 2007 Non-Prosecution Agreement and received immunity. A 2019 FBI investigation document listed Groff alongside Ghislaine Maxwell, Jean-Luc Brunel, and Les Wexner as co-conspirators. According to her attorney, Groff was never notified of the co-conspirator designation.\n\nLEGAL OUTCOME: Faced multiple civil lawsuits from Epstein's victims accusing her of facilitating his crimes. All complaints were eventually dropped. In 2021, prosecutors declined to charge Groff after she voluntarily spoke with them and 'answered each and every question.' Through her attorney, she has denied any knowledge of or involvement in Epstein's sex trafficking network.","aliases":"Leslie Groff","metadata":{"nationality":"American","status":"alive","photo_url":"photos/lesley_groff.jpg"}},"98":{"id":98,"name":"LifeLog","entity_type":"program","description":"DARPA program to build a database of a person's entire existence. Cancelled Feb 4, 2004 — same day Facebook launched.","aliases":"","metadata":{}},"174":{"id":174,"name":"Lippo Group","entity_type":"organization","description":"Lippo Group. Multi-billion-dollar Indonesian conglomerate controlled by the Riady family (Mochtar Riady and his son James Riady). Operations span banking, real estate, manufacturing, insurance, securities, and retail across Southeast Asia.\n\nCHINESE INTELLIGENCE CONNECTION: The 1998 Senate Governmental Affairs Committee reported that both Mochtar and James Riady 'had a long-term relationship with a Chinese intelligence agency.' According to journalist Bob Woodward, this finding was based on highly classified intelligence from both the CIA and FBI.\n\nCLINTON CONNECTION: James Riady first met Bill Clinton in the late 1970s in Arkansas. According to White House logs, James Riady visited the White House 20 times and met with President Clinton on six of those visits. John Huang worked for Lippo before his appointment to the Commerce Department. Campaign contributions made by Huang had been reimbursed with funds wired from a foreign Lippo entity.\n\nLEGAL OUTCOME: In 2001, James Riady pled guilty to a felony campaign finance charge and paid an $8.6 million fine — the largest fine for a campaign finance violation in U.S. history at the time.","aliases":"Lippo","metadata":{}},"76":{"id":76,"name":"Little Saint James","entity_type":"facility","description":"Little Saint James. Private island in the US Virgin Islands owned by Jeffrey Epstein from 1998 until his death. Also known as 'Pedophile Island' or 'Epstein Island.' Site of a mysterious temple-like structure, staff quarters, and underground facilities documented in aerial photographs and drone footage. Flight logs and witness testimony document visits by numerous prominent figures. FBI raided the island in August 2019 following Epstein's arrest. The island and neighboring Great Saint James were listed for sale by Epstein's estate.","aliases":"Epstein Island, Pedophile Island","metadata":{"photo_url":"photos/little_saint_james.jpg"}},"169":{"id":169,"name":"Liu Chaoying","entity_type":"person","description":"Liu Chaoying (born c. 1962). Former Lieutenant Colonel in the People's Liberation Army and executive at China Aerospace International Holdings (CASIL), the Hong Kong-based subsidiary of China Aerospace Science and Technology Corporation (CASC) — China's premier satellite launch company.\n\nFAMILY: Daughter of General Liu Huaqing, former Vice Chairman of the Central Military Commission and one of the most powerful figures in the PLA. Her elder brother is a vice admiral in the PLA Navy.\n\nCAMPAIGN FINANCE CONNECTION: Johnny Chung befriended Liu during a U.S. Commerce Department trade mission to China. When Liu visited the U.S. in July 1996, Chung introduced her to President Clinton at a Los Angeles fundraiser. Chung testified under oath that Liu introduced him to General Ji Shengde (head of PLA military intelligence), and that $35,000 of the money he donated to the DNC came from Liu and China's military intelligence.\n\nLiu also invested $300,000 in Chung's company, Automated Intelligent Systems. Both Liu and the Chinese government denied the campaign finance allegations.","aliases":"Liu","metadata":{"photo_url":"photos/liu_chaoying.jpg"}},"80":{"id":80,"name":"Lucchese Crime Family","entity_type":"organization","description":"One of the Five Families of New York. Connected to Frankie Carbo (Murder Inc triggerman turned boxing czar). Extended operations across construction, garment industry, and labor unions in New York. The 'Carbone' name associated with Lucchese operations.","aliases":"Lucchese Family","metadata":{}},"45":{"id":45,"name":"Lucky Luciano","entity_type":"person","description":"Charles 'Lucky' Luciano (1897-1962). Founder of the modern American Mafia. With Meyer Lansky, created the National Crime Syndicate — organizing Italian and Jewish criminal enterprises into a corporate structure. Established The Commission in 1931 to govern the Five Families. Created Murder, Incorporated as the national enforcement arm. Imprisoned in 1936. Released in 1946 through Operation Underworld — ONI recruited the mob through Lansky to secure NYC waterfront and provide intelligence for the Sicily invasion. Deported to Italy. Organized the 1946 Havana Conference at the Hotel Nacional. Died in Naples, 1962.","aliases":"Charles Luciano, Salvatore Lucania","metadata":{"photo_url":"photos/luciano.jpg","birth_date":"1897-11-24","death_date":"1962-01-26","nationality":"American-Italian","status":"deceased"}},"126":{"id":126,"name":"Lynn Forester de Rothschild","entity_type":"person","description":"Lynn Forester, Lady de Rothschild (b. 1954). American-British businesswoman who served as a key social connector between Jeffrey Epstein and the Clinton-Rothschild orbit.\n\nCAREER: Born in Bergen County, New Jersey. Phi Beta Kappa graduate of Pomona College, honors graduate of Columbia Law School. Worked at Simpson Thacher & Bartlett before entering telecommunications, helping billionaire John Kluge acquire cellular network licenses. Founded FirstMark Communications in 1995 and its European arm in 1998, sold in a $1 billion financing deal in 2000.\n\nROTHSCHILD MARRIAGE: Introduced to Sir Evelyn de Rothschild by Henry Kissinger at the 1998 Bilderberg Group conference. Married November 30, 2000. Sir Evelyn — a member of the fabulously wealthy European banking dynasty and almost 23 years her senior — left his wife and three children for the marriage. She became chair of E.L. Rothschild, the family holding company, after Sir Evelyn's death.\n\nTHE 1995 CLINTON LETTER: A letter preserved in the Clinton Presidential Library, dated April 1995, from Forester to President Clinton states: 'It was a pleasure to see you recently at Senator Kennedy's house... Using my fifteen seconds of access to discuss Jeffrey Epstein and currency stabilization, I neglected to talk to you about a topic near and dear to my heart.' The letter documents that Forester was discussing Epstein with the sitting President as early as 1995 — years before Epstein's public profile emerged.\n\nEPSTEIN INTRODUCTIONS: According to multiple accounts, Forester de Rothschild served as a key introducer for Epstein. Alan Dershowitz stated she introduced him to Epstein, calling him an 'interesting autodidact.' Ghislaine Maxwell stated that Forester de Rothschild introduced Prince Andrew to Epstein. These introductions placed Epstein in direct contact with British royalty, the Rothschild banking dynasty, and the Clinton political network — dramatically expanding the reach of whatever operation Epstein was running.\n\nNETWORK POSITION: Forester de Rothschild sits at the intersection of Democratic politics (Clinton), European banking (Rothschild), and the Epstein social network. Her role as introducer is one of the most documented examples of how Epstein gained access to heads of state and royalty through social gatekeepers.","aliases":"Lynn Forester, Lady de Rothschild","metadata":{"birth_date":"1954-07-02","nationality":"American-British","status":"alive","photo_url":"photos/lynn_rothschild.jpg"}},"141":{"id":141,"name":"MC2 Model Management","entity_type":"organization","description":"MC2 Model Management. Modeling agency founded in 2005 by Jean-Luc Brunel with up to $1 million in funding from Jeffrey Epstein. The name was an inside reference to Einstein's E=MC2 equation, with 'E' standing for Epstein. Operated offices in New York City and Miami. Served as a legitimate commercial front that simultaneously functioned as a trafficking pipeline — securing work visas for young foreign women from Eastern Europe and Latin America, creating paper trails of legitimate modeling employment while providing Epstein access to vulnerable young models. Virginia Giuffre's 2014 court filing alleged the agency was a cover for sex trafficking. Brunel quietly sold off MC2's assets after Epstein's 2019 arrest.","aliases":"MC2 Models","metadata":{}},"157":{"id":157,"name":"MCC New York","entity_type":"facility","description":"Metropolitan Correctional Center, New York. Federal detention facility in Lower Manhattan operated by the Bureau of Prisons. The facility where Jeffrey Epstein was found dead on August 10, 2019, while awaiting trial on sex trafficking charges.\n\nEPSTEIN'S DEATH: Epstein was found unresponsive in his cell at approximately 6:30 AM, hanging from a bedsheet tied to the upper bunk. The New York City medical examiner ruled the death a suicide by hanging. The DOJ Inspector General's report documented catastrophic security failures.\n\nSECURITY FAILURES: Two correctional officers — Michael Thomas and Tova Noel — assigned to guard Epstein overnight failed to complete more than 75 mandatory checks. Both officers were found to have been sleeping and later falsified records to cover the lapse. Nearly all cameras in and around the Special Housing Unit where Epstein was held stopped recording in late July 2019, continuing through the date of his death. Five hours of footage from a camera outside Epstein's cell on the night of a previous incident (July 22-23) were 'mistakenly not preserved.'\n\n2026 DEVELOPMENTS: Newly released DOJ documents and surveillance logs raised additional questions, with investigators noting an unidentified orange-colored figure moving toward Epstein's locked housing tier at approximately 10:39 PM on August 9, 2019. The facility was permanently closed in 2021 due to deplorable conditions.","aliases":"Metropolitan Correctional Center","metadata":{}},"190":{"id":190,"name":"MI5","entity_type":"agency","description":"Security Service (MI5). The United Kingdom's domestic counter-intelligence and security agency. Established 1909. Responsible for protecting the UK against threats to national security including espionage, terrorism, and subversion.\n\nMAXWELL CONNECTION: MI5 held files on Robert Maxwell from at least the 1950s. Former MI5 officer Peter Wright (Spycatcher, 1987) described Maxwell as a known intelligence figure. Despite documented concerns about Maxwell's Mossad and KGB connections, MI5 did not act to restrict his activities in the UK. The pattern of institutional awareness combined with inaction is consistent with Maxwell's protected status as a useful asset.\n\nSAVILE CONNECTION: Sunday Times (2015) reported MI5 files showed Savile had been monitored for decades due to abuse allegations, yet no action was taken. The IICSA Westminster investigation documented systematic failures across UK institutions — including intelligence agencies — to act on known abuse by establishment figures.\n\nInstitutional counterpart to the FBI in the U.S. context. Works alongside MI6 (foreign intelligence) and GCHQ (signals intelligence) as part of the UK intelligence community.","aliases":"Security Service, MI-5, Box 500","metadata":{}},"191":{"id":191,"name":"MI6","entity_type":"agency","description":"Secret Intelligence Service (SIS/MI6). The United Kingdom's foreign intelligence agency. Established 1909. Responsible for collecting foreign intelligence in support of UK national security and economic well-being.\n\nMAXWELL CONNECTION: Multiple investigative accounts (Gordon Thomas, Seymour Hersh, John Preston) document Robert Maxwell's relationship with MI6. Maxwell was recruited during or shortly after WWII, when he served in British Army intelligence. His Pergamon Press publishing empire provided cover for intelligence-gathering across the Eastern Bloc during the Cold War. MI6 was aware of Maxwell's simultaneous relationship with Mossad and, according to Thomas & Dillon, used the Maxwell-Mossad channel as a back-channel to Israeli intelligence.\n\nINSTITUTIONAL ROLE: MI6 works closely with CIA (documented liaison since WWII), Mossad (documented cooperation), and other Five Eyes partners (NSA, GCHQ, Australian and Canadian services). The intelligence-sharing relationships mean that compromised figures in one network (Epstein through Mossad/CIA) had indirect institutional connections to MI6 through the broader intelligence architecture.","aliases":"Secret Intelligence Service, SIS, MI-6, Box 850","metadata":{}},"94":{"id":94,"name":"MKULTRA","entity_type":"program","description":"CIA mind control program. Operation Midnight Climax used sexual blackmail. DCI Helms ordered files destroyed 1973.","aliases":"MK-ULTRA","metadata":{}},"172":{"id":172,"name":"MSS","entity_type":"agency","description":"Ministry of State Security (Guojia Anquan Bu, MSS). The People's Republic of China's intelligence, security, and secret police agency. Established in 1983 by merging the Central Investigation Department with counterintelligence elements of the Ministry of Public Security.\n\nFUNCTION: A DOJ document described the MSS as combining the functions of the CIA and FBI. Responsible for foreign intelligence, counterintelligence, and domestic political security. The 18th Bureau is dedicated specifically to espionage operations against the United States.\n\nDOCUMENTED OPERATIONS: CSIS documented hundreds of Chinese espionage cases in the U.S. since 2000. Notable penetrations include Katrina Leung (codename 'Parlor Maid'), an FBI informant who was simultaneously a double agent for the MSS from 1982 to 2003, compromising 20 years of FBI counterintelligence on China.\n\nNETWORK RELEVANCE: The MSS operates alongside PLA military intelligence (Second Department of the General Staff) — the entity that, through General Ji Shengde, funneled money to Clinton's DNC via Johnny Chung. The Thompson Committee (1998) documented a PRC 'Central Leading Group for U.S. Congressional Affairs' coordinating China's influence operations. The MSS relationship with Western intelligence agencies (CIA, MI6, Mossad) is primarily adversarial, with limited cooperation on counter-terrorism.","aliases":"Ministry of State Security, Guojia Anquan Bu, Chinese Intelligence","metadata":{}},"92":{"id":92,"name":"Main Core","entity_type":"program","description":"Domestic surveillance database. Alleged successor to PROMIS for tracking Americans. Continuity of government program.","aliases":"","metadata":{}},"255":{"id":255,"name":"Manuel Noriega","entity_type":"person","description":"Head of Panamanian military intelligence (G-2) from 1968; de facto ruler of Panama 1983-1989. Born February 11, 1934, Panama City. Died May 29, 2017.\n\nOn CIA payroll from 1971 despite U.S. knowledge of his drug trafficking. CIA Director George H.W. Bush paid Noriega $110,000 in 1976. Carter suspended payments; Reagan reinstated in 1981. Received $200,000 from CIA in 1986 alone. Payroll cut off 1987 after protests.\n\nIran-Contra role: supported Contra resupply operations through Panama in exchange for U.S. turning blind eye to drug trafficking. BCCI laundered $23 million of Noriega's criminal proceeds through London branches; his personal BCCI banker was Amjad Awan (convicted 1991, 12-year sentence). Graduate of the U.S. Army School of the Americas.\n\nDecember 20, 1989: U.S. invaded Panama (Operation Just Cause). Noriega surrendered January 3, 1990. Convicted April 1992 on 8 of 10 charges (drug trafficking, racketeering, money laundering). Sentenced to 40 years.","aliases":"","metadata":{"photo_url":"photos/manuel-noriega.jpg"}},"75":{"id":75,"name":"Mar-a-Lago","entity_type":"facility","description":"Mar-a-Lago. Private estate and club in Palm Beach, Florida, owned by Donald Trump since 1985. Site of Trump's claimed ban of Jeffrey Epstein (timing disputed). Epstein's Palm Beach mansion was approximately one mile away. According to court documents and witness testimony, Mar-a-Lago was part of the Palm Beach social circuit where Trump and Epstein interacted in the late 1990s and early 2000s.","aliases":"","metadata":{"photo_url":"photos/mar_a_lago.jpg"}},"22":{"id":22,"name":"Marc Rich","entity_type":"person","description":"Commodities trader, Mossad's primary oil source for 20 years. Founded Glencore. Pardoned by Clinton.","aliases":"","metadata":{"photo_url":"photos/marc_rich.jpg","birth_date":"1934-12-18","death_date":"2013-06-26","nationality":"American-Israeli-Spanish","status":"deceased"}},"146":{"id":146,"name":"Maria Farmer","entity_type":"person","description":"Maria Kristine Farmer (b. November 28, 1969, Paducah, Kentucky). Visual artist and the first known person to file a criminal complaint against Jeffrey Epstein and Ghislaine Maxwell — in 1996, nine years before the Palm Beach investigation.\n\nBACKGROUND: Trained as a figurative painter at the New York Academy of Art. Entered Epstein's orbit in 1995 as an art researcher hired to source works for his collection. At the time, she was in graduate school and selling artwork from her studio.\n\nSEXUAL ASSAULT AT WEXNER ESTATE (1996): In May 1996, Farmer traveled to Les Wexner's property in Ohio as an artist-in-residence. The estate was guarded by Wexner's armed security and she was required to call Wexner's wife for permission to leave. Farmer stated in a sworn affidavit that Epstein and Maxwell came to the property and sexually assaulted her. This assault occurred at Wexner's personal estate — placing the Epstein operation's activities directly within Wexner's physical domain.\n\nFBI REPORT — THE FIRST COMPLAINT (1996): On August 26, 1996, Farmer called the NYPD and FBI to report the assault. On September 3, 1996, she reported to the FBI that nude photographs of her younger sisters — then aged 12 and 16 — had been stolen from her storage, expressing concerns about child pornography. The DOJ file release in 2026 provided irrefutable proof of this 1996 FBI report, confirming Farmer filed one of the earliest complaints against Epstein.\n\nSISTER ANNIE FARMER: Maria's younger sister Annie was 15 years old when she was sexually assaulted by Epstein and Maxwell in separate incidents in 1996, including at Epstein's Zorro Ranch in New Mexico. Annie later became a psychologist specializing in trauma recovery and testified at Ghislaine Maxwell's 2021 trial.\n\nSIGNIFICANCE: Farmer's 1996 complaint demonstrates that law enforcement — both NYPD and FBI — had documented allegations against Epstein and Maxwell nine years before the Palm Beach investigation. The failure to act on these early reports is part of the documented pattern of institutional protection around Epstein.","aliases":"","metadata":{"birth_date":"1969-11-28","nationality":"American","status":"alive","photo_url":"photos/maria_farmer.jpg"}},"198":{"id":198,"name":"Mark Thompson","entity_type":"person","description":"Sir Mark John Thompson (born 1957). Director-General of the BBC (2004-2012), subsequently CEO of The New York Times Company (2012-2020), Chairman and CEO of CNN (2022-2024).\n\nSAVILE SCANDAL: Thompson was Director-General of the BBC when the corporation decided to drop a Newsnight investigation into Jimmy Savile's decades of sexual abuse in late 2011. The Dame Janet Smith Review (2016) and subsequent BBC Trust investigation examined the decision to shelve the Newsnight report. Thompson stated he was not involved in the editorial decision to drop the investigation, but his tenure coincided with the suppression. He was questioned by UK Parliament about his knowledge.\n\nPATTERN: Thompson's career trajectory — from the BBC during the Savile suppression to the New York Times to CNN — illustrates how institutional media figures move between organizations without accountability for institutional failures. The BBC's suppression of the Savile investigation is the documented UK equivalent of media complicity in the Epstein cover-up.","aliases":"Sir Mark Thompson","metadata":{"photo_url":"photos/mark_thompson.jpg"}},"159":{"id":159,"name":"Maxwell Trial (2021)","entity_type":"event","description":"United States v. Ghislaine Maxwell (S.D.N.Y. 20-cr-330). Federal sex trafficking trial held November-December 2021 in Manhattan.\n\nGhislaine Maxwell was charged with six counts including sex trafficking of a minor, enticement of a minor, and conspiracy. Over three weeks of testimony, four women described how Maxwell recruited them into Epstein's orbit, presenting herself as a friendly older woman, earning trust through gifts and shopping sprees, then facilitating sexual abuse by Epstein. Two witnesses testified they were 14 years old when Maxwell lured them into sexual acts with Epstein.\n\nVERDICT: On December 29, 2021, after five days of deliberation, the jury convicted Maxwell on five of six counts: sex trafficking of a minor (max 40 years), transporting a minor for criminal sexual activity (10 years), and three conspiracy counts (15 years total). She was acquitted on one count of enticement.\n\nSENTENCING: On June 28, 2022, Maxwell was sentenced to 20 years in federal prison by Judge Alison Nathan. Her conviction was upheld on appeal by the Second Circuit in September 2024. Maxwell is currently incarcerated.\n\nSIGNIFICANCE: The Maxwell trial was the only federal criminal proceeding arising from the Epstein investigation to produce a conviction beyond Epstein's own 2008 plea. Despite evidence implicating numerous co-conspirators, no other individuals have been federally charged.","aliases":"United States v. Maxwell","metadata":{}},"260":{"id":260,"name":"Medellín Cartel","entity_type":"organization","description":"Colombian drug cartel based in Medellín, active 1976-1993. Responsible for the majority of cocaine entering the United States in the 1980s.\n\nIntelligence connections: CIA supported paramilitary groups fighting Pablo Escobar in 1992-93. CIA provided materiel support and helped form Los Pepes (Perseguidos por Pablo Escobar), combining Cali Cartel members, Escobar's former associates, and Colombian military. U.S. Embassy Joint Task Force worked with the Colombian Search Bloc that killed Escobar on December 2, 1993.\n\nBCCI connection: Operation C-Chase (U.S. Customs/IRS undercover operation, 1986-1988) convicted six BCCI officers and a Colombian businessman of laundering $14 million in Medellín cocaine profits through BCCI Panama, Luxembourg, and LOANS Switzerland.\n\nBarry Seal worked as cocaine courier for the cartel while simultaneously working for CIA and DEA. Seal imported an estimated $3-5 billion worth of drugs / ~56 tons of cocaine into the U.S. The cartel assassinated Seal on February 19, 1986 in Baton Rouge.","aliases":"","metadata":{}},"66":{"id":66,"name":"Mega Group","entity_type":"organization","description":"Secretive group of billionaire pro-Israel donors. Co-founded by Wexner and Charles Bronfman. Epstein attended meetings.","aliases":"","metadata":{}},"209":{"id":209,"name":"Meir Dagan","entity_type":"person","description":"Meir Dagan (1945-2016). Director of the Mossad from 2002 to 2011. Widely regarded as having rebuilt and modernized the agency during one of its most operationally active periods.\n\nMILITARY CAREER: Born in the Soviet Union, emigrated to Israel as a child. Decorated IDF officer who served in the 1967 and 1973 wars. Founded Sayeret Rimon, a special operations unit targeting Palestinian guerrillas in Gaza (early 1970s). Rose to Major General.\n\nMOSSAD TENURE (2002-2011): Appointed by Prime Minister Ariel Sharon with the mandate to 'make the Mossad into the Mossad again.' Under Dagan's leadership, the Mossad conducted: (1) Targeted assassination campaigns against Iranian nuclear scientists, (2) The alleged Stuxnet cyber operation against Iran's Natanz facility (joint with NSA/CIA), (3) Expanded intelligence operations globally. Ronen Bergman's 'Rise and Kill First' documents Dagan's transformation of the agency.\n\nBLACK CUBE CONNECTION: After leaving the Mossad, Dagan served as honorary president of Black Cube (BC Strategy Ltd), the private intelligence firm founded by Mossad/Aman veterans. Black Cube was later hired by Harvey Weinstein to surveil and discredit sexual assault accusers — a connection facilitated by Ehud Barak. Dagan's involvement in Black Cube connects the serving Mossad director directly to the privatized intelligence apparatus that overlaps with the Epstein network through Barak.\n\nDagan died of liver cancer in March 2016.","aliases":"Dagan","metadata":{"birth_year":1945,"death_year":2016,"nationality":"Israeli","status":"deceased","photo_url":"photos/meir_dagan.jpg"}},"194":{"id":194,"name":"Metropolitan Police","entity_type":"agency","description":"Metropolitan Police Service (the Met). The territorial police force responsible for law enforcement in Greater London (excluding the City of London). The UK's largest police force, with approximately 34,000 officers.\n\nEPSTEIN INVESTIGATION FAILURE: The Met opened an investigation into Epstein-related allegations in 2015, following Virginia Giuffre's public claims of being trafficked to London. The investigation was dropped the same year, with the Met stating there was 'insufficient evidence' to pursue charges. This decision was made despite the existence of Giuffre's sworn testimony and corroborating evidence in the US proceedings.\n\nSAVILE INVESTIGATION FAILURE: The Met received reports about Jimmy Savile's abuse as early as the 1960s. Multiple referrals were made over decades. The Met admitted in 2013 to 'fundamental failings' in its handling of Savile complaints. Operation Yewtree, launched in 2012 after Savile's death, identified over 450 victims — all of whom could have been protected had earlier reports been acted upon.\n\nPATTERN: The Met's failure to investigate elite abuse is documented across multiple cases: Savile, Epstein/Andrew, and the broader Westminster abuse network documented by IICSA. The pattern is consistent with institutional protection of establishment figures, whether through direct instruction or institutional culture.","aliases":"The Met, Met Police, Scotland Yard, Metropolitan Police Service","metadata":{}},"18":{"id":18,"name":"Meyer Lansky","entity_type":"person","description":"Meyer Suchowljansky (1902-1983). 'The Mob's Accountant.' Architect of the National Crime Syndicate and the most important bridge node between organized crime and the intelligence apparatus.\n\nNATIONAL CRIME SYNDICATE: With Lucky Luciano, Lansky created the organizational model for American organized crime — a national corporation transcending ethnic lines. The Commission (1931) governed the Five Families. Murder, Inc. served as the enforcement arm. Lansky served as the financial brain for all of it.\n\nOPERATION UNDERWORLD (1942-1945): Served as intermediary when the Office of Naval Intelligence recruited the mob to secure New York's waterfront during WWII. Lansky connected ONI to Lucky Luciano in prison, who ordered his entire network to prevent sabotage and strikes. Not a single incident occurred for the rest of the war. The mob also provided intelligence for the Sicily invasion. This established the structural relationship between organized crime and the national security state that has never been fully severed.\n\nHOOVER BLACKMAIL: Obtained compromising photographs of FBI Director J. Edgar Hoover, per multiple witnesses including Susan Rosenstiel (testimony under oath to NY State Crime Committee) and two former OSS officials. For three decades, Hoover refused to acknowledge organized crime existed — 400 FBI agents assigned to communists, 4 to organized crime. Whether blackmail was the cause, the effect was identical: Lansky operated with de facto FBI protection.\n\nISRAEL AND INTELLIGENCE: Arranged arms smuggling for the Haganah (pre-IDF) in 1945-48, using Albert Anastasia's control of the longshoremen to load weapons onto ships. Worked directly with Rafi Eitan (legendary Israeli intelligence operative who captured Eichmann and later ran Jonathan Pollard). Through Tibor Rosenbaum's Banque de Credit International in Geneva, Lansky laundered criminal proceeds through the same institution that handled 90% of Israeli Defense Ministry arms purchases.\n\nCUBA AND LAS VEGAS: Partnered with Fulgencio Batista to build Havana's casino empire. Organized the 1946 Havana Conference at the Hotel Nacional — the national syndicate's postwar summit, attended by Luciano, Costello, Genovese, Bonanno, and others. When Castro's revolution destroyed Cuban operations, Lansky pivoted to Las Vegas, which he had been developing since assigning Bugsy Siegel to build the Flamingo Hotel in 1946.\n\nOFFSHORE BANKING: Pioneered the use of Swiss banks (from 1932), Bahamas shell companies, and Caribbean tax havens for money laundering — creating the infrastructure later adopted by intelligence agencies for covert finance. This architecture survived Lansky and was used by successor networks.\n\nLEGACY: Died January 15, 1983, officially leaving $57,000. FBI estimated $300M hidden worldwide. The money was never found. But the infrastructure — offshore routes, intelligence relationships, blackmail methodology, Israeli connections — was institutional, not personal. It persisted through Rafi Eitan to Robert Maxwell to Ghislaine Maxwell to Jeffrey Epstein.","aliases":"","metadata":{"photo_url":"photos/lansky.jpg","birth_date":"1902-07-04","death_date":"1983-01-15","nationality":"American","status":"deceased"}},"229":{"id":229,"name":"Michael Bloomberg","entity_type":"person","description":"Billionaire media mogul, former Mayor of New York City (2002-13), 2020 presidential candidate. On 2023 Bohemian Grove attendance list — Mandalay camp alongside David McCormick and Henry Kissinger (Kissinger's final Grove).","aliases":"","metadata":{"photo_url":"photos/michael_bloomberg.jpg"}},"122":{"id":122,"name":"Michael Steinhardt","entity_type":"person","description":"Michael H. Steinhardt (b. 1940). Hedge fund pioneer, Mega Group member, Birthright Israel co-founder, serial sexual harasser, and looted antiquities trafficker whose father was a Genovese crime family fence.\n\nORGANIZED CRIME ORIGINS: Father Sol Frank 'Red McGee' Steinhardt was a convicted fence for the Genovese crime family — an associate of Meyer Lansky, Vincent 'Jimmy Blue Eyes' Alo, and Albert Anastasia. Sol was convicted in 1958 for buying and selling stolen jewelry. Michael has written about visiting his father in prison as a child. His initial investment capital reportedly came from a bar mitzvah gift of stolen stock from his father. This organized crime lineage directly mirrors the Bronfman family pattern of criminal-origin wealth transitioning into respectable philanthropy.\n\nHEDGE FUND CAREER: Founded Steinhardt, Fine, and Berkowitz (later Steinhardt Partners) in 1967, with backing from William Salomon of Salomon Brothers and Jack Nash of Odyssey Partners. Averaged 24.5% annual returns over 28 years — nearly triple the S&P 500. Closed the fund in 1995 after a $70 million SEC/DOJ settlement related to Treasury Note market manipulation.\n\nMEGA GROUP: Member of the Mega Group alongside Wexner, Bronfman, and Lauder. Co-founded Birthright Israel with Charles Bronfman in 1994 — the signature project connecting American Jewish youth to Israel through free 10-day trips.\n\nSEXUAL HARASSMENT: In 2019, seven women accused Steinhardt of a pattern of sexual harassment spanning decades. Allegations included propositioning subordinates, asking a rabbi to become his concubine, and requesting threesomes with female employees. Hillel International investigated and confirmed harassment of two employees. The pattern of powerful men in this network engaging in sexual predation is structurally consistent.\n\nLOOTED ANTIQUITIES: In December 2021, the Manhattan DA forced Steinhardt to surrender 180 looted antiquities valued at $70 million, plundered from 11 countries. He received an unprecedented lifetime ban on acquiring antiquities. Objects had been illegally smuggled from Bulgaria, Egypt, Greece, Iraq, Israel, Italy, Jordan, Lebanon, Libya, Syria, and Turkey.","aliases":"","metadata":{"birth_date":"1940-12-07","nationality":"American","status":"alive","photo_url":"photos/michael_steinhardt.jpg"}},"196":{"id":196,"name":"Mirror Group Newspapers","entity_type":"organization","description":"Mirror Group Newspapers (MGN). British newspaper publisher owned by Robert Maxwell from 1984 until his death in 1991. Published the Daily Mirror, Sunday Mirror, and The People — major UK tabloids with millions of daily readers.\n\nPENSION FRAUD: After Maxwell's death in November 1991, it was discovered he had looted approximately £440 million from the Mirror Group pension funds to prop up his failing business empire. This was one of the largest corporate frauds in British history. The Serious Fraud Office investigated but Maxwell's death precluded prosecution.\n\nINTELLIGENCE PLATFORM: Like Pergamon Press before it, Mirror Group provided Maxwell with influence, access, and cover. Ownership of major newspapers gave Maxwell political leverage with UK government officials and intelligence access through media operations. The pattern of using media ownership as intelligence cover is documented across the network: Maxwell (Mirror/Pergamon), Hollinger International (Conrad Black), and in a different context, Lebedev (Independent/Evening Standard).\n\nGhislaine Maxwell grew up as the daughter of the Mirror Group proprietor. Her social connections, access to elite circles, and comfort operating among the powerful all derive from this Maxwell media empire background.","aliases":"MGN, Mirror Group, Daily Mirror","metadata":{}},"179":{"id":179,"name":"Mohammed bin Salman","entity_type":"person","description":"Mohammed bin Salman Al Saud (born 1985). Crown Prince of Saudi Arabia (2017-present), Prime Minister (2022-present), de facto ruler of the Kingdom. Son of King Salman bin Abdulaziz Al Saud.\n\nCONSOLIDATION OF POWER: In November 2017, MBS conducted the Ritz-Carlton purge — detaining over 200 Saudi princes, officials, and businessmen at the Ritz-Carlton Riyadh in an 'anti-corruption' campaign. Among those detained was Prince Al-Waleed bin Talal, held for 83 days until reaching a financial settlement reportedly over $6 billion. Bradley Hope and Justin Scheck's Blood and Oil documents this consolidation.\n\nKHASHOGGI ASSASSINATION: On October 2, 2018, Saudi journalist Jamal Khashoggi was assassinated inside the Saudi consulate in Istanbul by a 15-member team. The UN Special Rapporteur (Agnes Callamard, 2019) concluded the killing was 'deliberate, premeditated execution.' The ODNI assessment (declassified 2021) stated that MBS 'approved an operation in Istanbul, Turkey to capture or kill' Khashoggi.\n\nNETWORK CONNECTIONS: MBS has cultivated relationships with Jared Kushner (Trump son-in-law and senior advisor), who reportedly shared intelligence with MBS. Saudi lobbying spending in Washington surged during the Trump administration. ProPublica documented Saudi government spending at Trump properties while lobbying against the Justice Against Sponsors of Terrorism Act (JASTA, the 9/11 families bill).","aliases":"MBS, Crown Prince Mohammed bin Salman, Mohammed bin Salman Al Saud","metadata":{"birth_date":"1985-08-31","nationality":"Saudi","status":"alive","photo_url":"photos/mohammed_bin_salman.jpg"}},"127":{"id":127,"name":"Mort Zuckerman","entity_type":"person","description":"Mortimer Benjamin 'Mort' Zuckerman (b. 1937). Canadian-American billionaire media mogul and real estate investor whose financial and social relationship with Epstein included co-investing in a magazine and purchasing a newspaper from the Maxwell family estate.\n\nMEDIA AND REAL ESTATE EMPIRE: Co-founder and executive chairman of Boston Properties, one of the largest real estate investment trusts in the US. Acquired The Atlantic (1980) and U.S. News & World Report (1984). Purchased the New York Daily News in 1993.\n\nMAXWELL CONNECTION — DAILY NEWS: Zuckerman purchased the New York Daily News from Maxwell Newspapers Inc. — the company controlled by Robert Maxwell, Ghislaine Maxwell's father and documented Mossad asset. Robert Maxwell had acquired the Daily News from the Tribune Company in March 1991, then drowned under mysterious circumstances in November 1991. The paper filed for bankruptcy in December, and Zuckerman acquired it in 1993. This direct business succession from the Maxwell media empire is noteworthy.\n\nRADAR MAGAZINE — EPSTEIN CO-INVESTMENT: In 2004, Zuckerman and Epstein committed up to $25 million as equal partners to finance Radar, a celebrity and pop culture magazine. The first issue appeared in April 2005. When sexual abuse allegations against Epstein surfaced, Zuckerman rapidly disassociated and shut down the publication approximately 14 months after launch.\n\nEPSTEIN SOCIAL NETWORK: Contributed to Epstein's 2003 birthday book. Attended dinners at Epstein's home. Epstein and Zuckerman communicated regularly and arranged numerous meetings, according to DOJ documents released in 2026.\n\nMEDIA INFLUENCE PRESSURE: According to the 2026 DOJ document release, Epstein leveraged his relationship with Zuckerman to attempt to influence the New York Daily News's coverage of allegations against him after his 2008 conviction. Zuckerman, notably, did not kill the story. However, the attempt to use media ownership relationships to manage coverage is a documented pattern in this network.","aliases":"Mortimer Benjamin Zuckerman","metadata":{"birth_date":"1937-06-04","nationality":"Canadian-American","status":"alive","photo_url":"photos/mort_zuckerman.jpg"}},"88":{"id":88,"name":"Mossad","entity_type":"agency","description":"Israeli intelligence service. Robert Maxwell asset. Epstein identified as co-opted agent. PROMIS distribution.","aliases":"Institute for Intelligence and Special Operations","metadata":{}},"82":{"id":82,"name":"Murder Incorporated","entity_type":"organization","description":"Enforcement arm of the National Crime Syndicate, established by Lucky Luciano and Meyer Lansky in the early 1930s. Operated as a professional assassination service for the Commission. Based in Brooklyn under Albert Anastasia and Louis Buchalter. Responsible for an estimated 400-1,000 contract killings. Members included Frankie Carbo and Bugsy Siegel. Disbanded after informant Abe Reles's suspicious death (fell from a guarded hotel window in 1941).","aliases":"Murder Inc, The Combination","metadata":{}},"86":{"id":86,"name":"NSA","entity_type":"agency","description":"National Security Agency. PROMIS/Systematics connection. Watch list included Church Committee members.","aliases":"National Security Agency","metadata":{}},"207":{"id":207,"name":"NSO Group","entity_type":"organization","description":"NSO Group Technologies (founded 2010, Herzliya, Israel). Private intelligence firm that develops and sells surveillance technology to governments worldwide. Best known for Pegasus, a zero-click spyware capable of compromising any smartphone.\n\nFOUNDERS: Founded by Niv Carmi, Shalev Hulio, and Omri Lavie — all veterans of Unit 8200, Israel's signals intelligence unit. The company represents the most prominent example of the Unit 8200 → private surveillance tech pipeline.\n\nPEGASUS PROJECT (2021): Investigation by Forbidden Stories and 17 media organizations revealed that Pegasus had been used to target at least 50,000 phone numbers belonging to journalists, human rights activists, lawyers, and heads of state in at least 45 countries. Targeted individuals included associates of murdered journalist Jamal Khashoggi — the Washington Post and Citizen Lab confirmed that Khashoggi's inner circle was surveilled via Pegasus before his October 2018 assassination by Saudi operatives.\n\nU.S. GOVERNMENT ACTION: In November 2021, the U.S. Commerce Department added NSO Group to its Entity List (trade blacklist) for engaging in activities 'contrary to the national security or foreign policy interests of the United States.' Apple filed suit against NSO Group the same month. The FBI purchased and tested Pegasus (as reported by the New York Times, 2022) before deciding against operational deployment.\n\nINTELLIGENCE-INDUSTRY NEXUS: NSO Group operates under Israeli Ministry of Defense export licensing. Its sales require government approval, meaning the Israeli state retains veto power over which governments receive the technology. This makes NSO a de facto instrument of Israeli foreign policy — surveillance access as a diplomatic tool. Multiple former senior Israeli intelligence officials have served on NSO's advisory board.\n\nSTRUCTURAL PARALLEL: NSO Group represents the modern evolution of the same intelligence-distribution model documented in the PROMIS affair: Israeli intelligence-connected technology sold to foreign governments, creating surveillance access. PROMIS was backdoored software distributed by Robert Maxwell in the 1980s; Pegasus is zero-click spyware distributed through NSO Group in the 2020s. The pipeline — Unit 8200 training → private company → government-licensed exports — is the institutional successor to LAKAM → Maxwell → PROMIS.","aliases":"NSO Group Technologies, NSO, Q Cyber Technologies","metadata":{"founded":2010,"country":"Israel"}},"149":{"id":149,"name":"Nadia Marcinkova","entity_type":"person","description":"Nadia Marcinkova, now Nadia Marcinko (b. circa 1986, Kosice, Slovakia). Brought to the United States by Jeffrey Epstein as a teenager from Eastern Europe. Named co-conspirator in the 2007 NPA. Later became a licensed pilot and aviation entrepreneur.\n\nORIGIN AND TRAFFICKING: According to Palm Beach police reports and victim depositions, Epstein told associates he had 'purchased' Marcinkova from her family in the former Yugoslavia when she was approximately 15 years old. Epstein described her to at least one victim as his 'sex slave.' Her father, Peter Marcinko, is an architect from Presov, Slovakia. The circumstances of her arrival in the US represent one of the most disturbing documented aspects of Epstein's international trafficking operation.\n\nROLE IN OPERATION: Earliest reports from victims in the 2005-2006 Palm Beach police investigation described Marcinkova as actively involved in sexual abuse, with Epstein often instructing her to participate in acts with recruited victims. Her dual status — simultaneously a trafficking victim and an active participant — illustrates the coercion dynamics of the Epstein operation.\n\nNPA IMMUNITY: Named alongside Sarah Kellen, Lesley Groff, and Adriana Ross as co-conspirators who received immunity in the 2007 Non-Prosecution Agreement. Never charged with any crime.\n\nLATER LIFE: Changed her name to Nadia Marcinko by approximately 2011. Obtained a pilot's license in 2012 and became a commercial pilot and flight instructor. Founded Aviloop, an aviation website. Described in some reporting as having piloted Epstein's aircraft.","aliases":"Nadia Marcinko, Nada Marcinkova","metadata":{"birth_year":1986,"nationality":"Slovak-American","status":"alive","photo_url":"photos/nadia_marcinkova.jpg"}},"138":{"id":138,"name":"Naomi Campbell","entity_type":"person","description":"Naomi Elaine Campbell (b. 1970). British supermodel whose extensive, documented contacts with Jeffrey Epstein and Ghislaine Maxwell span over a decade, including flight logs, emails, and social events — with her name appearing over 300 times in the released Epstein files.\n\nCAREER: Born in Streatham, London. Began modeling at age 15. Became one of the six original supermodels of the late 1980s/early 1990s alongside Cindy Crawford, Linda Evangelista, Christy Turlington, Claudia Schiffer, and Kate Moss. Her career spans four decades of fashion, music, and entertainment.\n\nEPSTEIN CONNECTIONS: Campbell appears in the Lolita Express flight logs four times. She was listed in Epstein's personal contacts ('black book') with five separate phone numbers. Emails show she asked to borrow Epstein's jet, attended multiple Epstein parties, and traveled with him. She reportedly visited Little Saint James island. Introduced to Epstein by her former fiance Flavio Briatore.\n\nMAXWELL RELATIONSHIP: Maintained a friendship with Ghislaine Maxwell independent of Epstein. Epstein files reveal Maxwell offered Campbell 'two playmates' in an email. Campbell attended a dinner at Epstein's New York home four months after his 2008 conviction — a dinner also attended by Prince Andrew. This continued social contact after Epstein's conviction is documented in emails and scheduling records.\n\nPOST-CONVICTION CONTACT: Campbell continued inviting Epstein to parties and events after his 2008 sex crime conviction, demonstrating how Epstein maintained social access to the entertainment elite despite his criminal record. Campbell's lawyer has stated she had no knowledge of Epstein's criminal conduct prior to his 2019 arrest.\n\nCampbell has not been accused of involvement in Epstein's criminal activities.","aliases":"","metadata":{"birth_year":1970,"nationality":"British","status":"alive","photo_url":"photos/naomi_campbell.jpg"}},"202":{"id":202,"name":"Newsnight Interview","entity_type":"event","description":"Prince Andrew Newsnight Interview (November 16, 2019). BBC Newsnight interview conducted by Emily Maitlis with Prince Andrew, Duke of York, regarding his association with Jeffrey Epstein.\n\nKEY CLAIMS: Andrew stated he had 'no recollection' of meeting Virginia Giuffre despite a photograph showing them together. He claimed he could not have been at the Tramp nightclub with Giuffre on the alleged date because he was at a Pizza Express in Woking with his daughter. He described his visit to Epstein's New York mansion in 2010 (after Epstein's conviction) as 'the honourable thing to do' — going to end the friendship in person. He stated he does not sweat due to a medical condition from the Falklands War, contradicting Giuffre's account.\n\nCONSEQUENCES: The interview was widely considered catastrophic for Andrew. Within days, he stepped back from royal duties. He was subsequently stripped of military titles and royal patronages (January 2022). Virginia Giuffre filed civil suit (August 2021), which Andrew settled for a reported £12 million in February 2022 without admitting liability.\n\nThe interview represents the moment the UK establishment's Epstein connection became undeniable to the British public — the first time a senior royal was forced to publicly account for association with a convicted sex trafficker.","aliases":"Andrew Newsnight Interview, Pizza Express Interview","metadata":{}},"41":{"id":41,"name":"Nicky Scarfo","entity_type":"person","description":"Nicodemo Domenico Scarfo Sr. (1929-2017). 'Little Nicky.' Boss of the Philadelphia crime family from 1981 to 1991, succeeding Angelo Bruno after the bloody succession war. Unlike Bruno's restraint, Scarfo ruled through terror — responsibility for over 30 murders during his reign. Controlled Atlantic City construction through Scarf Inc. Kenneth Shapiro served as his financial advisor and front man for casino-area land deals, including properties sold to Donald Trump for casino development. Salvatore Testa, 'The Crown Prince,' also sold land to Trump's casino operations before Scarfo had him murdered. Convicted of first-degree murder, racketeering, and extortion in 1988. Died in federal prison in 2017.","aliases":"Little Nicky, Nicodemo Scarfo","metadata":{"photo_url":"photos/scarfo.jpg","birth_date":"1929-03-08","death_date":"2017-01-13","nationality":"American","status":"deceased"}},"151":{"id":151,"name":"Nicole Junkermann","entity_type":"person","description":"Nicole Junkermann (b. 1975, Dusseldorf, Germany). Entrepreneur, venture capitalist, and investor whose business activities intersect the Epstein network, Israeli intelligence-linked technology, and government health advisory roles.\n\nINVESTMENT CAREER: Founder and chair of NJF Holdings (established 2012), a private investment group with venture capital, private equity, and real estate arms focused on health technology, deep tech, and human performance.\n\nEPSTEIN CONNECTION: Junkermann's name appears in Epstein's flight logs as early as 2002, documenting approximately 13 flights on his private aircraft. Released Epstein files revealed intensive contact between Junkermann and Epstein involving thousands of emails encompassing both business and private matters from 2009 through 2019 — continuing well after his 2008 conviction. She is mentioned more than 3,000 times in the Epstein case files.\n\nCARBYNE AND ISRAELI TECH: In 2016, both Epstein and Junkermann invested in Carbyne, the Israeli emergency call-handling technology company co-founded by former Israeli PM Ehud Barak. Epstein invested $1 million through his BVI-registered Southern Trust; Junkermann's Montilla International contributed $500,000. Junkermann joined Carbyne's board in 2017, serving alongside Barak and former Unit 8200 director Pinhas Buchris. Carbyne's board composition — connecting Epstein money, Israeli intelligence leadership, and surveillance technology — is structurally significant.\n\nUK GOVERNMENT ADVISORY ROLE: Appointed to the HealthTech Advisory Board of the UK Department of Health and Social Care in November 2018 by Health Secretary Matt Hancock, advising on technology transformation of the NHS. This appointment placed a figure with documented Epstein financial connections in a health data advisory role.\n\nLEGAL ACTIONS: Junkermann has pursued legal action against journalists and publications investigating her Epstein connections, including the removal of four Epstein-related articles from Substack in 2025.","aliases":"","metadata":{"birth_year":1975,"nationality":"German","status":"alive","photo_url":"photos/nicole_junkermann.jpg"}},"254":{"id":254,"name":"Oliver North","entity_type":"person","description":"U.S. Marine Lt. Colonel and National Security Council staff member under Reagan. Primary operational coordinator of the Iran-Contra affair — directed the White House covert Contra resupply program from the NSC.\n\nDeclassified notebooks (2,000 pages, released May 1990 after FOIA lawsuit by National Security Archive) contain entries noting awareness of drug connections: one entry notes a DC-4 acquired through 'Foley' was 'used at one time to run drugs, and part of the crew had criminal records.' The plane belonged to Miami company Vortex, run by Michael Palmer, one of the largest marijuana traffickers in the U.S. Palmer received over $300,000 from the Nicaraguan Humanitarian Aid Office (NHAO) for Contra supply flights.\n\nIn 1984, intervened to get Honduran General Jose Bueso Rosa a reduced sentence to protect the Contra program — Bueso Rosa had plotted to assassinate the Honduran president and fund it with proceeds from 760 pounds of cocaine.\n\nTelevised congressional testimony July 7-14, 1987. Convicted of aiding obstruction of Congress, accepting illegal gratuity, and altering/destroying documents. Conviction reversed on appeal (tainted by immunized testimony).","aliases":"","metadata":{"photo_url":"photos/oliver-north.jpg"}},"263":{"id":263,"name":"Operation Condor","entity_type":"program","description":"Formal system to coordinate repression among Southern Cone countries: Argentina, Uruguay, Chile, Paraguay, Bolivia, Brazil. Active mid-1970s to early 1980s.\n\nU.S. support documented: Washington provided military intelligence, training, financial assistance, advanced computers, tracking technology, and access to a continental telecommunications system ('Condortel') housed in the Panama Canal Zone. CIA provided computers for storing databanks of thousands of politically suspect individuals.\n\nAt least 654 documented victims of transnational kidnapping, torture, and disappearance between 1976-1980. Declassified 2001 State Department document confirmed U.S. facilitated communications for Condor. Kissinger was Secretary of State during its establishment; declassified documents show Nixon/Kissinger awareness and support.\n\nPlans were developed at the U.S. Army School of the Americas. Chile under Pinochet was a founding member and key coordinator.","aliases":"","metadata":{}},"97":{"id":97,"name":"Operation Midnight Climax","entity_type":"program","description":"CIA operation: safe houses where targets given LSD, filmed during sexual acts through two-way mirrors. TSD operated.","aliases":"","metadata":{}},"91":{"id":91,"name":"PROMIS","entity_type":"program","description":"Prosecutor's Management Information System. Stolen from INSLAW by DOJ. Backdoored by Israeli intelligence. Sold worldwide via Robert Maxwell.","aliases":"Prosecutor's Management Information System","metadata":{}},"59":{"id":59,"name":"Palantir Technologies","entity_type":"organization","description":"Data analytics firm co-founded by Peter Thiel. Major CIA/NSA/military contractor. Successor to TIA capabilities.","aliases":"Palantir","metadata":{}},"35":{"id":35,"name":"Paul Castellano","entity_type":"person","description":"Paul Castellano (1915-1985). Boss of the Gambino crime family. Jointly controlled S&A Concrete with Fat Tony Salerno (Genovese family), providing concrete for major Manhattan construction projects including Trump Tower. Roy Cohn represented both Castellano and Salerno. Assassinated outside Sparks Steak House in Manhattan on December 16, 1985, in a hit ordered by John Gotti, who succeeded him as Gambino boss.","aliases":"Big Paul","metadata":{"photo_url":"photos/castellano.jpg","birth_date":"1915-06-26","death_date":"1985-12-16","nationality":"American","status":"deceased"}},"195":{"id":195,"name":"Pergamon Press","entity_type":"organization","description":"Pergamon Press. Scientific publishing house founded by Robert Maxwell in 1951. Published hundreds of academic journals and became one of the world's largest scientific publishers before being sold to Elsevier in 1991.\n\nINTELLIGENCE COVER: Multiple investigative accounts (Gordon Thomas, John Preston) document that Pergamon Press served as cover for Robert Maxwell's intelligence activities. The publishing business provided Maxwell with legitimate reasons to travel across the Eastern Bloc, meet with Soviet scientists, and access institutions that would otherwise be suspicious. Maxwell used Pergamon's relationships with Soviet scientific institutions as a channel for both MI6 and Mossad intelligence gathering.\n\nFINANCIAL MANIPULATION: Maxwell used Pergamon in a 1969 share price manipulation scheme, leading to a Department of Trade and Industry investigation that concluded Maxwell was 'not in our opinion a person who can be relied on to exercise proper stewardship of a publicly quoted company.' He was stripped of the company but regained control in 1974.\n\nRepresents the intelligence-publishing nexus — media enterprises as cover for intelligence operations, a pattern that extends to Maxwell's later Mirror Group Newspapers and, in a different form, Hollinger International under Conrad Black.","aliases":"Pergamon","metadata":{}},"189":{"id":189,"name":"Peter Mandelson","entity_type":"person","description":"Peter Benjamin Mandelson, Baron Mandelson (born 1953). British Labour politician, First Secretary of State (2010), Secretary of State for Business (2008-2010), European Commissioner for Trade (2004-2008), Secretary of State for Northern Ireland (1999-2001), Secretary of State for Trade and Industry (1998). One of the architects of New Labour alongside Tony Blair and Gordon Brown.\n\nEPSTEIN RELATIONSHIP: Documented as one of Epstein's closest UK political associates. Flight logs show Mandelson flew on Epstein's private jet (the 'Lolita Express') at least four times. Bloomberg (2025) reported emails showing Mandelson expressed support for Epstein and maintained the relationship after Epstein's 2008 conviction. Mandelson was photographed at Epstein's New York mansion.\n\nCHINA NEXUS: The Bureau of Investigative Journalism (2025) documented that Mandelson introduced Desmond Shum (Chinese billionaire with CCP connections) to Epstein in February 2010. In September 2010, Mandelson asked Epstein to 'nurture' his relationship with Shum. This provided Epstein access to China's military-intelligence complex through CITIC Group connections. Mandelson also wrote to Epstein about JPMorgan's China strategy.\n\nPATTERN: Mandelson represents the UK political establishment's documented intersection with the Epstein network — serving as bridge between Epstein, UK government, EU trade policy, and Chinese political-financial elites. His continued association with Epstein after the 2008 conviction mirrors the pattern documented across the network.","aliases":"Lord Mandelson, Baron Mandelson, Mandy","metadata":{"photo_url":"photos/peter_mandelson.jpg"}},"6":{"id":6,"name":"Peter Thiel","entity_type":"person","description":"Peter Andreas Thiel (b. 1967). Venture capitalist, technology entrepreneur, and political operative who bridges Silicon Valley, the intelligence community, and conservative politics.\n\nPAYPAL: Co-founded PayPal in 1998, creating one of the first major digital payment platforms. The 'PayPal Mafia' — Thiel, Elon Musk, Reid Hoffman, and others — went on to shape Silicon Valley's trajectory.\n\nPALANTIR TECHNOLOGIES: Co-founded Palantir in 2003 with Alex Karp and others. The company received early seed funding from In-Q-Tel, the CIA's venture capital arm. Palantir became a primary data analytics contractor for the CIA, NSA, FBI, and military. Researchers have documented Palantir as the private-sector successor to DARPA's Total Information Awareness program, which Congress defunded in 2003 after public outcry over mass surveillance. The capabilities Congress rejected were rebuilt in the private sector with intelligence community backing.\n\nFACEBOOK INVESTMENT: Made a $500,000 angel investment in Facebook in 2004, becoming the company's first outside investor and joining its board. DARPA's LifeLog program — designed to build a database of a person's entire existence — was cancelled February 4, 2004, the same day Facebook launched. Thiel's simultaneous involvement with CIA-funded Palantir and the world's largest personal data collection platform is structurally significant.\n\nSURVEILLANCE INFRASTRUCTURE: Through Palantir, Thiel built the analytical layer of the modern surveillance state. Palantir's software integrates data from multiple intelligence sources, enabling pattern analysis across communications, financial records, travel data, and social networks at scale.\n\nPOLITICAL INFLUENCE: Bilderberg Group steering committee member. Major Republican donor. Backed Trump's 2016 campaign. Funded the Hogan v. Gawker lawsuit that destroyed Gawker Media — demonstrating willingness to use financial power to eliminate critical press.","aliases":"","metadata":{"photo_url":"photos/thiel.jpg","birth_date":"1967-10-11","nationality":"American","status":"alive"}},"81":{"id":81,"name":"Philadelphia Crime Family","entity_type":"organization","description":"Also known as the Bruno-Scarfo family. Controlled organized crime in the greater Philadelphia area and South Jersey. Successive bosses: Angelo Bruno (1959-1980), Phil Testa (1980-1981), Nicky Scarfo (1981-1991), John Stanfa (1991-1994), Ralph Natale (1994-1999), Joey Merlino (1999-present). The bloodiest succession in Mafia history — Bruno's assassination triggered a war claiming 20+ lives. Critical to Atlantic City casino development and Trump's entry into the casino business.","aliases":"Bruno-Scarfo Family, Philly Mob","metadata":{}},"250":{"id":250,"name":"Philippa Sigl-Glöckner","entity_type":"person","description":"German economist and founder of think tank 'Dezernat Zukunft.' Served as private secretary to Chancellor Olaf Scholz from May 2019 to November 2020, during his tenure as Finance Minister.\n\nNamed in the 2026 DOJ Epstein files release. Documents show she passed information about African telecommunications to Epstein. A redacted message in the files describes her background: 'completed her master's degree in computer science, joined the super-elite German intelligence service, and was assigned to the ministry of finance to track money flows.'\n\nGerman opposition politicians have demanded a government probe. Green Party deputy leader Konstantin von Notz demanded systematic evaluation of the files. SPD domestic policy spokesman Sebastian Fiedler cited concern about 'possible European intelligence dimensions.'","aliases":"Philippa Sigl-Glockner","metadata":{}},"108":{"id":108,"name":"Prince Andrew","entity_type":"person","description":"Andrew Albert Christian Edward Mountbatten-Windsor (born 1960), formerly styled Prince Andrew, Duke of York. Third child and second son of Queen Elizabeth II. Served in the Royal Navy 1979-2001, including as a helicopter pilot during the Falklands War.\n\nEPSTEIN CONNECTION: Andrew stated he met Epstein in 1999 through Ghislaine Maxwell, with whom he had a longstanding friendship (and reportedly an intermittent romantic relationship) dating to her Oxford years. Flight logs place Andrew on Epstein's aircraft. He visited Epstein's Manhattan residence, was photographed at Epstein's New York home in 2010 (after Epstein's 2008 conviction), and attended events at Epstein's properties. Epstein and Maxwell attended Andrew's 40th birthday party at Windsor Castle in 2000.\n\nGIUFFRE ALLEGATIONS: Virginia Giuffre alleged she was trafficked to Andrew on three occasions beginning in 2001 when she was 17 — in London (Maxwell's townhouse), New York, and on Little Saint James. A photograph shows Andrew with his arm around Giuffre's waist at Maxwell's London residence. An email from Maxwell to Epstein appeared to confirm the photo's authenticity. In the November 2019 BBC Newsnight interview, Andrew claimed he had no recollection of meeting Giuffre and offered widely discredited alibis (a Pizza Express visit in Woking, an inability to sweat).\n\nLEGAL & ROYAL CONSEQUENCES: Giuffre filed civil suit in August 2021 (SDNY). Andrew settled in February 2022 for an undisclosed sum (reported estimates range from 3M-12M GBP) with no admission of liability. He was stripped of military affiliations and royal patronages by Queen Elizabeth in January 2022. In October 2025, King Charles III stripped him of all remaining titles including Duke of York and the style 'Prince.' In February 2026, he was arrested on suspicion of misconduct in public office in connection with his Epstein ties.","aliases":"Andrew Mountbatten-Windsor, Duke of York","metadata":{"birth_date":"1960-02-19","nationality":"British","status":"alive","photo_url":"photos/prince_andrew.jpg"}},"117":{"id":117,"name":"Prince Andrew Civil Settlement (2022)","entity_type":"event","description":"On February 15, 2022, Prince Andrew and Virginia Giuffre reached an out-of-court settlement in the civil lawsuit (Giuffre v. Prince Andrew, SDNY) that had accused Andrew of sexually abusing Giuffre when she was a minor. The financial terms were undisclosed, with media estimates ranging from 3M to 12M GBP. Andrew made no admission of liability but acknowledged 'that Jeffrey Epstein trafficked countless young girls over many years' and stated he 'regrets his association with Epstein.' Andrew also pledged a 'substantial donation' to Giuffre's charity for victims' rights. In January 2022, Queen Elizabeth had stripped Andrew of military affiliations and royal patronages. The settlement effectively ended the civil proceedings but did not prevent the later criminal investigation.","aliases":"Giuffre v. Prince Andrew Settlement","metadata":{"date":"2022-02-15"}},"176":{"id":176,"name":"Prince Bandar bin Sultan","entity_type":"person","description":"Prince Bandar bin Sultan Al Saud (born 1949). Saudi Ambassador to the United States (1983-2005), the longest-serving Saudi ambassador to Washington. Known as 'Bandar Bush' for his extraordinarily close personal relationship with the Bush family — particularly George H.W. Bush and George W. Bush. Secretary-General of the Saudi National Security Council (2005-2015).\n\nIRAN-CONTRA: Bandar was a key Saudi conduit during the Iran-Contra affair. Congressional investigation documented that Saudi Arabia contributed $32 million to the Nicaraguan Contras through accounts controlled by Bandar, at the request of the Reagan-Bush White House. Tower Commission and Iran-Contra Report confirm Saudi financial involvement channeled through Bandar's office.\n\n9/11 — THE 28 PAGES: The declassified 28 pages of the Joint Inquiry (2002, released 2016) identified that Bandar's wife, Princess Haifa al-Faisal, sent regular payments to the wife of Osama Basnan, who provided financial support to two of the 9/11 hijackers (Nawaf al-Hazmi and Khalid al-Mihdhar) in San Diego. Bandar denied knowledge. The FBI investigated but no charges were filed.\n\nINTELLIGENCE ROLE: Bandar operated as de facto Saudi intelligence liaison to the CIA for over two decades. Steve Coll's Ghost Wars documents his central role in coordinating Saudi-CIA covert operations in Afghanistan during the anti-Soviet jihad. He personally negotiated the largest arms deal in history (Al-Yamamah, with UK).\n\nBUSH FAMILY: Relationship documented at extraordinary depth — overnight stays at the Bush family home in Kennebunkport, private White House meetings, joint Thanksgiving dinners. Craig Unger's House of Bush, House of Saud documents the personal and financial ties.","aliases":"Bandar Bush, Bandar bin Sultan Al Saud","metadata":{"birth_date":"1949-03-02","nationality":"Saudi","status":"alive","photo_url":"photos/bandar_bin_sultan.jpg"}},"188":{"id":188,"name":"Prince Mohammed bin Fahd","entity_type":"person","description":"Prince Mohammed bin Fahd Al Saud (born 1950). Son of King Fahd (ruled Saudi Arabia 1982-2005). Governor of the Eastern Province of Saudi Arabia (1985-2013). One of the wealthiest Saudi royals.\n\nBCCI CONNECTION: The Kerry/Brown Senate BCCI Report (1992) documented that Prince Mohammed bin Fahd had accounts at BCCI and was connected to BCCI's operations in Saudi Arabia. The Prince's financial advisor, Ghaith Pharaon (a BCCI front-man), was one of the key figures in the BCCI scandal.\n\nFINANCIAL NETWORK: Prince Mohammed controlled significant Saudi government contracts through the Eastern Province (the oil-producing region). His financial network intersected with BCCI's Gulf operations and the broader Saudi royal financial architecture that fed into Western investment vehicles including the Carlyle Group.","aliases":"Mohammed bin Fahd Al Saud","metadata":{"birth_date":"1950-01-01","nationality":"Saudi","status":"alive","photo_url":"photos/mohammed_bin_fahd.jpg"}},"177":{"id":177,"name":"Prince Turki al-Faisal","entity_type":"person","description":"Prince Turki al-Faisal Al Saud (born 1945). Director-General of the Saudi General Intelligence Directorate (GID) from 1979 to August 2001 — resigned just 10 days before 9/11. Saudi Ambassador to the UK (2003-2005) and to the US (2005-2007).\n\nINTELLIGENCE CAREER: As GID chief for 22 years, Turki was Saudi Arabia's primary intelligence interlocutor with the CIA. Oversaw Saudi intelligence operations during the Afghan-Soviet war, including the channeling of billions in Saudi funds to the Afghan mujahideen alongside CIA money. Steve Coll's Ghost Wars documents his direct meetings with Osama bin Laden during this period.\n\nBIN LADEN CONNECTION: Turki personally met with bin Laden multiple times during the 1980s Afghan jihad when bin Laden was coordinating Arab volunteer fighters. The relationship soured after the Gulf War (1990-91) when bin Laden offered to defend Saudi Arabia instead of accepting US troops. Turki has acknowledged these meetings publicly.\n\nSAFARI CLUB LEGACY: Though Turki took over GID after the Safari Club's primary operational period, he inherited and continued the Saudi-CIA covert cooperation framework that Kamal Adham (his predecessor and uncle by marriage) established through the Safari Club.\n\n9/11 TIMING: His resignation on August 31, 2001 — 11 days before September 11 — has been the subject of extensive scrutiny. He has said the resignation was planned and unrelated.","aliases":"Turki al-Faisal Al Saud, Turki al-Faisal bin Abdulaziz Al Saud","metadata":{"birth_date":"1945-02-15","nationality":"Saudi","status":"alive","photo_url":"photos/turki_al_faisal.jpg"}},"233":{"id":233,"name":"Project 2025","entity_type":"event","description":"Heritage Foundation's 'Mandate for Leadership 7: The Conservative Promise' — a 900-page policy blueprint for the Trump administration, published 2023. Edwin Fuelner launched it at Heritage, explicitly connecting it to the original 1981 Mandate that shaped the Reagan administration. Heritage board ~25% Bohemian Club members during its drafting. Fuelner attended the 2023 Bohemian Grove encampment the same summer.","aliases":"","metadata":{}},"53":{"id":53,"name":"Rafi Eitan","entity_type":"person","description":"Rafael 'Rafi' Eitan (1926-2019). Legendary Israeli intelligence operative. Led the team that captured Adolf Eichmann in Buenos Aires (1960). Ran Jonathan Pollard as a spy inside the US Navy (1984-85). Worked directly with Meyer Lansky on arms smuggling for the Haganah (pre-IDF) using waterfront access provided by Albert Anastasia's longshoremen. Connected to Robert Maxwell's PROMIS distribution network. Served as a bridge between Lansky's organized crime-intelligence nexus and Israeli intelligence operations — the same structural pipeline that later connected through Maxwell to Epstein. Served in the Israeli Knesset 2006-2009. Died March 2019.","aliases":"Rafael Eitan","metadata":{"photo_url":"photos/rafi_eitan.jpg","birth_date":"1926-11-23","death_date":"2019-03-23","nationality":"Israeli","status":"deceased"}},"74":{"id":74,"name":"Resorts International","entity_type":"organization","description":"Resorts International. Casino and resort company with documented intelligence community connections. Founded by James Crosby, who established Intertel (International Intelligence Inc.) as its security arm — staffed by former FBI, CIA, and NSA personnel. Historical connections to Meyer Lansky's gambling operations in the Bahamas. Purchased by Donald Trump in 1987, later reorganized as Trump Taj Mahal. The CIA/Intertel connection made Resorts one of the documented intersections between intelligence operations and the casino industry.","aliases":"","metadata":{}},"28":{"id":28,"name":"Richard Helms","entity_type":"person","description":"CIA Director. Ordered MKULTRA files destroyed 1973. Drafted legal language protecting BCCI front-men despite later denials.","aliases":"","metadata":{"photo_url":"photos/helms.jpg","birth_date":"1913-03-30","death_date":"2002-10-22","nationality":"American","status":"deceased"}},"12":{"id":12,"name":"Robert Keith Gray","entity_type":"person","description":"Hill & Knowlton CEO. CIA blackmail specialist per DeCamp. George Town Club president. Reagan deputy comms under Casey.","aliases":"","metadata":{"photo_url":"photos/robert_keith_gray.jpg"}},"52":{"id":52,"name":"Robert LiButti","entity_type":"person","description":"Robert LiButti. High-rolling gambler and Gambino crime family associate. FBI wiretap recordings captured LiButti referring to John Gotti as 'my boss.' Lost $12 million gambling at Trump casinos. Trump Plaza was fined $450,000 by the NJ Casino Control Commission for funneling $1.65 million in luxury cars and gifts to LiButti, and $200,000 for removing Black and female dealers from his table at his demand — a documented pattern of Trump casino management accommodating mob-connected gamblers.","aliases":"","metadata":{"nationality":"American","status":"deceased","photo_url":"photos/robert_libutti.jpg"}},"3":{"id":3,"name":"Robert Maxwell","entity_type":"person","description":"Media mogul, Mossad asset. Sold PROMIS software backdoored by Israeli intelligence to governments worldwide. Died 1991.","aliases":"Jan Ludvik Hoch","metadata":{"photo_url":"photos/robert_maxwell.jpg","birth_date":"1923-06-10","death_date":"1991-11-05","nationality":"British","status":"deceased"}},"104":{"id":104,"name":"Robert Maxwell Death (1991)","entity_type":"event","description":"Found dead off his yacht Nov 5, 1991. Israeli state funeral. BCCI connection. PROMIS distribution halted.","aliases":"","metadata":{}},"121":{"id":121,"name":"Ronald Lauder","entity_type":"person","description":"Ronald Steven Lauder (b. 1944). Estee Lauder heir, Mega Group member, World Jewish Congress president, and a figure at the intersection of US defense policy, Israeli intelligence infrastructure, and conservative politics.\n\nDEFENSE AND DIPLOMATIC CAREER: Served as Deputy Assistant Secretary of Defense for European and NATO policy (1983-1986) under Reagan. During this Pentagon tenure, Lauder became deeply involved in Israeli politics and formed an alliance with Benjamin Netanyahu, then Israel's UN representative. Appointed US Ambassador to Austria (1986-1987) by Reagan.\n\nAUSTRIAN PASSPORT QUESTION: When Jeffrey Epstein was arrested in 2019, an Austrian passport with a fake name was found in his Manhattan safe. Lauder served as US Ambassador to Austria during the period the passport was reportedly issued. Investigative journalists have noted the timing and Lauder's position, though no official document has confirmed Lauder's involvement in obtaining the passport. This remains at the inference tier.\n\nNETANYAHU ALLIANCE: One of the most important individuals in Netanyahu's rise to power, particularly during his upset 1996 election victory. Major financier of Israel's right-wing Likud Party. This relationship places Lauder at the center of the US-Israel political pipeline.\n\nWORLD JEWISH CONGRESS: Succeeded Edgar Bronfman Sr. as WJC president in 2007 — inheriting the same institutional platform that connects to the Mega Group network.\n\nINTELLIGENCE INFRASTRUCTURE: Long-time funder of IDC Herzliya (Reichman University), an Israeli university closely associated with Mossad recruitment and intelligence research. Also founded the Neue Galerie in New York (2001), dedicated to German and Austrian art.\n\nMEGA GROUP: Member of the Mega Group alongside Wexner, the Bronfmans, Steinhardt, and others. His combination of Pentagon experience, Austrian diplomatic posting, Israeli intelligence connections, and Mega Group membership makes Lauder a key connector between US defense policy and the Israeli intelligence-philanthropy nexus.","aliases":"Ronald Steven Lauder","metadata":{"birth_date":"1944-02-26","nationality":"American","status":"alive","photo_url":"photos/ronald_lauder.jpg"}},"211":{"id":211,"name":"Ronald Reagan","entity_type":"person","description":"40th President of the United States (1981-89). Bohemian Club member — Social Security reform planned at the Grove per Reagan Library memo from Edwin Harper to Alan Greenspan. Implemented Heritage Foundation's first Mandate for Leadership. Capital gains tax cut persuaded at the Grove by investor Bill Draper. Beloved the Grove — sent letters about it from the White House.","aliases":"","metadata":{"photo_url":"photos/ronald_reagan.jpg"}},"62":{"id":62,"name":"Rose Law Firm","entity_type":"organization","description":"Arkansas law firm (Hillary Clinton partner). Represented Systematics AND assisted BCCI's US entry.","aliases":"","metadata":{}},"246":{"id":246,"name":"Rosemary Vrablic","entity_type":"person","description":"Managing Director and Senior Private Banker at Deutsche Bank's U.S. Private Wealth Management division. She was Donald Trump's personal banker at Deutsche Bank — worked in the same wealth management division that handled both Trump/Kushner and Epstein accounts.\n\nResigned from Deutsche Bank in December 2020 amid an internal investigation. Revealed in February 2021 that DB forced her out over a conflict of interest: she purchased a $1.5 million apartment in 2013 from Bergel 715 Associates, an entity in which Jared Kushner held an ownership stake, while Kushner was her client. She also formed an 'unapproved outside entity' to hold the investment.","aliases":"","metadata":{}},"11":{"id":11,"name":"Roy Cohn","entity_type":"person","description":"Roy Marcus Cohn (1927-1986). Attorney, political fixer, and sexual blackmail operator who served as a nexus between organized crime, intelligence agencies, and political power for three decades.\n\nMCCARTHY ERA: Chief counsel to Senator Joseph McCarthy's investigations. Prosecuted Julius and Ethel Rosenberg (executed 1953). Used his anti-communist credentials to build a network spanning law, politics, organized crime, and intelligence.\n\nORGANIZED CRIME: Attorney for Fat Tony Salerno (Genovese family boss) and Paul Castellano (Gambino family boss). Through these clients, Cohn connected Donald Trump to the construction industry's mob-controlled concrete supply. S&A Concrete — a joint Genovese-Gambino venture run by Salerno and Castellano — provided concrete for Trump Tower. NJ Casino Control Commission records document Trump's organized crime associations through Cohn.\n\nTRUMP MENTORSHIP (1973-1986): Became Donald Trump's attorney and mentor in 1973, when Trump retained Cohn to fight federal housing discrimination charges. For 13 years, Cohn served as Trump's fixer, teaching him tactics of aggressive denial, counterattack, and media manipulation. Cohn connected Trump to New York's political and social elite, mob figures, and intelligence-adjacent networks.\n\nSEXUAL BLACKMAIL OPERATIONS: Ran sexual blackmail operations in coordination with J. Edgar Hoover and CIA Director William Casey, with whom he had daily phone calls. Cohn's blackmail network operated through parties at his townhouse and at Studio 54, where compromising situations were arranged and documented. This continued the Hoover-Lansky tradition of sexual compromise as a control mechanism.\n\nINTELLIGENCE CONNECTIONS: Maintained daily phone contact with CIA Director William Casey. This direct line between a mob-connected political fixer and the CIA Director illustrates the integration of organized crime, intelligence, and political power that characterizes this network.\n\nDEATH: Disbarred in 1986 for ethical violations. Died of AIDS complications in August 1986 while publicly denying his diagnosis and his homosexuality.","aliases":"","metadata":{"photo_url":"photos/cohn.jpg","birth_date":"1927-02-20","death_date":"1986-08-02","nationality":"American","status":"deceased"}},"113":{"id":113,"name":"Rudy Giuliani","entity_type":"person","description":"Rudolph William Louis Giuliani (born 1944). Former U.S. Attorney for the Southern District of New York (1983-1989) and Mayor of New York City (1994-2001). Known as 'America's Mayor' after 9/11. Later served as Donald Trump's personal attorney (2018-2023).\n\nCOMMISSION TRIAL — DESTROYING THE ITALIAN MOB: As SDNY U.S. Attorney, Giuliani led the landmark 1985-1986 Mafia Commission Trial (US v. Salerno et al.), using RICO to convict the bosses of all Five Families of the New York Mafia. Eight defendants received sentences up to 100 years. This prosecution effectively decapitated the Italian-American organized crime structure in New York. Giuliani also successfully prosecuted Stanley Friedman, a close associate of attorney Roy Cohn and client of Cohn's law firm.\n\nSTRUCTURAL OBSERVATION: Giuliani's prosecutions devastated the Italian Mafia but created a vacuum that was filled by Russian/Israeli organized crime networks during the 1990s — the same networks later connected to figures like Felix Sater and Bayrock Group, which operated out of Trump Tower. This pattern — the selective destruction of one crime network enabling another — is noted by organized crime historians, though whether this was intentional or incidental remains debated.\n\nTRUMP ORBIT: After decades in public life, Giuliani became Trump's personal attorney, defending him during the Mueller investigation and the first impeachment. His firm Bracewell & Giuliani had business connections to Kazakhstan, overlapping with Bayrock Group's network. In 2023, Giuliani was himself indicted under Georgia's RICO statute for efforts to overturn the 2020 election — the same legal tool he had pioneered against the mob. He does not appear in Epstein's flight logs or contacts.","aliases":"Rudolph William Louis Giuliani, America's Mayor","metadata":{"birth_date":"1944-05-28","nationality":"American","status":"alive","photo_url":"photos/rudy_giuliani.jpg"}},"84":{"id":84,"name":"S&A Concrete","entity_type":"organization","description":"S&A Concrete. Joint Genovese-Gambino crime family concrete company controlled by Fat Tony Salerno and Paul Castellano. Held a monopoly on concrete deliveries for any Manhattan construction project over $2 million during the 1980s — the 'Concrete Club.' Provided concrete for Trump Tower, Trump Plaza, and other major developments. Roy Cohn represented both family bosses. The concrete racket was a documented intersection of organized crime and the New York real estate industry.","aliases":"Concrete Club","metadata":{}},"261":{"id":261,"name":"SETCO Aviation","entity_type":"organization","description":"Aviation company based in Honduras. Founded by Honduran drug lord Juan Matta Ballesteros — a 1983 U.S. Customs Investigative Report stated: 'SETCO Aviation is a corporation formed by American businessmen who are dealing with Juan Matta Ballesteros and are smuggling narcotics into the United States.'\n\nBeginning in 1984, SETCO was the principal company used by the Contras in Honduras to transport supplies and personnel for the FDN (Fuerza Democratica Nicaraguense). Simultaneously transported cocaine to the U.S. from Honduras.\n\nMatta Ballesteros was classified by the DEA as a 'Class I DEA violator' — identified in 1985 as responsible for 'perhaps a third, perhaps more than half' of all cocaine moving from Colombia to the United States. He was also involved in the 1985 murder of DEA agent Enrique Camarena. When the local DEA office moved against Matta in 1983, 'it was shut down.'\n\nNamed in both the Kerry Committee Report and CIA Inspector General Report as the key example of drug trafficker-Contra symbiosis.","aliases":"","metadata":{}},"186":{"id":186,"name":"Safari Club","entity_type":"organization","description":"The Safari Club (1976-early 1980s). An informal, secret alliance of intelligence agencies formed after the Church Committee hearings (1975) severely curtailed CIA covert operations. Named after the Safari Club resort in Kenya where early meetings were held.\n\nMEMBERS: French SDECE (led by Alexandre de Marenches, who proposed the alliance), Saudi GID (Kamal Adham), Egyptian General Intelligence (Kamal Hassan Ali), Moroccan intelligence (Ahmed Dlimi), and Iranian SAVAK (pre-1979 revolution). The CIA maintained liaison through unofficial channels while officially constrained by Congressional oversight.\n\nBCCI AS FINANCIAL BACKBONE: The Safari Club used BCCI as its financial infrastructure — the same bank founded by Agha Hasan Abedi, whose lead shareholder and front-man was Kamal Adham (simultaneously the CIA's principal Middle East liaison). This created a self-referential intelligence-banking loop: the CIA's preferred Arab intelligence partner was also running the CIA's preferred criminal bank.\n\nSIGNIFICANCE: The Safari Club represents the institutional origin of CIA outsourcing to Saudi and Gulf intelligence services. When Congress restricted the CIA, the agency didn't stop operating — it outsourced to allied intelligence services funded by Saudi money and banked through BCCI. This pattern — using foreign intelligence services and private financial networks to circumvent Congressional oversight — became the template for Iran-Contra and subsequent operations. Joseph Trento's Prelude to Terror provides the most detailed documented account.","aliases":"The Safari Club","metadata":{}},"51":{"id":51,"name":"Salvatore Testa","entity_type":"person","description":"Salvatore Testa (1956-1984). 'The Crown Prince of the Mob.' Son of Philip 'Chicken Man' Testa, who briefly succeeded Angelo Bruno as Philadelphia boss before being killed by a nail bomb in 1981. Salvatore was a feared enforcer under Nicky Scarfo. Sold land used for Donald Trump's Atlantic City casino development. Murdered on Scarfo's orders in 1984 at age 28 — Scarfo feared Testa's growing power and popularity.","aliases":"The Crown Prince","metadata":{"birth_date":"1956-04-11","death_date":"1984-09-14","nationality":"American","status":"deceased","photo_url":"photos/salvatore_testa.jpg"}},"47":{"id":47,"name":"Sammy Gravano","entity_type":"person","description":"Salvatore 'Sammy the Bull' Gravano (b. 1945). Gambino family underboss under John Gotti. The highest-ranking member of the American Mafia to turn government witness. Admitted to involvement in 19 murders. His 1991 decision to cooperate with the FBI provided devastating testimony that convicted Gotti on June 23, 1992. Entered witness protection but was expelled after being caught running an ecstasy ring in Arizona. His testimony marked the symbolic end of the Mafia's ability to maintain omerta. Lives in Arizona under his own name after serving his drug sentence.","aliases":"Sammy the Bull","metadata":{"photo_url":"photos/gravano.jpg","birth_date":"1945-03-12","nationality":"American","status":"alive"}},"114":{"id":114,"name":"Sandy Berger","entity_type":"person","description":"Samuel Richard 'Sandy' Berger (1945-2015). Democratic attorney and political operative who served as Deputy National Security Advisor (1993-1997) and National Security Advisor (1997-2001) under President Clinton. Born in Millerton, New York. Cornell University BA (1967), Harvard Law JD (1971). Co-founded the Albright Stonebridge Group in 2001.\n\nNATIONAL ARCHIVES THEFT: In 2003, while preparing to testify before the 9/11 Commission on behalf of the Clinton administration, Berger was caught removing classified documents from a National Archives reading room — physically stuffing papers into his pants and socks. The stolen materials were five copies of a single report by Richard Clarke assessing the Clinton administration's handling of the 2000 millennium bomb plot. Berger destroyed three copies by cutting them with scissors and placing them in trash.\n\nLEGAL CONSEQUENCES: In April 2005, Berger pleaded guilty to a misdemeanor charge of unauthorized removal and retention of classified material. He was fined $50,000, sentenced to 2 years probation and 100 hours community service, stripped of his security clearance for 3 years, and disbarred. The question of what exactly was in those documents — and whether Berger was protecting the Clinton administration from 9/11-related revelations — has never been fully resolved.\n\nEPSTEIN CONNECTION: Claims from conservative media sources place Berger on an Epstein flight from St. Thomas to New Jersey in September 2005. However, this claim has not been independently verified by major news outlets or official court records reviewed for this database. The connection, if any, remains at the speculative tier pending verification. Berger died of cancer on December 2, 2015, at age 70.","aliases":"Samuel Richard Berger","metadata":{"birth_date":"1945-10-28","death_date":"2015-12-02","nationality":"American","status":"deceased","photo_url":"photos/sandy_berger.jpg"}},"193":{"id":193,"name":"Sarah Ferguson","entity_type":"person","description":"Sarah Margaret Ferguson, Duchess of York (born 1959). Former wife of Prince Andrew, Duke of York (married 1986, divorced 1996). Mother of Princesses Beatrice and Eugenie.\n\nEPSTEIN CONNECTION: In 2011, Ferguson publicly acknowledged that Jeffrey Epstein had paid £15,000 to settle her debts, arranged through Prince Andrew. She stated she was 'naive' and that Andrew had arranged the payment. This payment occurred AFTER Epstein's 2008 conviction — placing Ferguson in the documented pattern of continued Epstein association post-conviction across the network.\n\nFerguson's financial difficulties were well-documented. She was caught in a 2010 News of the World sting attempting to sell access to Prince Andrew for £500,000. The Epstein payment adds to the documented financial nexus around Prince Andrew.","aliases":"Duchess of York, Fergie, Sarah Duchess of York","metadata":{"photo_url":"photos/sarah_ferguson.jpg"}},"148":{"id":148,"name":"Sarah Kellen","entity_type":"person","description":"Sarah Kellen (b. circa 1979-1980). Epstein's primary day-to-day scheduler and operational coordinator, described by victims and investigators as the administrative infrastructure of Epstein's trafficking operation.\n\nROLE: Kellen managed Epstein's calendar and logistics across his Palm Beach, Manhattan, and other properties. According to Palm Beach police reports, civil lawsuits, and victim testimony, her duties included scheduling 'massages' that were sexual abuse sessions with underage girls, coordinating victim travel, and greeting young women at Epstein's properties. Virginia Giuffre and multiple other accusers named Kellen as directly facilitating abuse.\n\nNPA CO-CONSPIRATOR: Named as one of four co-conspirators in the 2007 Non-Prosecution Agreement alongside Nadia Marcinkova, Lesley Groff, and Adriana Ross. All four received immunity from federal prosecution as part of Epstein's plea deal negotiated by US Attorney Alexander Acosta. During Ghislaine Maxwell's sentencing in 2022, Judge Alison Nathan described Kellen as 'a knowing participant in the criminal conspiracy' and 'a criminally responsible participant.'\n\nLEGAL STATUS: Despite extensive public allegations, Kellen has never been charged with a crime. Through her attorney, she has described herself as a victim of Epstein. Prosecutors declined to bring charges after Epstein's 2019 death.\n\nPERSONAL LIFE: Married NASCAR driver Brian Vickers in 2013. They divorced in 2025 after approximately 10 years of marriage.","aliases":"Sarah Kellen Vickers, Sarah Kensington","metadata":{"birth_year":1980,"nationality":"American","status":"alive","photo_url":"photos/sarah_kellen.jpg"}},"183":{"id":183,"name":"Saudi Binladin Group","entity_type":"organization","description":"Saudi Binladin Group (SBG). Saudi Arabia's largest construction company, founded by Mohammed bin Awad bin Laden (Osama bin Laden's father) in 1931. Multi-billion dollar conglomerate with exclusive contracts for Saudi holy sites (Mecca and Medina).\n\nBIN LADEN FAMILY: The family (50+ children of Mohammed bin Laden) are establishment Saudi elite — close to the royal family for decades. Osama bin Laden was the black sheep who was formally disowned by the family in 1994. The family's legitimate business empire operated at the intersection of Saudi government contracts, Western investment, and royal patronage.\n\nCARLYLE GROUP: The Saudi Binladin Group invested in the Carlyle Group, the Washington private equity firm where George H.W. Bush served as senior advisor. The bin Laden family was meeting with the Carlyle Group in Washington on the morning of September 11, 2001. They divested shortly after 9/11 under public pressure (documented in Washington Post and Craig Unger's House of Bush, House of Saud).","aliases":"SBG, Binladin Group, bin Laden family construction company","metadata":{}},"178":{"id":178,"name":"Saudi GID","entity_type":"agency","description":"Al Mukhabarat Al A'amah — the General Intelligence Directorate (GID) of Saudi Arabia. Also known as the General Intelligence Presidency (GIP). Saudi Arabia's primary foreign intelligence agency, analogous to the CIA.\n\nSAFARI CLUB (1976-1980s): The GID was a founding member of the Safari Club, an informal alliance of intelligence agencies created after the Church Committee hearings curtailed CIA covert operations. Led by Alexandre de Marenches (SDECE/France), the club included GID (Kamal Adham), SAVAK (Iran, pre-revolution), Egyptian intelligence, and Moroccan intelligence. BCCI provided the financial backbone — Adham was simultaneously CIA's principal Middle East liaison AND BCCI's secret front-man for the First American Bank takeover. Joseph Trento's Prelude to Terror documents this dual role.\n\nAFGHANISTAN: Under Turki al-Faisal (GID chief 1979-2001), the directorate co-funded the Afghan mujahideen with the CIA, matching American funding dollar-for-dollar. This covert pipeline ran through Pakistan's ISI and channeled billions to Afghan fighters, including Arab volunteers organized by bin Laden.\n\nKEY DIRECTORS: Kamal Adham (1963-1979, already in database), Turki al-Faisal (1979-2001), Nawaf bin Abdul Aziz (2001-2005), Bandar bin Sultan (briefly, as NSC chief oversaw intelligence coordination 2012-2014), Khalid bin Ali al-Humaidan (2015-present).","aliases":"General Intelligence Directorate, General Intelligence Presidency, GIP, Al Mukhabarat Al A'amah","metadata":{}},"83":{"id":83,"name":"Scarf Inc","entity_type":"organization","description":"Nicky Scarfo's construction company in Atlantic City. Controlled concrete and construction work for casino development during the 1980s Atlantic City boom. The NJ State Commission of Investigation documented organized crime influence over casino construction sub-contractors, with Scarfo's operations controlling the foundations that casinos — including Trump's — were built upon.","aliases":"Scarfo Construction","metadata":{}},"262":{"id":262,"name":"School of the Americas","entity_type":"organization","description":"U.S. military training institution at Fort Benning (now Fort Moore), Columbus, Georgia. Founded 1946. Trained over 60,000 Latin American military, law enforcement, and security personnel by 2000. Renamed WHINSEC (Western Hemisphere Institute for Security Cooperation) in 2001 after sustained criticism.\n\nNotable graduates include: Manuel Noriega (Panama dictator), Hugo Banzer Suarez (Bolivia dictator), Efrain Rios Montt (Guatemala dictator, convicted of genocide), plus officers involved in: the 1981 El Mozote massacre (900 civilians killed, El Salvador), 1980 assassination of Archbishop Oscar Romero (El Salvador), and 1989 Jesuit massacre (6 priests + housekeeper + daughter at UCA, El Salvador — UN panel found 19 of 27 killers were SOA graduates).\n\nDeclassified CIA documents from 1976 show plans for Operation Condor were developed at the School of the Americas.","aliases":"SOA, WHINSEC, Western Hemisphere Institute for Security Cooperation","metadata":{}},"131":{"id":131,"name":"Seagram","entity_type":"organization","description":"Seagram Company Ltd. One of the world's largest beverage companies, built by the Bronfman family. Founded as Distillers Corporation by Samuel Bronfman in Montreal in 1924, acquiring Joseph E. Seagram & Sons in 1928. The Bronfman fortune originated during American Prohibition, when the family legally exported spirits from Canada to US bootleggers — a business that intersected with organized crime networks controlled by Meyer Lansky and Lucky Luciano. Sons Edgar Sr. and Charles inherited the empire in 1971. Seagram held a 25% stake in DuPont (the largest shareholder) before Edgar Jr. sold it for $8.8 billion in 1995 to acquire MCA/Universal Studios. In 2000, Edgar Jr. merged Seagram with Vivendi in a $42 billion deal that destroyed the family empire — the Bronfmans' 8.6% of Vivendi Universal was worth a fraction of the original Seagram. Distilling assets went to Pernod Ricard and Diageo. The Bronfman-Seagram network is central to the Mega Group and the broader web of pro-Israel billionaire philanthropy connected to the Epstein operation.","aliases":"Seagram Company, Distillers Corporation-Seagram","metadata":{}},"162":{"id":162,"name":"Semion Mogilevich","entity_type":"person","description":"Semion Yudkovich Mogilevich (born 1946, Kyiv, Ukrainian SSR). Known as the 'Boss of Bosses' of Russian organized crime. FBI Ten Most Wanted Fugitives list (2009-2015). Indicted by DOJ in 2003 on 45 counts of racketeering, fraud, and money laundering related to a $150M stock fraud scheme through YBM Magnex International.\n\nOPERATIONS: Controls or influences the Solntsevskaya Bratva, the largest Russian organized crime group. Specializes in weapons trafficking, nuclear materials, drug trafficking, and large-scale money laundering. Interpol Red Notice issued. Despite brief arrest in Moscow (2008, released same year), has never been extradited.\n\nNETWORK CONNECTIONS: FBI and DOJ documents identify Mogilevich as operating with de facto protection of Russian state security services. Connected to the broader network through: (1) Felix Sater — Bayrock Group linked to Russian organized crime money flows documented in Senate testimony, (2) Deutsche Bank — mirror-trading scheme moved $10B of Russian money, (3) Energy sector — natural gas intermediaries between Russia and Ukraine.\n\nRepresents the Russian equivalent of Meyer Lansky — the financial architect of organized crime operating at the intersection of state power and the criminal underworld.","aliases":"Mogilevich, Don Semyon, The Brainy Don, Boss of Bosses","metadata":{"photo_url":"photos/semion_mogilevich.jpg"}},"208":{"id":208,"name":"Shabtai Shavit","entity_type":"person","description":"Shabtai Shavit (born 1939). Director of the Mossad from 1989 to 1996 — the period during which the Robert Maxwell operation collapsed (Maxwell died November 1991) and the institutional transition to successor operations occurred.\n\nCAREER: Joined the Mossad in 1964. Rose through operational divisions including counterterrorism and intelligence collection. Appointed Mossad director by Prime Minister Yitzhak Shamir in 1989, serving under Shamir, Rabin, and Peres. His tenure encompassed the First Gulf War, Oslo Accords negotiations, and the post-Cold War intelligence realignment.\n\nMAXWELL PERIOD: Shavit became Mossad director two years before Robert Maxwell's death. Multiple intelligence historians (Gordon Thomas, Ronen Bergman) document that the Mossad was managing the fallout from Maxwell's financial collapse and the risk of exposure of intelligence operations Maxwell had facilitated — particularly the PROMIS distribution network. Shavit oversaw this institutional crisis and the transition of Maxwell-era operations to new structures.\n\nPOST-SERVICE: After leaving the Mossad, Shavit served as chairman of the board of the International Institute for Counter-Terrorism (ICT) at Herzliya's Interdisciplinary Center. Has spoken publicly about intelligence matters, advocating for aggressive counterterrorism postures.","aliases":"Shavit","metadata":{"birth_year":1939,"nationality":"Israeli","status":"alive","photo_url":"photos/shabtai_shavit.jpg"}},"234":{"id":234,"name":"Social Security Reform 1983","entity_type":"event","description":"Reagan Library documents reveal Social Security reform was planned at Bohemian Grove: Edwin Harper memo to Alan Greenspan references 'the paper we discussed at the Bohemian Grove' (1981). The Greenspan Commission recommended cuts that Reagan signed into law in 1983. These cuts are still affecting Americans today — confirmed by Alex Lawson of Social Security Works.","aliases":"","metadata":{}},"163":{"id":163,"name":"Solntsevskaya Bratva","entity_type":"organization","description":"Solntsevskaya Bratva (Solntsevo Brotherhood). Moscow-based Russian organized crime syndicate, considered the largest and most powerful Russian mafia organization. Founded in the late 1980s in the Solntsevo District of Moscow.\n\nEstimated 5,000-9,000 members worldwide. Operations span extortion, drug trafficking, arms dealing, human trafficking, and large-scale money laundering. Documented by FBI, Europol, and DOJ as Semion Mogilevich's organizational base, though the group operates through a decentralized cell structure.\n\nThe Solntsevskaya Bratva represents the post-Soviet evolution of organized crime — where American organized crime families (Gambino, Genovese, etc.) operated alongside but separate from intelligence agencies, the Russian model fused the two. Former KGB officers joined or directed criminal enterprises after 1991, creating an intelligence-crime hybrid that mirrors the CIA-Lansky pattern but with institutional integration rather than parallel operation.","aliases":"Solntsevo Brotherhood, Russian Mafia","metadata":{}},"64":{"id":64,"name":"Southern Air Transport","entity_type":"organization","description":"CIA front airline. Iran-Contra arms/drugs flights. Ohio taxpayer subsidies at Wexner's behest. Bankruptcy same day as CIA IG report.","aliases":"SAT","metadata":{}},"128":{"id":128,"name":"Steve Bing","entity_type":"person","description":"Stephen Leo Bing (1965-2020). Billionaire real estate heir, film producer, and Democratic mega-donor who was a close Clinton associate. Died June 22, 2020, after falling from the 27th floor of his Century City apartment building.\n\nINHERITANCE AND CAREER: At age 18, inherited $600 million from grandfather Leo S. Bing, a prominent 1920s real estate developer. Dropped out of Stanford University to pursue entertainment, founding Shangri-La Entertainment and Shangri-La Music. Produced films including 'The Polar Express' and wrote 'Kangaroo Jack.' Invested in real estate and construction.\n\nCLINTON RELATIONSHIP: One of the largest individual donors to the Clinton Foundation, contributing between $10-25 million. In August 2009, Bing provided his private Boeing 737 for Bill Clinton's mission to North Korea to secure the release of American journalists Laura Ling and Euna Lee, covering the estimated $200,000 cost. Clinton praised Bing publicly after his death.\n\nPOLITICAL SPENDING: Major Democratic donor who contributed millions to party officials and causes, including Hillary Clinton, Nancy Pelosi, Dick Durbin, Rahm Emanuel, and Al Franken. Supported progressive ballot initiatives in California.\n\nDEATH: On June 22, 2020, Bing fell from the 27th floor of the Ten Thousand building in Century City, Los Angeles. Ruled a suicide. Friends suggested he had been depressed about isolation during the COVID-19 quarantine. At the time of his death, his liquid assets had dwindled to approximately $300,000 — having spent nearly the entire $600 million inheritance. Bing's death came approximately 10 months after Epstein's death in custody, during a period when multiple Epstein associates died under notable circumstances.\n\nPERSONAL LIFE: Had a son, Damian Hurley (b. 2002), with actress Elizabeth Hurley. Initially denied paternity; a DNA test established him as the father.","aliases":"Stephen Leo Bing","metadata":{"birth_date":"1965-03-31","death_date":"2020-06-22","nationality":"American","status":"deceased","photo_url":"photos/steve_bing.jpg"}},"227":{"id":227,"name":"Steven Bechtel Sr","entity_type":"person","description":"Patriarch of the Bechtel family and longtime head of Bechtel Corporation. Bohemian Club member — photographed at the Grove with Henry Kissinger, sent personal correspondence to him. Built the family dynasty that has profited from government contracts across multiple administrations.","aliases":"","metadata":{"photo_url":"photos/steven_bechtel_sr.jpg"}},"125":{"id":125,"name":"Steven Hoffenberg","entity_type":"person","description":"Steven Jude Hoffenberg (1945-2022). Jeffrey Epstein's early business partner and mentor who ran the largest Ponzi scheme in American history before Bernie Madoff — and who claimed Epstein was the 'architect' of the fraud.\n\nTOWERS FINANCIAL: Founded Towers Financial Corporation, a debt collection agency that between 1988 and 1993 operated as a Ponzi scheme defrauding investors of $475 million. Hoffenberg hired Epstein in 1987 through a British defense contractor named Douglas Leese, paying him $25,000 per month and giving him a $2 million non-repayable loan in 1988.\n\nEPSTEIN AS 'ARCHITECT': In court documents, Hoffenberg repeatedly claimed Epstein was 'intimately involved' in the Ponzi scheme and called him the 'architect of the scam.' Together, they attempted corporate raids on Pan Am and Emery Air Freight using Towers Financial as their vehicle. The Pan Am bid failed partly due to the Lockerbie bombing. Epstein departed Towers before its 1993 collapse and was never charged — a pattern of escaping accountability that would repeat throughout his career.\n\nNEW YORK POST: Hoffenberg briefly owned the New York Post from January to March 1993, rescuing it from bankruptcy. His tenure saw mass layoffs, a staff walkout, and missed issues before the Towers Financial collapse ended his ownership.\n\nCONVICTION AND IMPRISONMENT: Pleaded guilty in 1995. Sentenced to 20 years in federal prison. Served 18 years. After release, he publicly accused Epstein of being a co-conspirator in the fraud and in 2016 filed suit seeking restitution.\n\nDEATH: Found dead in his apartment in Derby, Connecticut, on August 23, 2022, at age 77. His body is believed to have lain undiscovered for at least seven days. Ruled a suicide. Hoffenberg had been vocal about Epstein's criminal involvement and had expressed willingness to assist investigations. He is the third figure in this network found dead by apparent suicide after making claims against powerful interests.","aliases":"Steven Jude Hoffenberg","metadata":{"birth_date":"1945-01-12","death_date":"2022-08-23","nationality":"American","status":"deceased","photo_url":"photos/steven_hoffenberg.jpg"}},"199":{"id":199,"name":"Stuart Roffey","entity_type":"person","description":"Stuart Roffey. British businessman named in unsealed Epstein court documents in January 2024. Described in documents as an associate of Ghislaine Maxwell who attended social events in Epstein's orbit.\n\nRoffey appeared in previously sealed depositions from the Giuffre v. Maxwell case. The nature and extent of his relationship with Epstein and Maxwell is documented in court filings but limited public information exists beyond what was revealed in the unsealed documents.\n\nRepresents the broader pattern of British socialites and businessmen who moved through the Epstein-Maxwell social network in London and New York.","aliases":"Roffey","metadata":{}},"63":{"id":63,"name":"Systematics","entity_type":"organization","description":"Stephens-owned tech firm. Alleged primary vehicle for NSA to implant bugged PROMIS software in banks worldwide.","aliases":"Alltel Information Services","metadata":{}},"247":{"id":247,"name":"Tammy McFadden","entity_type":"person","description":"Anti-money laundering compliance officer at Deutsche Bank, based in Jacksonville, Florida. The whistleblower who tried to stop Deutsche Bank's Epstein relationship.\n\nIn 2015, McFadden raised concerns about Epstein's transactions — telling investigators it appeared Epstein was sending wires to young women and to a French art gallery owner. Her entire Jacksonville compliance team wanted to terminate the Epstein relationship. She also flagged 102 'politically exposed persons' designated as high-risk individuals whose review had been 'deferred indefinitely.'\n\nMcFadden claims she was moved to an adjacent team shortly after raising concerns, then laid off in 2018 — characterizing it as retaliation. She reported her experience to the FBI.","aliases":"","metadata":{}},"201":{"id":201,"name":"TerraMar Project","entity_type":"organization","description":"The TerraMar Project. Ocean conservation nonprofit founded by Ghislaine Maxwell in 2012. Claimed to advocate for protection of international waters and marine biodiversity. Maxwell served as founder and public face.\n\nMaxwell spoke at United Nations events and used TerraMar to cultivate relationships with political figures, scientists, and environmentalists — the same pattern of using legitimate-seeming organizations to build social cover documented across the Epstein network (Wexner Foundation, Carbyne, etc.).\n\nDISSOLUTION: TerraMar shut down within days of Jeffrey Epstein's arrest in July 2019. IRS records showed the organization had minimal actual conservation activity relative to its public profile. The rapid dissolution after Epstein's arrest suggests TerraMar functioned primarily as a social cover and networking vehicle rather than a genuine conservation effort.","aliases":"TerraMar, The TerraMar Project","metadata":{}},"77":{"id":77,"name":"The Commission","entity_type":"organization","description":"The Commission. Governing body of the American Mafia, established by Lucky Luciano in 1931 to prevent inter-family warfare. Comprised bosses of the Five Families (Gambino, Genovese, Lucchese, Bonanno, Colombo) plus the Chicago Outfit and Buffalo family. The Commission approved major operations, settled disputes, and authorized assassinations. Broken by the 1986 Commission Trial (US v. Salerno et al.), which convicted the bosses of the Genovese, Lucchese, and Colombo families.","aliases":"Mafia Commission","metadata":{}},"65":{"id":65,"name":"The Limited","entity_type":"organization","description":"Les Wexner's retail empire. Used SAT for shipping. Victoria's Secret, Bath & Body Works.","aliases":"L Brands","metadata":{}},"245":{"id":245,"name":"Thomas Bowers","entity_type":"person","description":"Head of Deutsche Bank's American wealth-management division. Critical node connecting Deutsche Bank to both Jeffrey Epstein and Donald Trump — signed off on high-risk accounts and loans for both.\n\nWhen Bowers left Citibank for Deutsche Bank, Epstein reportedly followed. He approved new high-risk loans and credit lines. He also oversaw the private wealth division that loaned Trump approximately $2.5 billion over two decades when Trump was 'completely frozen out of the financial system' — no other major bank would lend to him.\n\nDied November 19, 2019 — found hanging at his beachfront home in Malibu, California. LA County medical examiner ruled suicide. He was 55. Federal investigators were reportedly seeking to interview him at the time of his death about documents related to Deutsche Bank.","aliases":"","metadata":{}},"129":{"id":129,"name":"Tom Barrack","entity_type":"person","description":"Thomas Joseph Barrack Jr. (b. 1947). Private equity billionaire, founder of Colony Capital, Donald Trump's longest-serving confidant, and a figure whose Middle East financial connections intersect with the Epstein network.\n\nBACKGROUND: Grandparents were Lebanese Maronite Christians who immigrated from Zahle to the US in 1900. Raised in Culver City, California. Father was a grocer. Began career as a finance lawyer, working on project finance for Aramco in Saudi Arabia. Served as CEO of Dunn International Corporation, then Senior VP at E.F. Hutton on Wall Street, then principal with the Robert M. Bass Group.\n\nCOLONY CAPITAL: Founded Colony Capital in 1991 (now DigitalBridge) with initial investments from Bass and GE Capital. Grew it into one of the world's largest private equity real estate firms with operations in 19 countries. Between June 2018 and Trump's presidency, Colony raised over $7 billion, with 24% coming from the UAE and Saudi Arabia.\n\nTRUMP RELATIONSHIP: Friends since the 1980s New York real estate market. Barrack sold Trump a stake in a department store (1985) and the Plaza Hotel ($410M, 1988). Served as senior advisor to Trump's 2016 campaign, chairman of the 2017 Inaugural Committee (raised record-breaking funds), and in the second administration as US Ambassador to Turkey, Special Envoy for Syria, and Special Envoy for Iraq.\n\nUAE INDICTMENT AND ACQUITTAL: In July 2021, indicted for acting as an unregistered agent of the UAE (April 2016-April 2018). Prosecutors alleged he inserted language praising the UAE into a Trump campaign energy speech, emailed advance drafts to UAE officials, and sought an ambassadorship that would 'give Abu Dhabi more power.' UAE sovereign wealth funds invested $374 million in Colony Capital projects. Acquitted on all charges in November 2022.\n\nEPSTEIN CONTACT: DOJ documents released in February 2026 reveal Barrack was in regular, close contact with Epstein for years after Epstein's 2008 conviction. In September 2009, months after Epstein's release, Barrack wrote: 'Thinking about u, hope u r good and life is calm again.' Exchanges include invitations to private residences, introductions to diplomats and investors, and business discussions. Epstein facilitated introductions for Barrack to Peter Thiel, Ehud Barak, and Russia's UN representative Vitaly Churkin. Epstein repeatedly urged Barrack to move communications to encrypted messaging apps. No evidence Barrack participated in or had knowledge of Epstein's criminal conduct.","aliases":"Thomas Joseph Barrack Jr.","metadata":{"birth_date":"1947-04-28","nationality":"American","status":"alive","photo_url":"photos/tom_barrack.jpg"}},"93":{"id":93,"name":"Total Information Awareness","entity_type":"program","description":"DARPA mass surveillance program directed by John Poindexter (2002). Congress defunded 2003. Capabilities migrated to NSA.","aliases":"TIA","metadata":{}},"130":{"id":130,"name":"Towers Financial","entity_type":"organization","description":"Towers Financial Corporation. New York debt collection agency founded by Steven Hoffenberg that operated as the largest Ponzi scheme in American history prior to Bernie Madoff, defrauding investors of $475 million between 1988 and 1993. Jeffrey Epstein was hired by Hoffenberg in 1987 at $25,000 per month plus a $2 million non-repayable loan. Hoffenberg later called Epstein the 'architect of the scam' in court documents. Together they attempted failed corporate raids on Pan Am and Emery Air Freight. Hoffenberg briefly used Towers to acquire the New York Post in 1993 before the scheme collapsed. Epstein departed before the collapse and was never charged — establishing the pattern of escaping accountability that defined his career. Towers Financial represents the origin story of Epstein's financial career: learning the mechanics of large-scale financial fraud.","aliases":"Towers Financial Corporation","metadata":{}},"206":{"id":206,"name":"Unit 8200","entity_type":"agency","description":"Unit 8200 (Yehida Shmoneh-Matayim). Israeli Intelligence Corps signals intelligence (SIGINT) unit, equivalent to the U.S. NSA or UK GCHQ. Based at Urim SIGINT Base in the Negev Desert and facilities near Herzliya.\n\nMISSION: Responsible for collecting signals intelligence, conducting cyber operations, and codebreaking. The largest single unit in the Israeli Defense Forces, with thousands of personnel. Conscripts are selected for high technical aptitude, typically serving from age 18-21.\n\nNSA PARTNERSHIP: Snowden documents (published by The Guardian, 2013) revealed a Memorandum of Understanding in which the NSA routinely shares raw, unfiltered intelligence data — including data on American citizens — with Unit 8200. The Intercept (2017) reported that this sharing includes metadata, content of communications, and other surveillance products, with minimal restrictions on how Israel uses data about U.S. persons.\n\nTECH PIPELINE — SURVEILLANCE INDUSTRY: Unit 8200 alumni have founded a disproportionate share of Israel's $10B+ cybersecurity and surveillance industry. Notable alumni-founded companies include: NSO Group (Pegasus spyware), Verint Systems (formerly Comverse Infosys — wiretapping tech), Check Point Software, CyberArk, Palo Alto Networks. Forbes (2016) documented the 'Unit 8200 to tech startup' pipeline as a defining feature of Israel's tech economy. Haaretz (2018) documented how these companies sell surveillance tools to authoritarian governments worldwide.\n\nCARBYNE CONNECTION: Carbyne (co-founded by Ehud Barak, Epstein investor) had former Unit 8200 director Pinhas Buchris on its board. This connects the Unit 8200 → surveillance tech pipeline directly to the Epstein network.","aliases":"Yehida Shmoneh-Matayim, 8200, Israeli SIGINT","metadata":{"country":"Israel"}},"249":{"id":249,"name":"Val Broeksmit","entity_type":"person","description":"Deutsche Bank whistleblower and FBI informant. Adopted son of senior DB executive William Broeksmit.\n\nAfter his father's suicide in January 2014, discovered thousands of confidential Deutsche Bank documents in his father's email — board meeting minutes, spreadsheets, financial plans from DB Trust Company Americas. In 2019, introduced to Rep. Adam Schiff (House Intelligence Committee) by musician Moby. Subpoenaed by Congress. Became a cooperating FBI witness — the FBI gave him a 'special advisory title' and assisted his girlfriend in obtaining a U.S. visa.\n\nHanded over hundreds of documents to the FBI related to Deutsche Bank's ties to Trump, Russia, and other illegal activity.\n\nDied April 25, 2022 — found dead on the campus of Woodrow Wilson High School in El Sereno, Los Angeles. Appeared to have fallen from a tree, suffering blunt-force trauma, broken ribs, and spinal fracture. LAPD stated no foul play suspected. LA County coroner ruled the death accidental. He was 46.\n\nNewsweek reported (December 2023) that a Deutsche Bank article was found among Trump's classified documents at Mar-a-Lago.","aliases":"","metadata":{}},"143":{"id":143,"name":"Victoria's Secret","entity_type":"organization","description":"Victoria's Secret. Lingerie brand owned by Les Wexner's L Brands (The Limited). Epstein exploited his relationship with Wexner to pose as a Victoria's Secret talent recruiter, using business cards identifying himself as a VS scout. Multiple victims reported being lured by promises of modeling work for the brand. Actress Alicia Arden filed a 1997 police report stating Epstein misrepresented himself as a VS recruiter before an alleged assault. Model Elisabetta Tai reported being given Epstein's address by her booker in 2004, told he was 'one of the most important people in modeling.' In 1993, a female L Brands executive informed Wexner that Epstein was posing as a VS recruiter — Wexner's attorney said he 'confronted Epstein' but did not sever the financial relationship until 2007. Maria Farmer reported an assault by Epstein and Maxwell at Wexner's Ohio property in 1996. The Victoria's Secret pipeline demonstrates how Epstein weaponized a legitimate corporate brand as recruitment infrastructure for trafficking.","aliases":"VS","metadata":{}},"145":{"id":145,"name":"Virginia Giuffre","entity_type":"person","description":"Virginia Louise Giuffre, nee Roberts (1983-2025). The most prominent survivor and witness in the Jeffrey Epstein sex trafficking case. Her public testimony, civil lawsuits, and advocacy fundamentally shaped public knowledge of the Epstein operation.\n\nBACKGROUND: Born August 9, 1983, in Sacramento, California. Suffered childhood sexual abuse beginning at age seven. Ran away from home as a teenager and was living in a troubled circumstances when she was recruited.\n\nRECRUITMENT AT MAR-A-LAGO (2000): At age 16, while working as a spa attendant at Donald Trump's Mar-a-Lago resort in Palm Beach, Florida, Giuffre was approached by Ghislaine Maxwell and recruited into Jeffrey Epstein's sex trafficking operation under the guise of a massage therapy job. This recruitment at Mar-a-Lago places the operation's victim pipeline at the doorstep of a future US president's primary residence.\n\nTRAFFICKING ALLEGATIONS: Giuffre testified in depositions and civil filings that she was trafficked to numerous powerful men, including Prince Andrew (Duke of York), Alan Dershowitz, former New Mexico Governor Bill Richardson, and others. She described being transported to Epstein's properties in Manhattan, Palm Beach, New Mexico (Zorro Ranch), the US Virgin Islands (Little Saint James), and abroad.\n\nLEGAL ACTIONS: Filed landmark civil suits that cracked open the case. Her 2009 lawsuit as 'Jane Doe 102' against Epstein was settled for $500,000. In 2015, she intervened in the Dershowitz defamation case. Her 2021 civil suit against Prince Andrew was settled in February 2022 for a reported sum estimated between 3 million and 12 million pounds, with Andrew making a 'substantial donation' to Giuffre's victims' charity — with no admission of liability.\n\nADVOCACY: In 2015, Giuffre founded Victims Refuse Silence (later relaunched as SOAR — Speak Out, Act, Reclaim) to support abuse survivors. She was the first Epstein victim to waive anonymity and speak publicly (2011), providing critical information to law enforcement that contributed to Ghislaine Maxwell's 2021 conviction.\n\nDEATH: Died by suicide on April 25, 2025, at age 41, at her farm in Neergabby, Western Australia. She had been in a custody battle and divorce proceedings and had been prevented from seeing her three children. Her posthumous memoir, 'Nobody's Girl,' was published in October 2025. Other survivors credited Giuffre with giving them the courage to speak out.","aliases":"Virginia Roberts, Jenna","metadata":{"birth_date":"1983-08-09","death_date":"2025-04-25","nationality":"American-Australian","status":"deceased","photo_url":"photos/virginia_giuffre.jpg"}},"160":{"id":160,"name":"Vladimir Putin","entity_type":"person","description":"Vladimir Vladimirovich Putin (born 1952). President of the Russian Federation (2000-2008, 2012-present), Prime Minister (1999-2000, 2008-2012). Career intelligence officer in the KGB (1975-1991), stationed in Dresden, East Germany coordinating with the Stasi. Resigned from KGB with rank of Lieutenant Colonel.\n\nPOST-KGB CAREER: Deputy Mayor of St. Petersburg under Anatoly Sobchak (1991-1996). Multiple investigative accounts (Dawisha, Belton) document extensive ties to organized crime during this period — specifically the Tambov and Malyshev gangs controlling St. Petersburg's port and export licensing. Moved to Moscow 1996, rose through presidential administration. Appointed FSB Director (July 1998), Prime Minister (August 1999), Acting President (December 1999).\n\nINTELLIGENCE-CRIME NEXUS: Putin represents the institutional fusion of state intelligence and organized crime in post-Soviet Russia — the same pattern documented in the American context through CIA-Lansky-Cohn. Multiple documented connections to this network: Felix Sater (Russian-born FBI/GRU asset operating through Bayrock Group on Trump properties), Deutsche Bank (fined $630M for Russian mirror-trading scheme, same bank serving Epstein and Trump), and the broader oligarch financial architecture.\n\nPERSONAL WEALTH: Estimated $40-200 billion held through oligarch cutouts. Panama Papers (2016) documented $2B in offshore accounts linked to cellist Sergei Roldugin, a childhood friend of Putin.","aliases":"Putin, VVP","metadata":{"photo_url":"photos/vladimir_putin.jpg"}},"187":{"id":187,"name":"Wafic Said","entity_type":"person","description":"Wafic Rida Said (born 1939). Syrian-born, Saudi-based billionaire businessman and philanthropist. The primary middleman in the BAE Systems Al-Yamamah arms deal — the largest arms contract in British history.\n\nAL-YAMAMAH BROKER: Said brokered the Al-Yamamah deal between British Aerospace (now BAE Systems) and the Saudi government beginning in 1985. His commission payments were estimated at $200+ million. The UK Serious Fraud Office investigated the deal but the investigation was shut down by the Blair government in 2006 citing national security.\n\nCONNECTIONS: Said maintained close relationships with both the Saudi royal family (particularly Prince Bandar) and the British establishment. He donated $40+ million to Oxford University (Said Business School bears his name). He operated at the intersection of Saudi intelligence interests, British defense industry, and Western financial networks.\n\nARMS DEALING LINEAGE: Said's role as Al-Yamamah broker places him in the same functional category as Adnan Khashoggi (Iran-Contra middleman, BCCI client) — Saudi-connected arms deal intermediaries who served as bridges between Western defense industries and Saudi government procurement, generating massive commission-based slush funds.","aliases":"Wafic Rida Said","metadata":{"birth_date":"1939-01-01","nationality":"Syrian-Saudi","status":"alive","photo_url":"photos/wafic_said.jpg"}},"170":{"id":170,"name":"Wang Jun","entity_type":"person","description":"Wang Jun (born c. 1941). Son of former Chinese Vice President Wang Zhen. Simultaneously served as Chairman of CITIC (China International Trust and Investment Corporation) and Chairman of Poly Technologies/Poly Group.\n\nCITIC: State-owned investment conglomerate established in 1979 at the direction of Deng Xiaoping. The Rand Corporation identified CITIC as a front for the PLA in 1997. CITIC's vice chair Xiong Xianghui was drawn from the Intelligence Bureau of the Joint Staff Department, and significant CITIC leadership had intelligence backgrounds.\n\nPOLY TECHNOLOGIES: The commercial arm of the PLA's global munitions operations. Spun off from CITIC in 1984. Under Wang Jun's leadership, Poly was implicated in Operation Dragon Fire — the largest seizure of smuggled automatic weapons in U.S. law enforcement history. Federal agents seized 2,000 illegally imported AK-47 rifles linked to Poly. The suspects had to call PLA headquarters in Beijing to authorize the shipment.\n\nCLINTON WHITE HOUSE VISIT: On February 6, 1996, Wang attended a White House coffee meeting with President Clinton, arranged by Charlie Trie. This occurred while the Dragon Fire investigation was active. Clinton later called it 'clearly inappropriate.' The Washington Post reported that U.S. intelligence had suspected Wang's companies of arming rogue states and funneling American military technology back to China.","aliases":"","metadata":{"photo_url":"photos/wang_jun.jpg"}},"68":{"id":68,"name":"Wexner Foundation","entity_type":"foundation","description":"Les Wexner's philanthropic vehicle. Paid Ehud Barak $2M for vague 'research.'","aliases":"","metadata":{}},"105":{"id":105,"name":"Wexner House Oversight Deposition (2026)","entity_type":"event","description":"House Oversight Committee deposition of Les Wexner regarding the Jeffrey Epstein network, conducted February 18, 2026. Attorney Michael Levy caught on hot microphone threatening Wexner for answering committee questions. Wexner identified as co-conspirator on 2019 FBI document. Part of the House Oversight Committee's broader investigation into the Epstein network and intelligence connections.","aliases":"","metadata":{}},"8":{"id":8,"name":"William Barr","entity_type":"person","description":"William Pelham Barr (b. 1950). US Attorney General under George H.W. Bush (1991-1993) and Donald Trump (2019-2020). Connected to multiple cover-ups spanning three decades.\n\nFAMILY CONNECTION TO EPSTEIN: Father Donald Barr was headmaster at the Dalton School when he hired 20-year-old Jeffrey Epstein to teach calculus and physics in 1974, despite Epstein lacking a college degree or teaching credentials. Donald Barr was an OSS (Office of Strategic Services) veteran — the WWII predecessor to the CIA. He authored a 1973 science fiction novel, 'Space Relations,' depicting a planet where oligarchs practice sexual slavery.\n\nFIRST TERM AS AG (BUSH 41): Oversaw the BCCI cover-up, ensuring the largest criminal banking scandal in history resulted in minimal accountability for CIA-connected figures. Recommended pardons for Iran-Contra figures, effectively ending investigations that could have exposed CIA drug trafficking and illegal arms deals. Per Terry Reed's testimony, Barr served as CIA Director Casey's emissary to Governor Bill Clinton regarding money laundering operations through Arkansas.\n\nSECOND TERM AS AG (TRUMP): Appointed by Donald Trump in 2019 — the same year Epstein was re-arrested. As Attorney General during Epstein's death at MCC on August 10, 2019, Barr oversaw the investigation. Declared the death a suicide despite multiple anomalies: simultaneous camera failures, sleeping guards who falsified records, and a hyoid bone fracture pattern disputed by forensic pathologists. The investigation into Epstein's co-conspirators produced no significant indictments beyond Ghislaine Maxwell.\n\nPATTERN: Barr's career spans both major cover-up eras — the BCCI/Iran-Contra period (1991-1993) and the Epstein death investigation (2019). In both cases, he held the office with authority to either expose or bury intelligence community connections to criminal networks. In both cases, investigations were curtailed.","aliases":"Bill Barr","metadata":{"photo_url":"photos/barr.jpg","birth_date":"1950-05-23","nationality":"American","status":"alive"}},"248":{"id":248,"name":"William Broeksmit","entity_type":"person","description":"Senior Deutsche Bank executive — head of risk and capital optimization. American national who joined DB from Merrill Lynch in the 1990s alongside future co-CEO Anshu Jain.\n\nIn 2012, BaFin (German financial regulator) blocked his appointment to the management board as head of risk management. He retired from DB in February 2013 and was reported to be 'very anxious' about authorities investigating areas where he had worked.\n\nDied January 26, 2014 — found hanging at his Kensington home in London. London inquest ruled suicide. He was 58. Left several notes for family and friends.\n\nAfter his death, his adopted son Val Broeksmit discovered thousands of confidential Deutsche Bank documents in his email account — board meeting minutes, spreadsheets, financial plans — which became the basis for federal investigations into Deutsche Bank's ties to Trump and Russia.","aliases":"","metadata":{}},"10":{"id":10,"name":"William Casey","entity_type":"person","description":"CIA Director 1981-87. Iran-Contra architect. Daily calls with Roy Cohn. BCCI meetings alleged. Mena/Arkansas operations.","aliases":"Bill Casey","metadata":{"photo_url":"photos/casey.jpg","birth_date":"1913-03-13","death_date":"1987-05-06","nationality":"American","status":"deceased"}},"137":{"id":137,"name":"Woody Allen","entity_type":"person","description":"Woody Allen (b. 1935). Director, writer, and actor whose close personal friendship with Jeffrey Epstein is extensively documented in Epstein's emails and photographs, including Epstein arranging a White House visit for Allen and his wife.\n\nCAREER: Born Allan Stewart Konigsberg in Brooklyn, New York. One of the most prolific filmmakers in American cinema with over 50 directed films including Annie Hall (1977), Manhattan (1979), and Midnight in Paris (2011). Four-time Academy Award winner.\n\nEPSTEIN FRIENDSHIP: Allen and Epstein were longstanding friends and neighbors on Manhattan's Upper East Side who dined together regularly. Photographs show Allen and his wife Soon-Yi Previn leaving Epstein's East 71st Street townhouse in September 2013 — five years after Epstein's 2008 guilty plea to child prostitution charges. Epstein files released by the DOJ in 2026 show extensive email communication between the two, revealing that they offered each other emotional support during periods when both were being publicly criticized for sexual misconduct allegations.\n\nWHITE HOUSE VISIT: In May 2015, Epstein emailed former Obama White House counsel Kathy Ruemmler: 'Could you show Soon Yi the White House. I assume Woody would be too politically sensitive?' Ruemmler responded that she could show both of them. White House records confirm Allen, Previn, and Ruemmler visited on December 27, 2015 (Obama was in Hawaii). This demonstrates Epstein's continued ability to leverage political access even after his 2008 conviction.\n\nOWN ABUSE ALLEGATIONS: Separately accused of sexual abuse by adoptive daughter Dylan Farrow (allegation first made in 1992). Allen was never charged. He married Soon-Yi Previn, the adopted daughter of his former partner Mia Farrow, in 1997. Allen has denied all allegations. His social proximity to Epstein, combined with his own allegations, illustrates the network's pattern of mutual support among accused figures.","aliases":"Allan Stewart Konigsberg","metadata":{"birth_year":1935,"nationality":"American","status":"alive","photo_url":"photos/woody_allen.jpg"}},"155":{"id":155,"name":"Zorro Ranch","entity_type":"facility","description":"Zorro Ranch. A 10,000-acre private property located near Stanley, New Mexico, approximately 30 miles southeast of Santa Fe. Owned by Jeffrey Epstein from the early 1990s until his death in 2019. Approximately 1,200 acres were leased from the New Mexico State Land Commission.\n\nVirginia Giuffre testified in her 2016 deposition that she was trafficked to powerful men at the ranch, specifically alleging that Ghislaine Maxwell instructed her to provide sexual services to former New Mexico Governor Bill Richardson there. Annie Farmer, then 15, was sexually assaulted by Epstein at the ranch in April 1996.\n\nEpstein donated $50,000 to Governor Richardson's 2006 reelection campaign and $15,000 to the state Attorney General race. In 2019, the New Mexico State Land Office cancelled Epstein's grazing lease. As of 2026, New Mexico has approved a comprehensive probe of the ranch through an Epstein Truth Commission, and the DOJ is investigating claims of burials near the property.","aliases":"Epstein Ranch, Stanley Ranch","metadata":{}}}